flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*
 * Constants & macros for individual FLEXIO_SHIFTBUFBYSn bitfields
 */

/*!
 * @name Register FLEXIO_SHIFTBUFBYSn, field SHIFTBUFBYS[31:0] (RW)
 *
 * Alias to SHIFTBUF register, except reads/writes to this register are byte
 * swapped. Reads return { SHIFTBUF[7:0], SHIFTBUF[15:8], SHIFTBUF[23:16],
 * SHIFTBUF[31:24] }.
 */
/*@{*/
#define BP_FLEXIO_SHIFTBUFBYSn_SHIFTBUFBYS (0U) /*!< Bit position for FLEXIO_SHIFTBUFBYSn_SHIFTBUFBYS. */
#define BM_FLEXIO_SHIFTBUFBYSn_SHIFTBUFBYS (0xFFFFFFFFU) /*!< Bit mask for FLEXIO_SHIFTBUFBYSn_SHIFTBUFBYS. */
#define BS_FLEXIO_SHIFTBUFBYSn_SHIFTBUFBYS (32U) /*!< Bit field size in bits for FLEXIO_SHIFTBUFBYSn_SHIFTBUFBYS. */

/*! @brief Read current value of the FLEXIO_SHIFTBUFBYSn_SHIFTBUFBYS field. */
#define BR_FLEXIO_SHIFTBUFBYSn_SHIFTBUFBYS(x, n) (HW_FLEXIO_SHIFTBUFBYSn(x, n).U)

/*! @brief Format value for bitfield FLEXIO_SHIFTBUFBYSn_SHIFTBUFBYS. */
#define BF_FLEXIO_SHIFTBUFBYSn_SHIFTBUFBYS(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_SHIFTBUFBYSn_SHIFTBUFBYS) & BM_FLEXIO_SHIFTBUFBYSn_SHIFTBUFBYS)

/*! @brief Set the SHIFTBUFBYS field to a new value. */
#define BW_FLEXIO_SHIFTBUFBYSn_SHIFTBUFBYS(x, n, v) (HW_FLEXIO_SHIFTBUFBYSn_WR(x, n, v))
/*@}*/

/*******************************************************************************
 * HW_FLEXIO_SHIFTBUFBISn - Shifter Buffer N Bit Swapped Register
 ******************************************************************************/

/*!
 * @brief HW_FLEXIO_SHIFTBUFBISn - Shifter Buffer N Bit Swapped Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * .
 */
typedef union _hw_flexio_shiftbufbisn
{
    uint32_t U;
    struct _hw_flexio_shiftbufbisn_bitfields
    {
        uint32_t SHIFTBUFBIS : 32;     /*!< [31:0] Shift Buffer */
    } B;
} hw_flexio_shiftbufbisn_t;

/*!
 * @name Constants and macros for entire FLEXIO_SHIFTBUFBISn register
 */
/*@{*/
#define HW_FLEXIO_SHIFTBUFBISn_COUNT (4U)

#define HW_FLEXIO_SHIFTBUFBISn_ADDR(x, n) ((uint32_t)(x) + 0x380U + (0x4U * (n)))

#define HW_FLEXIO_SHIFTBUFBISn(x, n) (*(__IO hw_flexio_shiftbufbisn_t *) HW_FLEXIO_SHIFTBUFBISn_ADDR(x, n))
#define HW_FLEXIO_SHIFTBUFBISn_RD(x, n) (HW_FLEXIO_SHIFTBUFBISn(x, n).U)
#define HW_FLEXIO_SHIFTBUFBISn_WR(x, n, v) (HW_FLEXIO_SHIFTBUFBISn(x, n).U = (v))
#define HW_FLEXIO_SHIFTBUFBISn_SET(x, n, v) (BME_OR32(HW_FLEXIO_SHIFTBUFBISn_ADDR(x, n), (uint32_t)(v)))
#define HW_FLEXIO_SHIFTBUFBISn_CLR(x, n, v) (BME_AND32(HW_FLEXIO_SHIFTBUFBISn_ADDR(x, n), (uint32_t)(~(v))))
#define HW_FLEXIO_SHIFTBUFBISn_TOG(x, n, v) (BME_XOR32(HW_FLEXIO_SHIFTBUFBISn_ADDR(x, n), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual FLEXIO_SHIFTBUFBISn bitfields
 */

/*!
 * @name Register FLEXIO_SHIFTBUFBISn, field SHIFTBUFBIS[31:0] (RW)
 *
 * Alias to SHIFTBUF register, except reads/writes to this register are bit
 * swapped. Reads return SHIFTBUF[0:31].
 */
/*@{*/
#define BP_FLEXIO_SHIFTBUFBISn_SHIFTBUFBIS (0U) /*!< Bit position for FLEXIO_SHIFTBUFBISn_SHIFTBUFBIS. */
#define BM_FLEXIO_SHIFTBUFBISn_SHIFTBUFBIS (0xFFFFFFFFU) /*!< Bit mask for FLEXIO_SHIFTBUFBISn_SHIFTBUFBIS. */
#define BS_FLEXIO_SHIFTBUFBISn_SHIFTBUFBIS (32U) /*!< Bit field size in bits for FLEXIO_SHIFTBUFBISn_SHIFTBUFBIS. */

/*! @brief Read current value of the FLEXIO_SHIFTBUFBISn_SHIFTBUFBIS field. */
#define BR_FLEXIO_SHIFTBUFBISn_SHIFTBUFBIS(x, n) (HW_FLEXIO_SHIFTBUFBISn(x, n).U)

/*! @brief Format value for bitfield FLEXIO_SHIFTBUFBISn_SHIFTBUFBIS. */
#define BF_FLEXIO_SHIFTBUFBISn_SHIFTBUFBIS(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_SHIFTBUFBISn_SHIFTBUFBIS) & BM_FLEXIO_SHIFTBUFBISn_SHIFTBUFBIS)

/*! @brief Set the SHIFTBUFBIS field to a new value. */
#define BW_FLEXIO_SHIFTBUFBISn_SHIFTBUFBIS(x, n, v) (HW_FLEXIO_SHIFTBUFBISn_WR(x, n, v))
/*@}*/

/*******************************************************************************
 * HW_FLEXIO_TIMCTLn - Timer Control N Register
 ******************************************************************************/

/*!
 * @brief HW_FLEXIO_TIMCTLn - Timer Control N Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * .
 */
typedef union _hw_flexio_timctln
{
    uint32_t U;
    struct _hw_flexio_timctln_bitfields
    {
        uint32_t TIMOD : 2;            /*!< [1:0] Timer Mode */
        uint32_t RESERVED0 : 5;        /*!< [6:2]  */
        uint32_t PINPOL : 1;           /*!< [7] Timer Pin Polarity */
        uint32_t PINSEL : 3;           /*!< [10:8] Timer Pin Select */
        uint32_t RESERVED1 : 5;        /*!< [15:11]  */
        uint32_t PINCFG : 2;           /*!< [17:16] Timer Pin Configuration */
        uint32_t RESERVED2 : 4;        /*!< [21:18]  */
        uint32_t TRGSRC : 1;           /*!< [22] Trigger Source */
        uint32_t TRGPOL : 1;           /*!< [23] Trigger Polarity */
        uint32_t TRGSEL : 4;           /*!< [27:24] Trigger Select */
        uint32_t RESERVED3 : 4;        /*!< [31:28]  */
    } B;
} hw_flexio_timctln_t;

/*!
 * @name Constants and macros for entire FLEXIO_TIMCTLn register
 */
/*@{*/
#define HW_FLEXIO_TIMCTLn_COUNT (4U)

#define HW_FLEXIO_TIMCTLn_ADDR(x, n) ((uint32_t)(x) + 0x400U + (0x4U * (n)))

#define HW_FLEXIO_TIMCTLn(x, n)  (*(__IO hw_flexio_timctln_t *) HW_FLEXIO_TIMCTLn_ADDR(x, n))
#define HW_FLEXIO_TIMCTLn_RD(x, n) (HW_FLEXIO_TIMCTLn(x, n).U)
#define HW_FLEXIO_TIMCTLn_WR(x, n, v) (HW_FLEXIO_TIMCTLn(x, n).U = (v))
#define HW_FLEXIO_TIMCTLn_SET(x, n, v) (BME_OR32(HW_FLEXIO_TIMCTLn_ADDR(x, n), (uint32_t)(v)))
#define HW_FLEXIO_TIMCTLn_CLR(x, n, v) (BME_AND32(HW_FLEXIO_TIMCTLn_ADDR(x, n), (uint32_t)(~(v))))
#define HW_FLEXIO_TIMCTLn_TOG(x, n, v) (BME_XOR32(HW_FLEXIO_TIMCTLn_ADDR(x, n), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual FLEXIO_TIMCTLn bitfields
 */

/*!
 * @name Register FLEXIO_TIMCTLn, field TIMOD[1:0] (RW)
 *
 * In 8-bit counter mode, the lower 8-bits of the counter and compare register
 * are used to configure the baud rate of the timer shift clock and the upper
 * 8-bits are used to configure the shifter bit count. In 8-bit PWM mode, the lower
 * 8-bits of the counter and compare register are used to configure the high
 * period of the timer shift clock and the upper 8-bits are used to configure the low
 * period of the timer shift clock. The shifter bit count is configured using
 * another timer or external signal. In 16-bit counter mode, the full 16-bits of the
 * counter and compare register are used to configure either the baud rate of
 * the shift clock or the shifter bit count.
 *
 * Values:
 * - 00 - Timer Disabled.
 * - 01 - Dual 8-bit counters baud/bit mode.
 * - 10 - Dual 8-bit counters PWM mode.
 * - 11 - Single 16-bit counter mode.
 */
/*@{*/
#define BP_FLEXIO_TIMCTLn_TIMOD (0U)       /*!< Bit position for FLEXIO_TIMCTLn_TIMOD. */
#define BM_FLEXIO_TIMCTLn_TIMOD (0x00000003U) /*!< Bit mask for FLEXIO_TIMCTLn_TIMOD. */
#define BS_FLEXIO_TIMCTLn_TIMOD (2U)       /*!< Bit field size in bits for FLEXIO_TIMCTLn_TIMOD. */

/*! @brief Read current value of the FLEXIO_TIMCTLn_TIMOD field. */
#define BR_FLEXIO_TIMCTLn_TIMOD(x, n) (BME_UBFX32(HW_FLEXIO_TIMCTLn_ADDR(x, n), BP_FLEXIO_TIMCTLn_TIMOD, BS_FLEXIO_TIMCTLn_TIMOD))

