flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Format value for bitfield FLEXIO_TIMCTLn_TIMOD. */
#define BF_FLEXIO_TIMCTLn_TIMOD(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_TIMCTLn_TIMOD) & BM_FLEXIO_TIMCTLn_TIMOD)

/*! @brief Set the TIMOD field to a new value. */
#define BW_FLEXIO_TIMCTLn_TIMOD(x, n, v) (BME_BFI32(HW_FLEXIO_TIMCTLn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_TIMCTLn_TIMOD), BP_FLEXIO_TIMCTLn_TIMOD, 2))
/*@}*/

/*!
 * @name Register FLEXIO_TIMCTLn, field PINPOL[7] (RW)
 *
 * Values:
 * - 0 - Pin is active high
 * - 1 - Pin is active low
 */
/*@{*/
#define BP_FLEXIO_TIMCTLn_PINPOL (7U)      /*!< Bit position for FLEXIO_TIMCTLn_PINPOL. */
#define BM_FLEXIO_TIMCTLn_PINPOL (0x00000080U) /*!< Bit mask for FLEXIO_TIMCTLn_PINPOL. */
#define BS_FLEXIO_TIMCTLn_PINPOL (1U)      /*!< Bit field size in bits for FLEXIO_TIMCTLn_PINPOL. */

/*! @brief Read current value of the FLEXIO_TIMCTLn_PINPOL field. */
#define BR_FLEXIO_TIMCTLn_PINPOL(x, n) (BME_UBFX32(HW_FLEXIO_TIMCTLn_ADDR(x, n), BP_FLEXIO_TIMCTLn_PINPOL, BS_FLEXIO_TIMCTLn_PINPOL))

/*! @brief Format value for bitfield FLEXIO_TIMCTLn_PINPOL. */
#define BF_FLEXIO_TIMCTLn_PINPOL(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_TIMCTLn_PINPOL) & BM_FLEXIO_TIMCTLn_PINPOL)

/*! @brief Set the PINPOL field to a new value. */
#define BW_FLEXIO_TIMCTLn_PINPOL(x, n, v) (BME_BFI32(HW_FLEXIO_TIMCTLn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_TIMCTLn_PINPOL), BP_FLEXIO_TIMCTLn_PINPOL, 1))
/*@}*/

/*!
 * @name Register FLEXIO_TIMCTLn, field PINSEL[10:8] (RW)
 *
 * Selects which pin is used by the Timer input or output.
 */
/*@{*/
#define BP_FLEXIO_TIMCTLn_PINSEL (8U)      /*!< Bit position for FLEXIO_TIMCTLn_PINSEL. */
#define BM_FLEXIO_TIMCTLn_PINSEL (0x00000700U) /*!< Bit mask for FLEXIO_TIMCTLn_PINSEL. */
#define BS_FLEXIO_TIMCTLn_PINSEL (3U)      /*!< Bit field size in bits for FLEXIO_TIMCTLn_PINSEL. */

/*! @brief Read current value of the FLEXIO_TIMCTLn_PINSEL field. */
#define BR_FLEXIO_TIMCTLn_PINSEL(x, n) (BME_UBFX32(HW_FLEXIO_TIMCTLn_ADDR(x, n), BP_FLEXIO_TIMCTLn_PINSEL, BS_FLEXIO_TIMCTLn_PINSEL))

/*! @brief Format value for bitfield FLEXIO_TIMCTLn_PINSEL. */
#define BF_FLEXIO_TIMCTLn_PINSEL(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_TIMCTLn_PINSEL) & BM_FLEXIO_TIMCTLn_PINSEL)

/*! @brief Set the PINSEL field to a new value. */
#define BW_FLEXIO_TIMCTLn_PINSEL(x, n, v) (BME_BFI32(HW_FLEXIO_TIMCTLn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_TIMCTLn_PINSEL), BP_FLEXIO_TIMCTLn_PINSEL, 3))
/*@}*/

/*!
 * @name Register FLEXIO_TIMCTLn, field PINCFG[17:16] (RW)
 *
 * Values:
 * - 00 - Timer pin output disabled
 * - 01 - Timer pin open drain or bidirectional output enable
 * - 10 - Timer pin bidirectional output data
 * - 11 - Timer pin output
 */
/*@{*/
#define BP_FLEXIO_TIMCTLn_PINCFG (16U)     /*!< Bit position for FLEXIO_TIMCTLn_PINCFG. */
#define BM_FLEXIO_TIMCTLn_PINCFG (0x00030000U) /*!< Bit mask for FLEXIO_TIMCTLn_PINCFG. */
#define BS_FLEXIO_TIMCTLn_PINCFG (2U)      /*!< Bit field size in bits for FLEXIO_TIMCTLn_PINCFG. */

/*! @brief Read current value of the FLEXIO_TIMCTLn_PINCFG field. */
#define BR_FLEXIO_TIMCTLn_PINCFG(x, n) (BME_UBFX32(HW_FLEXIO_TIMCTLn_ADDR(x, n), BP_FLEXIO_TIMCTLn_PINCFG, BS_FLEXIO_TIMCTLn_PINCFG))

/*! @brief Format value for bitfield FLEXIO_TIMCTLn_PINCFG. */
#define BF_FLEXIO_TIMCTLn_PINCFG(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_TIMCTLn_PINCFG) & BM_FLEXIO_TIMCTLn_PINCFG)

/*! @brief Set the PINCFG field to a new value. */
#define BW_FLEXIO_TIMCTLn_PINCFG(x, n, v) (BME_BFI32(HW_FLEXIO_TIMCTLn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_TIMCTLn_PINCFG), BP_FLEXIO_TIMCTLn_PINCFG, 2))
/*@}*/

/*!
 * @name Register FLEXIO_TIMCTLn, field TRGSRC[22] (RW)
 *
 * Values:
 * - 0 - External trigger selected
 * - 1 - Internal trigger selected
 */
/*@{*/
#define BP_FLEXIO_TIMCTLn_TRGSRC (22U)     /*!< Bit position for FLEXIO_TIMCTLn_TRGSRC. */
#define BM_FLEXIO_TIMCTLn_TRGSRC (0x00400000U) /*!< Bit mask for FLEXIO_TIMCTLn_TRGSRC. */
#define BS_FLEXIO_TIMCTLn_TRGSRC (1U)      /*!< Bit field size in bits for FLEXIO_TIMCTLn_TRGSRC. */

/*! @brief Read current value of the FLEXIO_TIMCTLn_TRGSRC field. */
#define BR_FLEXIO_TIMCTLn_TRGSRC(x, n) (BME_UBFX32(HW_FLEXIO_TIMCTLn_ADDR(x, n), BP_FLEXIO_TIMCTLn_TRGSRC, BS_FLEXIO_TIMCTLn_TRGSRC))

/*! @brief Format value for bitfield FLEXIO_TIMCTLn_TRGSRC. */
#define BF_FLEXIO_TIMCTLn_TRGSRC(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_TIMCTLn_TRGSRC) & BM_FLEXIO_TIMCTLn_TRGSRC)

/*! @brief Set the TRGSRC field to a new value. */
#define BW_FLEXIO_TIMCTLn_TRGSRC(x, n, v) (BME_BFI32(HW_FLEXIO_TIMCTLn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_TIMCTLn_TRGSRC), BP_FLEXIO_TIMCTLn_TRGSRC, 1))
/*@}*/

/*!
 * @name Register FLEXIO_TIMCTLn, field TRGPOL[23] (RW)
 *
 * Values:
 * - 0 - Trigger active high
 * - 1 - Trigger active low
 */
/*@{*/
#define BP_FLEXIO_TIMCTLn_TRGPOL (23U)     /*!< Bit position for FLEXIO_TIMCTLn_TRGPOL. */
#define BM_FLEXIO_TIMCTLn_TRGPOL (0x00800000U) /*!< Bit mask for FLEXIO_TIMCTLn_TRGPOL. */
#define BS_FLEXIO_TIMCTLn_TRGPOL (1U)      /*!< Bit field size in bits for FLEXIO_TIMCTLn_TRGPOL. */

/*! @brief Read current value of the FLEXIO_TIMCTLn_TRGPOL field. */
#define BR_FLEXIO_TIMCTLn_TRGPOL(x, n) (BME_UBFX32(HW_FLEXIO_TIMCTLn_ADDR(x, n), BP_FLEXIO_TIMCTLn_TRGPOL, BS_FLEXIO_TIMCTLn_TRGPOL))

/*! @brief Format value for bitfield FLEXIO_TIMCTLn_TRGPOL. */
#define BF_FLEXIO_TIMCTLn_TRGPOL(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_TIMCTLn_TRGPOL) & BM_FLEXIO_TIMCTLn_TRGPOL)

/*! @brief Set the TRGPOL field to a new value. */
#define BW_FLEXIO_TIMCTLn_TRGPOL(x, n, v) (BME_BFI32(HW_FLEXIO_TIMCTLn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_TIMCTLn_TRGPOL), BP_FLEXIO_TIMCTLn_TRGPOL, 1))
/*@}*/

/*!
 * @name Register FLEXIO_TIMCTLn, field TRGSEL[27:24] (RW)
 *
 * Refer to the chip configuration section for external trigger selection. The
 * internal trigger selection is configured as follows.
 */
/*@{*/
#define BP_FLEXIO_TIMCTLn_TRGSEL (24U)     /*!< Bit position for FLEXIO_TIMCTLn_TRGSEL. */
#define BM_FLEXIO_TIMCTLn_TRGSEL (0x0F000000U) /*!< Bit mask for FLEXIO_TIMCTLn_TRGSEL. */
#define BS_FLEXIO_TIMCTLn_TRGSEL (4U)      /*!< Bit field size in bits for FLEXIO_TIMCTLn_TRGSEL. */

/*! @brief Read current value of the FLEXIO_TIMCTLn_TRGSEL field. */
#define BR_FLEXIO_TIMCTLn_TRGSEL(x, n) (BME_UBFX32(HW_FLEXIO_TIMCTLn_ADDR(x, n), BP_FLEXIO_TIMCTLn_TRGSEL, BS_FLEXIO_TIMCTLn_TRGSEL))

/*! @brief Format value for bitfield FLEXIO_TIMCTLn_TRGSEL. */
#define BF_FLEXIO_TIMCTLn_TRGSEL(v) ((uint32_t)((uint32_t)(v) << BP_FLEXIO_TIMCTLn_TRGSEL) & BM_FLEXIO_TIMCTLn_TRGSEL)

/*! @brief Set the TRGSEL field to a new value. */
#define BW_FLEXIO_TIMCTLn_TRGSEL(x, n, v) (BME_BFI32(HW_FLEXIO_TIMCTLn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_TIMCTLn_TRGSEL), BP_FLEXIO_TIMCTLn_TRGSEL, 4))
/*@}*/

