flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Set the CMP field to a new value. */
#define BW_FLEXIO_TIMCMPn_CMP(x, n, v) (BME_BFI32(HW_FLEXIO_TIMCMPn_ADDR(x, n), ((uint32_t)(v) << BP_FLEXIO_TIMCMPn_CMP), BP_FLEXIO_TIMCMPn_CMP, 16))
/*@}*/

/*******************************************************************************
 * hw_flexio_t - module struct
 ******************************************************************************/
/*!
 * @brief All FLEXIO module registers.
 */
#pragma pack(1)
typedef struct _hw_flexio
{
    __I hw_flexio_verid_t VERID;           /*!< [0x0] Version ID Register */
    __I hw_flexio_param_t PARAM;           /*!< [0x4] Parameter Register */
    __IO hw_flexio_ctrl_t CTRL;            /*!< [0x8] FlexIO Control Register */
    uint8_t _reserved0[4];
    __IO hw_flexio_shiftstat_t SHIFTSTAT;  /*!< [0x10] Shifter Status Register */
    __IO hw_flexio_shifterr_t SHIFTERR;    /*!< [0x14] Shifter Error Register */
    __IO hw_flexio_timstat_t TIMSTAT;      /*!< [0x18] Timer Status Register */
    uint8_t _reserved1[4];
    __IO hw_flexio_shiftsien_t SHIFTSIEN;  /*!< [0x20] Shifter Status Interrupt Enable */
    __IO hw_flexio_shifteien_t SHIFTEIEN;  /*!< [0x24] Shifter Error Interrupt Enable */
    __IO hw_flexio_timien_t TIMIEN;        /*!< [0x28] Timer Interrupt Enable Register */
    uint8_t _reserved2[4];
    __IO hw_flexio_shiftsden_t SHIFTSDEN;  /*!< [0x30] Shifter Status DMA Enable */
    uint8_t _reserved3[76];
    __IO hw_flexio_shiftctln_t SHIFTCTLn[4]; /*!< [0x80] Shifter Control N Register */
    uint8_t _reserved4[112];
    __IO hw_flexio_shiftcfgn_t SHIFTCFGn[4]; /*!< [0x100] Shifter Configuration N Register */
    uint8_t _reserved5[240];
    __IO hw_flexio_shiftbufn_t SHIFTBUFn[4]; /*!< [0x200] Shifter Buffer N Register */
    uint8_t _reserved6[112];
    __IO hw_flexio_shiftbufbbsn_t SHIFTBUFBBSn[4]; /*!< [0x280] Shifter Buffer N Bit Byte Swapped Register */
    uint8_t _reserved7[112];
    __IO hw_flexio_shiftbufbysn_t SHIFTBUFBYSn[4]; /*!< [0x300] Shifter Buffer N Byte Swapped Register */
    uint8_t _reserved8[112];
    __IO hw_flexio_shiftbufbisn_t SHIFTBUFBISn[4]; /*!< [0x380] Shifter Buffer N Bit Swapped Register */
    uint8_t _reserved9[112];
    __IO hw_flexio_timctln_t TIMCTLn[4];   /*!< [0x400] Timer Control N Register */
    uint8_t _reserved10[112];
    __IO hw_flexio_timcfgn_t TIMCFGn[4];   /*!< [0x480] Timer Configuration N Register */
    uint8_t _reserved11[112];
    __IO hw_flexio_timcmpn_t TIMCMPn[4];   /*!< [0x500] Timer Compare N Register */
} hw_flexio_t;
#pragma pack()

/*! @brief Macro to access all FLEXIO registers. */
/*! @param x FLEXIO module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_FLEXIO_REGS(FLEXIO_BASE)</code>. */
#define HW_FLEXIO_REGS(x) (*(hw_flexio_t *)(x))

/*
 * MKL43Z4 FTFA
 *
 * Flash Memory Interface
 *
 * Registers defined in this header file:
 * - HW_FTFA_FSTAT - Flash Status Register
 * - HW_FTFA_FCNFG - Flash Configuration Register
 * - HW_FTFA_FSEC - Flash Security Register
 * - HW_FTFA_FOPT - Flash Option Register
 * - HW_FTFA_FCCOB3 - Flash Common Command Object Registers
 * - HW_FTFA_FCCOB2 - Flash Common Command Object Registers
 * - HW_FTFA_FCCOB1 - Flash Common Command Object Registers
 * - HW_FTFA_FCCOB0 - Flash Common Command Object Registers
 * - HW_FTFA_FCCOB7 - Flash Common Command Object Registers
 * - HW_FTFA_FCCOB6 - Flash Common Command Object Registers
 * - HW_FTFA_FCCOB5 - Flash Common Command Object Registers
 * - HW_FTFA_FCCOB4 - Flash Common Command Object Registers
 * - HW_FTFA_FCCOBB - Flash Common Command Object Registers
 * - HW_FTFA_FCCOBA - Flash Common Command Object Registers
 * - HW_FTFA_FCCOB9 - Flash Common Command Object Registers
 * - HW_FTFA_FCCOB8 - Flash Common Command Object Registers
 * - HW_FTFA_FPROT3 - Program Flash Protection Registers
 * - HW_FTFA_FPROT2 - Program Flash Protection Registers
 * - HW_FTFA_FPROT1 - Program Flash Protection Registers
 * - HW_FTFA_FPROT0 - Program Flash Protection Registers
 *
 * - hw_ftfa_t - Struct containing all module registers.
 */

#define HW_FTFA_INSTANCE_COUNT (1U) /*!< Number of instances of the FTFA module. */
#define HW_FTFA (0U) /*!< Instance number for FTFA. */

/*******************************************************************************
 * HW_FTFA_FSTAT - Flash Status Register
 ******************************************************************************/

/*!
 * @brief HW_FTFA_FSTAT - Flash Status Register (RW)
 *
 * Reset value: 0x00U
 *
 * The FSTAT register reports the operational status of the flash memory module.
 * The CCIF, RDCOLERR, ACCERR, and FPVIOL bits are readable and writable. The
 * MGSTAT0 bit is read only. The unassigned bits read 0 and are not writable. When
 * set, the Access Error (ACCERR) and Flash Protection Violation (FPVIOL) bits in
 * this register prevent the launch of any more commands until the flag is
 * cleared (by writing a one to it).
 */
typedef union _hw_ftfa_fstat
{
    uint8_t U;
    struct _hw_ftfa_fstat_bitfields
    {
        uint8_t MGSTAT0 : 1;           /*!< [0] Memory Controller Command Completion
                                        * Status Flag */
        uint8_t RESERVED0 : 3;         /*!< [3:1]  */
        uint8_t FPVIOL : 1;            /*!< [4] Flash Protection Violation Flag */
        uint8_t ACCERR : 1;            /*!< [5] Flash Access Error Flag */
        uint8_t RDCOLERR : 1;          /*!< [6] Flash Read Collision Error Flag */
        uint8_t CCIF : 1;              /*!< [7] Command Complete Interrupt Flag */
    } B;
} hw_ftfa_fstat_t;

/*!
 * @name Constants and macros for entire FTFA_FSTAT register
 */
/*@{*/
#define HW_FTFA_FSTAT_ADDR(x)    ((uint32_t)(x) + 0x0U)

#define HW_FTFA_FSTAT(x)         (*(__IO hw_ftfa_fstat_t *) HW_FTFA_FSTAT_ADDR(x))
#define HW_FTFA_FSTAT_RD(x)      (HW_FTFA_FSTAT(x).U)
#define HW_FTFA_FSTAT_WR(x, v)   (HW_FTFA_FSTAT(x).U = (v))
#define HW_FTFA_FSTAT_SET(x, v)  (BME_OR8(HW_FTFA_FSTAT_ADDR(x), (uint8_t)(v)))
#define HW_FTFA_FSTAT_CLR(x, v)  (BME_AND8(HW_FTFA_FSTAT_ADDR(x), (uint8_t)(~(v))))
#define HW_FTFA_FSTAT_TOG(x, v)  (BME_XOR8(HW_FTFA_FSTAT_ADDR(x), (uint8_t)(v)))
/*@}*/

