flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
#define HW_LCD_PENL(x)           (*(__IO hw_lcd_penl_t *) HW_LCD_PENL_ADDR(x))
#define HW_LCD_PENL_RD(x)        (HW_LCD_PENL(x).U)
#define HW_LCD_PENL_WR(x, v)     (HW_LCD_PENL(x).U = (v))
#define HW_LCD_PENL_SET(x, v)    (BME_OR32(HW_LCD_PENL_ADDR(x), (uint32_t)(v)))
#define HW_LCD_PENL_CLR(x, v)    (BME_AND32(HW_LCD_PENL_ADDR(x), (uint32_t)(~(v))))
#define HW_LCD_PENL_TOG(x, v)    (BME_XOR32(HW_LCD_PENL_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_PENL bitfields
 */

/*!
 * @name Register LCD_PENL, field PEN[31:0] (RW)
 *
 * The PEN[63:0] bits enable the LCD_P[63:0] pins for LCD operation. PENL
 * contains PEN[31:0], and PENH contains PEN[63:32]. Each LCD_P[63:0] pin can be
 * configured as a back plane or a front plane based on the corresponding BPEN[ n ] bit
 * in the Back Plane Enable register (BPEN). If LCDEN = 0, these bits enable the
 * pin to drive a low output. Set PEN[63:0] bits before LCDEN is set. When
 * PAD_SAFE=1, these bits have no effect in any condition on the LCD_P[63:0] pins.
 *
 * Values:
 * - 0 - LCD operation disabled on LCD_Pn.
 * - 1 - LCD operation enabled on LCD_Pn.
 */
/*@{*/
#define BP_LCD_PENL_PEN      (0U)          /*!< Bit position for LCD_PENL_PEN. */
#define BM_LCD_PENL_PEN      (0xFFFFFFFFU) /*!< Bit mask for LCD_PENL_PEN. */
#define BS_LCD_PENL_PEN      (32U)         /*!< Bit field size in bits for LCD_PENL_PEN. */

/*! @brief Read current value of the LCD_PENL_PEN field. */
#define BR_LCD_PENL_PEN(x)   (HW_LCD_PENL(x).U)

/*! @brief Format value for bitfield LCD_PENL_PEN. */
#define BF_LCD_PENL_PEN(v)   ((uint32_t)((uint32_t)(v) << BP_LCD_PENL_PEN) & BM_LCD_PENL_PEN)

/*! @brief Set the PEN field to a new value. */
#define BW_LCD_PENL_PEN(x, v) (HW_LCD_PENL_WR(x, v))
/*@}*/
/*******************************************************************************
 * HW_LCD_PENH - LCD Pin Enable register
 ******************************************************************************/

/*!
 * @brief HW_LCD_PENH - LCD Pin Enable register (RW)
 *
 * Reset value: 0x00000000U
 *
 * When LCDEN = 1,and PAD_SAFE=0 each PEN bit enables the corresponding LCD pin
 * (LCD_Pn) for LCD waveform generation.When LCDEN=0, each PEN bit enabled to
 * corresponding LCD pin (LCD_Pn) to drive a low output. Initialize these registers
 * before enabling the LCD controller. The reset value of this register depends
 * on the reset type: POR - 0x0000_0000
 */
typedef union _hw_lcd_penh
{
    uint32_t U;
    struct _hw_lcd_penh_bitfields
    {
        uint32_t PEN : 32;             /*!< [31:0] LCD Pin Enable */
    } B;
} hw_lcd_penh_t;

/*!
 * @name Constants and macros for entire LCD_PENH register
 */
/*@{*/
#define HW_LCD_PENH_ADDR(x)      ((uint32_t)(x) + 0x14U)

#define HW_LCD_PENH(x)           (*(__IO hw_lcd_penh_t *) HW_LCD_PENH_ADDR(x))
#define HW_LCD_PENH_RD(x)        (HW_LCD_PENH(x).U)
#define HW_LCD_PENH_WR(x, v)     (HW_LCD_PENH(x).U = (v))
#define HW_LCD_PENH_SET(x, v)    (BME_OR32(HW_LCD_PENH_ADDR(x), (uint32_t)(v)))
#define HW_LCD_PENH_CLR(x, v)    (BME_AND32(HW_LCD_PENH_ADDR(x), (uint32_t)(~(v))))
#define HW_LCD_PENH_TOG(x, v)    (BME_XOR32(HW_LCD_PENH_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_PENH bitfields
 */

/*!
 * @name Register LCD_PENH, field PEN[31:0] (RW)
 *
 * The PEN[63:0] bits enable the LCD_P[63:0] pins for LCD operation. PENL
 * contains PEN[31:0], and PENH contains PEN[63:32]. Each LCD_P[63:0] pin can be
 * configured as a back plane or a front plane based on the corresponding BPEN[ n ] bit
 * in the Back Plane Enable register (BPEN). If LCDEN = 0, these bits enable the
 * pin to drive a low output. Set PEN[63:0] bits before LCDEN is set. When
 * PAD_SAFE=1, these bits have no effect in any condition on the LCD_P[63:0] pins.
 *
 * Values:
 * - 0 - LCD operation disabled on LCD_Pn.
 * - 1 - LCD operation enabled on LCD_Pn.
 */
/*@{*/
#define BP_LCD_PENH_PEN      (0U)          /*!< Bit position for LCD_PENH_PEN. */
#define BM_LCD_PENH_PEN      (0xFFFFFFFFU) /*!< Bit mask for LCD_PENH_PEN. */
#define BS_LCD_PENH_PEN      (32U)         /*!< Bit field size in bits for LCD_PENH_PEN. */

/*! @brief Read current value of the LCD_PENH_PEN field. */
#define BR_LCD_PENH_PEN(x)   (HW_LCD_PENH(x).U)

/*! @brief Format value for bitfield LCD_PENH_PEN. */
#define BF_LCD_PENH_PEN(v)   ((uint32_t)((uint32_t)(v) << BP_LCD_PENH_PEN) & BM_LCD_PENH_PEN)

/*! @brief Set the PEN field to a new value. */
#define BW_LCD_PENH_PEN(x, v) (HW_LCD_PENH_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_LCD_BPENL - LCD Back Plane Enable register
 ******************************************************************************/

/*!
 * @brief HW_LCD_BPENL - LCD Back Plane Enable register (RW)
 *
 * Reset value: 0x00000000U
 *
 * When PEN[n] = 1, the BPEN[63:0] bits configure the corresponding LCD pin to
 * operate as an LCD back plane or an LCD front plane. Most applications set a
 * maximum of eight of these bits. Initialize these registers before enabling the
 * LCD controller. The reset value of this register depends on the reset type: POR
 * - 0x0000_0000
 */
typedef union _hw_lcd_bpenl
{
    uint32_t U;
    struct _hw_lcd_bpenl_bitfields
    {
        uint32_t BPEN : 32;            /*!< [31:0] Back Plane Enable */
    } B;
} hw_lcd_bpenl_t;

/*!
 * @name Constants and macros for entire LCD_BPENL register
 */
/*@{*/
#define HW_LCD_BPENL_ADDR(x)     ((uint32_t)(x) + 0x18U)

#define HW_LCD_BPENL(x)          (*(__IO hw_lcd_bpenl_t *) HW_LCD_BPENL_ADDR(x))
#define HW_LCD_BPENL_RD(x)       (HW_LCD_BPENL(x).U)
#define HW_LCD_BPENL_WR(x, v)    (HW_LCD_BPENL(x).U = (v))
#define HW_LCD_BPENL_SET(x, v)   (BME_OR32(HW_LCD_BPENL_ADDR(x), (uint32_t)(v)))
#define HW_LCD_BPENL_CLR(x, v)   (BME_AND32(HW_LCD_BPENL_ADDR(x), (uint32_t)(~(v))))
#define HW_LCD_BPENL_TOG(x, v)   (BME_XOR32(HW_LCD_BPENL_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_BPENL bitfields
 */

/*!
 * @name Register LCD_BPENL, field BPEN[31:0] (RW)
 *
 * The BPEN[63:0] bits configure the LCD_P[63:0] pins to operate as an LCD back
 * plane or LCD front plane. BPENL contains BPEN[31:0], and BPENH contains
 * BPEN[63:32]. If LCDEN = 0, these bits have no effect on the state of the I/O pins.
 * It is recommended to set BPEN[63:0] bits before LCDEN is set.
 *
 * Values:
 * - 0 - Front plane operation enabled on LCD_Pn.
 * - 1 - Back plane operation enabled on LCD_Pn.
 */
/*@{*/
#define BP_LCD_BPENL_BPEN    (0U)          /*!< Bit position for LCD_BPENL_BPEN. */
#define BM_LCD_BPENL_BPEN    (0xFFFFFFFFU) /*!< Bit mask for LCD_BPENL_BPEN. */
#define BS_LCD_BPENL_BPEN    (32U)         /*!< Bit field size in bits for LCD_BPENL_BPEN. */

/*! @brief Read current value of the LCD_BPENL_BPEN field. */
#define BR_LCD_BPENL_BPEN(x) (HW_LCD_BPENL(x).U)

/*! @brief Format value for bitfield LCD_BPENL_BPEN. */
#define BF_LCD_BPENL_BPEN(v) ((uint32_t)((uint32_t)(v) << BP_LCD_BPENL_BPEN) & BM_LCD_BPENL_BPEN)

/*! @brief Set the BPEN field to a new value. */
#define BW_LCD_BPENL_BPEN(x, v) (HW_LCD_BPENL_WR(x, v))
/*@}*/
/*******************************************************************************
 * HW_LCD_BPENH - LCD Back Plane Enable register
 ******************************************************************************/

/*!
 * @brief HW_LCD_BPENH - LCD Back Plane Enable register (RW)
 *
 * Reset value: 0x00000000U
 *
 * When PEN[n] = 1, the BPEN[63:0] bits configure the corresponding LCD pin to
 * operate as an LCD back plane or an LCD front plane. Most applications set a
 * maximum of eight of these bits. Initialize these registers before enabling the
 * LCD controller. The reset value of this register depends on the reset type: POR
 * - 0x0000_0000
 */
typedef union _hw_lcd_bpenh
{
    uint32_t U;
    struct _hw_lcd_bpenh_bitfields
    {
        uint32_t BPEN : 32;            /*!< [31:0] Back Plane Enable */
    } B;
} hw_lcd_bpenh_t;

/*!
 * @name Constants and macros for entire LCD_BPENH register
 */
/*@{*/
#define HW_LCD_BPENH_ADDR(x)     ((uint32_t)(x) + 0x1CU)

#define HW_LCD_BPENH(x)          (*(__IO hw_lcd_bpenh_t *) HW_LCD_BPENH_ADDR(x))
#define HW_LCD_BPENH_RD(x)       (HW_LCD_BPENH(x).U)
#define HW_LCD_BPENH_WR(x, v)    (HW_LCD_BPENH(x).U = (v))
#define HW_LCD_BPENH_SET(x, v)   (BME_OR32(HW_LCD_BPENH_ADDR(x), (uint32_t)(v)))
#define HW_LCD_BPENH_CLR(x, v)   (BME_AND32(HW_LCD_BPENH_ADDR(x), (uint32_t)(~(v))))
#define HW_LCD_BPENH_TOG(x, v)   (BME_XOR32(HW_LCD_BPENH_ADDR(x), (uint32_t)(v)))
/*@}*/

