flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Set the WF18 field to a new value. */
#define BW_LCD_WF19TO16_WF18(x, v) (BME_BFI32(HW_LCD_WF19TO16_ADDR(x), ((uint32_t)(v) << BP_LCD_WF19TO16_WF18), BP_LCD_WF19TO16_WF18, 8))
/*@}*/

/*!
 * @name Register LCD_WF19TO16, field WF19[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P19 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF19TO16_WF19 (24U)         /*!< Bit position for LCD_WF19TO16_WF19. */
#define BM_LCD_WF19TO16_WF19 (0xFF000000U) /*!< Bit mask for LCD_WF19TO16_WF19. */
#define BS_LCD_WF19TO16_WF19 (8U)          /*!< Bit field size in bits for LCD_WF19TO16_WF19. */

/*! @brief Read current value of the LCD_WF19TO16_WF19 field. */
#define BR_LCD_WF19TO16_WF19(x) (BME_UBFX32(HW_LCD_WF19TO16_ADDR(x), BP_LCD_WF19TO16_WF19, BS_LCD_WF19TO16_WF19))

/*! @brief Format value for bitfield LCD_WF19TO16_WF19. */
#define BF_LCD_WF19TO16_WF19(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF19TO16_WF19) & BM_LCD_WF19TO16_WF19)

/*! @brief Set the WF19 field to a new value. */
#define BW_LCD_WF19TO16_WF19(x, v) (BME_BFI32(HW_LCD_WF19TO16_ADDR(x), ((uint32_t)(v) << BP_LCD_WF19TO16_WF19), BP_LCD_WF19TO16_WF19, 8))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF23TO20 - LCD Waveform register
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF23TO20 - LCD Waveform register (RW)
 *
 * Reset value: 0x00000000U
 *
 * See the LCD Waveform register (WFC3TO0) for register and field descriptions.
 * The reset value of this register depends on the reset type: POR - 0x0000_0000
 */
typedef union _hw_lcd_wf23to20
{
    uint32_t U;
    struct _hw_lcd_wf23to20_bitfields
    {
        uint32_t WF20 : 8;             /*!< [7:0]  */
        uint32_t WF21 : 8;             /*!< [15:8]  */
        uint32_t WF22 : 8;             /*!< [23:16]  */
        uint32_t WF23 : 8;             /*!< [31:24]  */
    } B;
} hw_lcd_wf23to20_t;

/*!
 * @name Constants and macros for entire LCD_WF23TO20 register
 */
/*@{*/
#define HW_LCD_WF23TO20_ADDR(x)  ((uint32_t)(x) + 0x34U)

#define HW_LCD_WF23TO20(x)       (*(__IO hw_lcd_wf23to20_t *) HW_LCD_WF23TO20_ADDR(x))
#define HW_LCD_WF23TO20_RD(x)    (HW_LCD_WF23TO20(x).U)
#define HW_LCD_WF23TO20_WR(x, v) (HW_LCD_WF23TO20(x).U = (v))
#define HW_LCD_WF23TO20_SET(x, v) (BME_OR32(HW_LCD_WF23TO20_ADDR(x), (uint32_t)(v)))
#define HW_LCD_WF23TO20_CLR(x, v) (BME_AND32(HW_LCD_WF23TO20_ADDR(x), (uint32_t)(~(v))))
#define HW_LCD_WF23TO20_TOG(x, v) (BME_XOR32(HW_LCD_WF23TO20_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF23TO20 bitfields
 */

/*!
 * @name Register LCD_WF23TO20, field WF20[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P20 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF23TO20_WF20 (0U)          /*!< Bit position for LCD_WF23TO20_WF20. */
#define BM_LCD_WF23TO20_WF20 (0x000000FFU) /*!< Bit mask for LCD_WF23TO20_WF20. */
#define BS_LCD_WF23TO20_WF20 (8U)          /*!< Bit field size in bits for LCD_WF23TO20_WF20. */

/*! @brief Read current value of the LCD_WF23TO20_WF20 field. */
#define BR_LCD_WF23TO20_WF20(x) (BME_UBFX32(HW_LCD_WF23TO20_ADDR(x), BP_LCD_WF23TO20_WF20, BS_LCD_WF23TO20_WF20))

/*! @brief Format value for bitfield LCD_WF23TO20_WF20. */
#define BF_LCD_WF23TO20_WF20(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF23TO20_WF20) & BM_LCD_WF23TO20_WF20)

/*! @brief Set the WF20 field to a new value. */
#define BW_LCD_WF23TO20_WF20(x, v) (BME_BFI32(HW_LCD_WF23TO20_ADDR(x), ((uint32_t)(v) << BP_LCD_WF23TO20_WF20), BP_LCD_WF23TO20_WF20, 8))
/*@}*/

/*!
 * @name Register LCD_WF23TO20, field WF21[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P21 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF23TO20_WF21 (8U)          /*!< Bit position for LCD_WF23TO20_WF21. */
#define BM_LCD_WF23TO20_WF21 (0x0000FF00U) /*!< Bit mask for LCD_WF23TO20_WF21. */
#define BS_LCD_WF23TO20_WF21 (8U)          /*!< Bit field size in bits for LCD_WF23TO20_WF21. */

/*! @brief Read current value of the LCD_WF23TO20_WF21 field. */
#define BR_LCD_WF23TO20_WF21(x) (BME_UBFX32(HW_LCD_WF23TO20_ADDR(x), BP_LCD_WF23TO20_WF21, BS_LCD_WF23TO20_WF21))

/*! @brief Format value for bitfield LCD_WF23TO20_WF21. */
#define BF_LCD_WF23TO20_WF21(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF23TO20_WF21) & BM_LCD_WF23TO20_WF21)

/*! @brief Set the WF21 field to a new value. */
#define BW_LCD_WF23TO20_WF21(x, v) (BME_BFI32(HW_LCD_WF23TO20_ADDR(x), ((uint32_t)(v) << BP_LCD_WF23TO20_WF21), BP_LCD_WF23TO20_WF21, 8))
/*@}*/

/*!
 * @name Register LCD_WF23TO20, field WF22[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P22 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF23TO20_WF22 (16U)         /*!< Bit position for LCD_WF23TO20_WF22. */
#define BM_LCD_WF23TO20_WF22 (0x00FF0000U) /*!< Bit mask for LCD_WF23TO20_WF22. */
#define BS_LCD_WF23TO20_WF22 (8U)          /*!< Bit field size in bits for LCD_WF23TO20_WF22. */

/*! @brief Read current value of the LCD_WF23TO20_WF22 field. */
#define BR_LCD_WF23TO20_WF22(x) (BME_UBFX32(HW_LCD_WF23TO20_ADDR(x), BP_LCD_WF23TO20_WF22, BS_LCD_WF23TO20_WF22))

/*! @brief Format value for bitfield LCD_WF23TO20_WF22. */
#define BF_LCD_WF23TO20_WF22(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF23TO20_WF22) & BM_LCD_WF23TO20_WF22)

/*! @brief Set the WF22 field to a new value. */
#define BW_LCD_WF23TO20_WF22(x, v) (BME_BFI32(HW_LCD_WF23TO20_ADDR(x), ((uint32_t)(v) << BP_LCD_WF23TO20_WF22), BP_LCD_WF23TO20_WF22, 8))
/*@}*/

/*!
 * @name Register LCD_WF23TO20, field WF23[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P23 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF23TO20_WF23 (24U)         /*!< Bit position for LCD_WF23TO20_WF23. */
#define BM_LCD_WF23TO20_WF23 (0xFF000000U) /*!< Bit mask for LCD_WF23TO20_WF23. */
#define BS_LCD_WF23TO20_WF23 (8U)          /*!< Bit field size in bits for LCD_WF23TO20_WF23. */

/*! @brief Read current value of the LCD_WF23TO20_WF23 field. */
#define BR_LCD_WF23TO20_WF23(x) (BME_UBFX32(HW_LCD_WF23TO20_ADDR(x), BP_LCD_WF23TO20_WF23, BS_LCD_WF23TO20_WF23))

/*! @brief Format value for bitfield LCD_WF23TO20_WF23. */
#define BF_LCD_WF23TO20_WF23(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF23TO20_WF23) & BM_LCD_WF23TO20_WF23)

/*! @brief Set the WF23 field to a new value. */
#define BW_LCD_WF23TO20_WF23(x, v) (BME_BFI32(HW_LCD_WF23TO20_ADDR(x), ((uint32_t)(v) << BP_LCD_WF23TO20_WF23), BP_LCD_WF23TO20_WF23, 8))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF27TO24 - LCD Waveform register
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF27TO24 - LCD Waveform register (RW)
 *
 * Reset value: 0x00000000U
 *
 * See the LCD Waveform register (WFC3TO0) for register and field descriptions.
 * The reset value of this register depends on the reset type: POR - 0x0000_0000
 */
typedef union _hw_lcd_wf27to24
{
    uint32_t U;
    struct _hw_lcd_wf27to24_bitfields
    {
        uint32_t WF24 : 8;             /*!< [7:0]  */
        uint32_t WF25 : 8;             /*!< [15:8]  */
        uint32_t WF26 : 8;             /*!< [23:16]  */
        uint32_t WF27 : 8;             /*!< [31:24]  */
    } B;
} hw_lcd_wf27to24_t;

/*!
 * @name Constants and macros for entire LCD_WF27TO24 register
 */
/*@{*/
#define HW_LCD_WF27TO24_ADDR(x)  ((uint32_t)(x) + 0x38U)

#define HW_LCD_WF27TO24(x)       (*(__IO hw_lcd_wf27to24_t *) HW_LCD_WF27TO24_ADDR(x))
#define HW_LCD_WF27TO24_RD(x)    (HW_LCD_WF27TO24(x).U)
#define HW_LCD_WF27TO24_WR(x, v) (HW_LCD_WF27TO24(x).U = (v))
#define HW_LCD_WF27TO24_SET(x, v) (BME_OR32(HW_LCD_WF27TO24_ADDR(x), (uint32_t)(v)))
#define HW_LCD_WF27TO24_CLR(x, v) (BME_AND32(HW_LCD_WF27TO24_ADDR(x), (uint32_t)(~(v))))
#define HW_LCD_WF27TO24_TOG(x, v) (BME_XOR32(HW_LCD_WF27TO24_ADDR(x), (uint32_t)(v)))
/*@}*/

