flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*
 * Constants & macros for individual LCD_WF27TO24 bitfields
 */

/*!
 * @name Register LCD_WF27TO24, field WF24[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P24 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF27TO24_WF24 (0U)          /*!< Bit position for LCD_WF27TO24_WF24. */
#define BM_LCD_WF27TO24_WF24 (0x000000FFU) /*!< Bit mask for LCD_WF27TO24_WF24. */
#define BS_LCD_WF27TO24_WF24 (8U)          /*!< Bit field size in bits for LCD_WF27TO24_WF24. */

/*! @brief Read current value of the LCD_WF27TO24_WF24 field. */
#define BR_LCD_WF27TO24_WF24(x) (BME_UBFX32(HW_LCD_WF27TO24_ADDR(x), BP_LCD_WF27TO24_WF24, BS_LCD_WF27TO24_WF24))

/*! @brief Format value for bitfield LCD_WF27TO24_WF24. */
#define BF_LCD_WF27TO24_WF24(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF27TO24_WF24) & BM_LCD_WF27TO24_WF24)

/*! @brief Set the WF24 field to a new value. */
#define BW_LCD_WF27TO24_WF24(x, v) (BME_BFI32(HW_LCD_WF27TO24_ADDR(x), ((uint32_t)(v) << BP_LCD_WF27TO24_WF24), BP_LCD_WF27TO24_WF24, 8))
/*@}*/

/*!
 * @name Register LCD_WF27TO24, field WF25[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P25 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF27TO24_WF25 (8U)          /*!< Bit position for LCD_WF27TO24_WF25. */
#define BM_LCD_WF27TO24_WF25 (0x0000FF00U) /*!< Bit mask for LCD_WF27TO24_WF25. */
#define BS_LCD_WF27TO24_WF25 (8U)          /*!< Bit field size in bits for LCD_WF27TO24_WF25. */

/*! @brief Read current value of the LCD_WF27TO24_WF25 field. */
#define BR_LCD_WF27TO24_WF25(x) (BME_UBFX32(HW_LCD_WF27TO24_ADDR(x), BP_LCD_WF27TO24_WF25, BS_LCD_WF27TO24_WF25))

/*! @brief Format value for bitfield LCD_WF27TO24_WF25. */
#define BF_LCD_WF27TO24_WF25(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF27TO24_WF25) & BM_LCD_WF27TO24_WF25)

/*! @brief Set the WF25 field to a new value. */
#define BW_LCD_WF27TO24_WF25(x, v) (BME_BFI32(HW_LCD_WF27TO24_ADDR(x), ((uint32_t)(v) << BP_LCD_WF27TO24_WF25), BP_LCD_WF27TO24_WF25, 8))
/*@}*/

/*!
 * @name Register LCD_WF27TO24, field WF26[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P26 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF27TO24_WF26 (16U)         /*!< Bit position for LCD_WF27TO24_WF26. */
#define BM_LCD_WF27TO24_WF26 (0x00FF0000U) /*!< Bit mask for LCD_WF27TO24_WF26. */
#define BS_LCD_WF27TO24_WF26 (8U)          /*!< Bit field size in bits for LCD_WF27TO24_WF26. */

/*! @brief Read current value of the LCD_WF27TO24_WF26 field. */
#define BR_LCD_WF27TO24_WF26(x) (BME_UBFX32(HW_LCD_WF27TO24_ADDR(x), BP_LCD_WF27TO24_WF26, BS_LCD_WF27TO24_WF26))

/*! @brief Format value for bitfield LCD_WF27TO24_WF26. */
#define BF_LCD_WF27TO24_WF26(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF27TO24_WF26) & BM_LCD_WF27TO24_WF26)

/*! @brief Set the WF26 field to a new value. */
#define BW_LCD_WF27TO24_WF26(x, v) (BME_BFI32(HW_LCD_WF27TO24_ADDR(x), ((uint32_t)(v) << BP_LCD_WF27TO24_WF26), BP_LCD_WF27TO24_WF26, 8))
/*@}*/

/*!
 * @name Register LCD_WF27TO24, field WF27[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P27 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF27TO24_WF27 (24U)         /*!< Bit position for LCD_WF27TO24_WF27. */
#define BM_LCD_WF27TO24_WF27 (0xFF000000U) /*!< Bit mask for LCD_WF27TO24_WF27. */
#define BS_LCD_WF27TO24_WF27 (8U)          /*!< Bit field size in bits for LCD_WF27TO24_WF27. */

/*! @brief Read current value of the LCD_WF27TO24_WF27 field. */
#define BR_LCD_WF27TO24_WF27(x) (BME_UBFX32(HW_LCD_WF27TO24_ADDR(x), BP_LCD_WF27TO24_WF27, BS_LCD_WF27TO24_WF27))

/*! @brief Format value for bitfield LCD_WF27TO24_WF27. */
#define BF_LCD_WF27TO24_WF27(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF27TO24_WF27) & BM_LCD_WF27TO24_WF27)

/*! @brief Set the WF27 field to a new value. */
#define BW_LCD_WF27TO24_WF27(x, v) (BME_BFI32(HW_LCD_WF27TO24_ADDR(x), ((uint32_t)(v) << BP_LCD_WF27TO24_WF27), BP_LCD_WF27TO24_WF27, 8))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF31TO28 - LCD Waveform register
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF31TO28 - LCD Waveform register (RW)
 *
 * Reset value: 0x00000000U
 *
 * See the LCD Waveform register (WFC3TO0) for register and field descriptions.
 * The reset value of this register depends on the reset type: POR - 0x0000_0000
 */
typedef union _hw_lcd_wf31to28
{
    uint32_t U;
    struct _hw_lcd_wf31to28_bitfields
    {
        uint32_t WF28 : 8;             /*!< [7:0]  */
        uint32_t WF29 : 8;             /*!< [15:8]  */
        uint32_t WF30 : 8;             /*!< [23:16]  */
        uint32_t WF31 : 8;             /*!< [31:24]  */
    } B;
} hw_lcd_wf31to28_t;

/*!
 * @name Constants and macros for entire LCD_WF31TO28 register
 */
/*@{*/
#define HW_LCD_WF31TO28_ADDR(x)  ((uint32_t)(x) + 0x3CU)

#define HW_LCD_WF31TO28(x)       (*(__IO hw_lcd_wf31to28_t *) HW_LCD_WF31TO28_ADDR(x))
#define HW_LCD_WF31TO28_RD(x)    (HW_LCD_WF31TO28(x).U)
#define HW_LCD_WF31TO28_WR(x, v) (HW_LCD_WF31TO28(x).U = (v))
#define HW_LCD_WF31TO28_SET(x, v) (BME_OR32(HW_LCD_WF31TO28_ADDR(x), (uint32_t)(v)))
#define HW_LCD_WF31TO28_CLR(x, v) (BME_AND32(HW_LCD_WF31TO28_ADDR(x), (uint32_t)(~(v))))
#define HW_LCD_WF31TO28_TOG(x, v) (BME_XOR32(HW_LCD_WF31TO28_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF31TO28 bitfields
 */

/*!
 * @name Register LCD_WF31TO28, field WF28[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P28 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF31TO28_WF28 (0U)          /*!< Bit position for LCD_WF31TO28_WF28. */
#define BM_LCD_WF31TO28_WF28 (0x000000FFU) /*!< Bit mask for LCD_WF31TO28_WF28. */
#define BS_LCD_WF31TO28_WF28 (8U)          /*!< Bit field size in bits for LCD_WF31TO28_WF28. */

/*! @brief Read current value of the LCD_WF31TO28_WF28 field. */
#define BR_LCD_WF31TO28_WF28(x) (BME_UBFX32(HW_LCD_WF31TO28_ADDR(x), BP_LCD_WF31TO28_WF28, BS_LCD_WF31TO28_WF28))

/*! @brief Format value for bitfield LCD_WF31TO28_WF28. */
#define BF_LCD_WF31TO28_WF28(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF31TO28_WF28) & BM_LCD_WF31TO28_WF28)

/*! @brief Set the WF28 field to a new value. */
#define BW_LCD_WF31TO28_WF28(x, v) (BME_BFI32(HW_LCD_WF31TO28_ADDR(x), ((uint32_t)(v) << BP_LCD_WF31TO28_WF28), BP_LCD_WF31TO28_WF28, 8))
/*@}*/

/*!
 * @name Register LCD_WF31TO28, field WF29[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P29 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF31TO28_WF29 (8U)          /*!< Bit position for LCD_WF31TO28_WF29. */
#define BM_LCD_WF31TO28_WF29 (0x0000FF00U) /*!< Bit mask for LCD_WF31TO28_WF29. */
#define BS_LCD_WF31TO28_WF29 (8U)          /*!< Bit field size in bits for LCD_WF31TO28_WF29. */

/*! @brief Read current value of the LCD_WF31TO28_WF29 field. */
#define BR_LCD_WF31TO28_WF29(x) (BME_UBFX32(HW_LCD_WF31TO28_ADDR(x), BP_LCD_WF31TO28_WF29, BS_LCD_WF31TO28_WF29))

/*! @brief Format value for bitfield LCD_WF31TO28_WF29. */
#define BF_LCD_WF31TO28_WF29(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF31TO28_WF29) & BM_LCD_WF31TO28_WF29)

