flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Read current value of the LCD_WF63TO60_WF62 field. */
#define BR_LCD_WF63TO60_WF62(x) (BME_UBFX32(HW_LCD_WF63TO60_ADDR(x), BP_LCD_WF63TO60_WF62, BS_LCD_WF63TO60_WF62))

/*! @brief Format value for bitfield LCD_WF63TO60_WF62. */
#define BF_LCD_WF63TO60_WF62(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF63TO60_WF62) & BM_LCD_WF63TO60_WF62)

/*! @brief Set the WF62 field to a new value. */
#define BW_LCD_WF63TO60_WF62(x, v) (BME_BFI32(HW_LCD_WF63TO60_ADDR(x), ((uint32_t)(v) << BP_LCD_WF63TO60_WF62), BP_LCD_WF63TO60_WF62, 8))
/*@}*/

/*!
 * @name Register LCD_WF63TO60, field WF63[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P63 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF63TO60_WF63 (24U)         /*!< Bit position for LCD_WF63TO60_WF63. */
#define BM_LCD_WF63TO60_WF63 (0xFF000000U) /*!< Bit mask for LCD_WF63TO60_WF63. */
#define BS_LCD_WF63TO60_WF63 (8U)          /*!< Bit field size in bits for LCD_WF63TO60_WF63. */

/*! @brief Read current value of the LCD_WF63TO60_WF63 field. */
#define BR_LCD_WF63TO60_WF63(x) (BME_UBFX32(HW_LCD_WF63TO60_ADDR(x), BP_LCD_WF63TO60_WF63, BS_LCD_WF63TO60_WF63))

/*! @brief Format value for bitfield LCD_WF63TO60_WF63. */
#define BF_LCD_WF63TO60_WF63(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF63TO60_WF63) & BM_LCD_WF63TO60_WF63)

/*! @brief Set the WF63 field to a new value. */
#define BW_LCD_WF63TO60_WF63(x, v) (BME_BFI32(HW_LCD_WF63TO60_ADDR(x), ((uint32_t)(v) << BP_LCD_WF63TO60_WF63), BP_LCD_WF63TO60_WF63, 8))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF0 - LCD Waveform Register 0.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF0 - LCD Waveform Register 0. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf0
{
    uint8_t U;
    struct _hw_lcd_wf0_bitfields
    {
        uint8_t BPALCD0 : 1;           /*!< [0]  */
        uint8_t BPBLCD0 : 1;           /*!< [1]  */
        uint8_t BPCLCD0 : 1;           /*!< [2]  */
        uint8_t BPDLCD0 : 1;           /*!< [3]  */
        uint8_t BPELCD0 : 1;           /*!< [4]  */
        uint8_t BPFLCD0 : 1;           /*!< [5]  */
        uint8_t BPGLCD0 : 1;           /*!< [6]  */
        uint8_t BPHLCD0 : 1;           /*!< [7]  */
    } B;
} hw_lcd_wf0_t;

/*!
 * @name Constants and macros for entire LCD_WF0 register
 */
/*@{*/
#define HW_LCD_WF0_ADDR(x)       ((uint32_t)(x) + 0x20U)

#define HW_LCD_WF0(x)            (*(__IO hw_lcd_wf0_t *) HW_LCD_WF0_ADDR(x))
#define HW_LCD_WF0_RD(x)         (HW_LCD_WF0(x).U)
#define HW_LCD_WF0_WR(x, v)      (HW_LCD_WF0(x).U = (v))
#define HW_LCD_WF0_SET(x, v)     (BME_OR8(HW_LCD_WF0_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF0_CLR(x, v)     (BME_AND8(HW_LCD_WF0_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF0_TOG(x, v)     (BME_XOR8(HW_LCD_WF0_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF0 bitfields
 */

/*!
 * @name Register LCD_WF0, field BPALCD0[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF0_BPALCD0   (0U)          /*!< Bit position for LCD_WF0_BPALCD0. */
#define BM_LCD_WF0_BPALCD0   (0x01U)       /*!< Bit mask for LCD_WF0_BPALCD0. */
#define BS_LCD_WF0_BPALCD0   (1U)          /*!< Bit field size in bits for LCD_WF0_BPALCD0. */

/*! @brief Read current value of the LCD_WF0_BPALCD0 field. */
#define BR_LCD_WF0_BPALCD0(x) (BME_UBFX8(HW_LCD_WF0_ADDR(x), BP_LCD_WF0_BPALCD0, BS_LCD_WF0_BPALCD0))

/*! @brief Format value for bitfield LCD_WF0_BPALCD0. */
#define BF_LCD_WF0_BPALCD0(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF0_BPALCD0) & BM_LCD_WF0_BPALCD0)

/*! @brief Set the BPALCD0 field to a new value. */
#define BW_LCD_WF0_BPALCD0(x, v) (BME_BFI8(HW_LCD_WF0_ADDR(x), ((uint8_t)(v) << BP_LCD_WF0_BPALCD0), BP_LCD_WF0_BPALCD0, 1))
/*@}*/

/*!
 * @name Register LCD_WF0, field BPBLCD0[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF0_BPBLCD0   (1U)          /*!< Bit position for LCD_WF0_BPBLCD0. */
#define BM_LCD_WF0_BPBLCD0   (0x02U)       /*!< Bit mask for LCD_WF0_BPBLCD0. */
#define BS_LCD_WF0_BPBLCD0   (1U)          /*!< Bit field size in bits for LCD_WF0_BPBLCD0. */

/*! @brief Read current value of the LCD_WF0_BPBLCD0 field. */
#define BR_LCD_WF0_BPBLCD0(x) (BME_UBFX8(HW_LCD_WF0_ADDR(x), BP_LCD_WF0_BPBLCD0, BS_LCD_WF0_BPBLCD0))

/*! @brief Format value for bitfield LCD_WF0_BPBLCD0. */
#define BF_LCD_WF0_BPBLCD0(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF0_BPBLCD0) & BM_LCD_WF0_BPBLCD0)

/*! @brief Set the BPBLCD0 field to a new value. */
#define BW_LCD_WF0_BPBLCD0(x, v) (BME_BFI8(HW_LCD_WF0_ADDR(x), ((uint8_t)(v) << BP_LCD_WF0_BPBLCD0), BP_LCD_WF0_BPBLCD0, 1))
/*@}*/

/*!
 * @name Register LCD_WF0, field BPCLCD0[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF0_BPCLCD0   (2U)          /*!< Bit position for LCD_WF0_BPCLCD0. */
#define BM_LCD_WF0_BPCLCD0   (0x04U)       /*!< Bit mask for LCD_WF0_BPCLCD0. */
#define BS_LCD_WF0_BPCLCD0   (1U)          /*!< Bit field size in bits for LCD_WF0_BPCLCD0. */

/*! @brief Read current value of the LCD_WF0_BPCLCD0 field. */
#define BR_LCD_WF0_BPCLCD0(x) (BME_UBFX8(HW_LCD_WF0_ADDR(x), BP_LCD_WF0_BPCLCD0, BS_LCD_WF0_BPCLCD0))

/*! @brief Format value for bitfield LCD_WF0_BPCLCD0. */
#define BF_LCD_WF0_BPCLCD0(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF0_BPCLCD0) & BM_LCD_WF0_BPCLCD0)

/*! @brief Set the BPCLCD0 field to a new value. */
#define BW_LCD_WF0_BPCLCD0(x, v) (BME_BFI8(HW_LCD_WF0_ADDR(x), ((uint8_t)(v) << BP_LCD_WF0_BPCLCD0), BP_LCD_WF0_BPCLCD0, 1))
/*@}*/

/*!
 * @name Register LCD_WF0, field BPDLCD0[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF0_BPDLCD0   (3U)          /*!< Bit position for LCD_WF0_BPDLCD0. */
#define BM_LCD_WF0_BPDLCD0   (0x08U)       /*!< Bit mask for LCD_WF0_BPDLCD0. */
#define BS_LCD_WF0_BPDLCD0   (1U)          /*!< Bit field size in bits for LCD_WF0_BPDLCD0. */

