flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Read current value of the LCD_WF0_BPDLCD0 field. */
#define BR_LCD_WF0_BPDLCD0(x) (BME_UBFX8(HW_LCD_WF0_ADDR(x), BP_LCD_WF0_BPDLCD0, BS_LCD_WF0_BPDLCD0))

/*! @brief Format value for bitfield LCD_WF0_BPDLCD0. */
#define BF_LCD_WF0_BPDLCD0(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF0_BPDLCD0) & BM_LCD_WF0_BPDLCD0)

/*! @brief Set the BPDLCD0 field to a new value. */
#define BW_LCD_WF0_BPDLCD0(x, v) (BME_BFI8(HW_LCD_WF0_ADDR(x), ((uint8_t)(v) << BP_LCD_WF0_BPDLCD0), BP_LCD_WF0_BPDLCD0, 1))
/*@}*/

/*!
 * @name Register LCD_WF0, field BPELCD0[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF0_BPELCD0   (4U)          /*!< Bit position for LCD_WF0_BPELCD0. */
#define BM_LCD_WF0_BPELCD0   (0x10U)       /*!< Bit mask for LCD_WF0_BPELCD0. */
#define BS_LCD_WF0_BPELCD0   (1U)          /*!< Bit field size in bits for LCD_WF0_BPELCD0. */

/*! @brief Read current value of the LCD_WF0_BPELCD0 field. */
#define BR_LCD_WF0_BPELCD0(x) (BME_UBFX8(HW_LCD_WF0_ADDR(x), BP_LCD_WF0_BPELCD0, BS_LCD_WF0_BPELCD0))

/*! @brief Format value for bitfield LCD_WF0_BPELCD0. */
#define BF_LCD_WF0_BPELCD0(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF0_BPELCD0) & BM_LCD_WF0_BPELCD0)

/*! @brief Set the BPELCD0 field to a new value. */
#define BW_LCD_WF0_BPELCD0(x, v) (BME_BFI8(HW_LCD_WF0_ADDR(x), ((uint8_t)(v) << BP_LCD_WF0_BPELCD0), BP_LCD_WF0_BPELCD0, 1))
/*@}*/

/*!
 * @name Register LCD_WF0, field BPFLCD0[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF0_BPFLCD0   (5U)          /*!< Bit position for LCD_WF0_BPFLCD0. */
#define BM_LCD_WF0_BPFLCD0   (0x20U)       /*!< Bit mask for LCD_WF0_BPFLCD0. */
#define BS_LCD_WF0_BPFLCD0   (1U)          /*!< Bit field size in bits for LCD_WF0_BPFLCD0. */

/*! @brief Read current value of the LCD_WF0_BPFLCD0 field. */
#define BR_LCD_WF0_BPFLCD0(x) (BME_UBFX8(HW_LCD_WF0_ADDR(x), BP_LCD_WF0_BPFLCD0, BS_LCD_WF0_BPFLCD0))

/*! @brief Format value for bitfield LCD_WF0_BPFLCD0. */
#define BF_LCD_WF0_BPFLCD0(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF0_BPFLCD0) & BM_LCD_WF0_BPFLCD0)

/*! @brief Set the BPFLCD0 field to a new value. */
#define BW_LCD_WF0_BPFLCD0(x, v) (BME_BFI8(HW_LCD_WF0_ADDR(x), ((uint8_t)(v) << BP_LCD_WF0_BPFLCD0), BP_LCD_WF0_BPFLCD0, 1))
/*@}*/

/*!
 * @name Register LCD_WF0, field BPGLCD0[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF0_BPGLCD0   (6U)          /*!< Bit position for LCD_WF0_BPGLCD0. */
#define BM_LCD_WF0_BPGLCD0   (0x40U)       /*!< Bit mask for LCD_WF0_BPGLCD0. */
#define BS_LCD_WF0_BPGLCD0   (1U)          /*!< Bit field size in bits for LCD_WF0_BPGLCD0. */

/*! @brief Read current value of the LCD_WF0_BPGLCD0 field. */
#define BR_LCD_WF0_BPGLCD0(x) (BME_UBFX8(HW_LCD_WF0_ADDR(x), BP_LCD_WF0_BPGLCD0, BS_LCD_WF0_BPGLCD0))

/*! @brief Format value for bitfield LCD_WF0_BPGLCD0. */
#define BF_LCD_WF0_BPGLCD0(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF0_BPGLCD0) & BM_LCD_WF0_BPGLCD0)

/*! @brief Set the BPGLCD0 field to a new value. */
#define BW_LCD_WF0_BPGLCD0(x, v) (BME_BFI8(HW_LCD_WF0_ADDR(x), ((uint8_t)(v) << BP_LCD_WF0_BPGLCD0), BP_LCD_WF0_BPGLCD0, 1))
/*@}*/

/*!
 * @name Register LCD_WF0, field BPHLCD0[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF0_BPHLCD0   (7U)          /*!< Bit position for LCD_WF0_BPHLCD0. */
#define BM_LCD_WF0_BPHLCD0   (0x80U)       /*!< Bit mask for LCD_WF0_BPHLCD0. */
#define BS_LCD_WF0_BPHLCD0   (1U)          /*!< Bit field size in bits for LCD_WF0_BPHLCD0. */

/*! @brief Read current value of the LCD_WF0_BPHLCD0 field. */
#define BR_LCD_WF0_BPHLCD0(x) (BME_UBFX8(HW_LCD_WF0_ADDR(x), BP_LCD_WF0_BPHLCD0, BS_LCD_WF0_BPHLCD0))

/*! @brief Format value for bitfield LCD_WF0_BPHLCD0. */
#define BF_LCD_WF0_BPHLCD0(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF0_BPHLCD0) & BM_LCD_WF0_BPHLCD0)

/*! @brief Set the BPHLCD0 field to a new value. */
#define BW_LCD_WF0_BPHLCD0(x, v) (BME_BFI8(HW_LCD_WF0_ADDR(x), ((uint8_t)(v) << BP_LCD_WF0_BPHLCD0), BP_LCD_WF0_BPHLCD0, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF1 - LCD Waveform Register 1.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF1 - LCD Waveform Register 1. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf1
{
    uint8_t U;
    struct _hw_lcd_wf1_bitfields
    {
        uint8_t BPALCD1 : 1;           /*!< [0]  */
        uint8_t BPBLCD1 : 1;           /*!< [1]  */
        uint8_t BPCLCD1 : 1;           /*!< [2]  */
        uint8_t BPDLCD1 : 1;           /*!< [3]  */
        uint8_t BPELCD1 : 1;           /*!< [4]  */
        uint8_t BPFLCD1 : 1;           /*!< [5]  */
        uint8_t BPGLCD1 : 1;           /*!< [6]  */
        uint8_t BPHLCD1 : 1;           /*!< [7]  */
    } B;
} hw_lcd_wf1_t;

/*!
 * @name Constants and macros for entire LCD_WF1 register
 */
/*@{*/
#define HW_LCD_WF1_ADDR(x)       ((uint32_t)(x) + 0x21U)

#define HW_LCD_WF1(x)            (*(__IO hw_lcd_wf1_t *) HW_LCD_WF1_ADDR(x))
#define HW_LCD_WF1_RD(x)         (HW_LCD_WF1(x).U)
#define HW_LCD_WF1_WR(x, v)      (HW_LCD_WF1(x).U = (v))
#define HW_LCD_WF1_SET(x, v)     (BME_OR8(HW_LCD_WF1_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF1_CLR(x, v)     (BME_AND8(HW_LCD_WF1_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF1_TOG(x, v)     (BME_XOR8(HW_LCD_WF1_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF1 bitfields
 */

/*!
 * @name Register LCD_WF1, field BPALCD1[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF1_BPALCD1   (0U)          /*!< Bit position for LCD_WF1_BPALCD1. */
#define BM_LCD_WF1_BPALCD1   (0x01U)       /*!< Bit mask for LCD_WF1_BPALCD1. */
#define BS_LCD_WF1_BPALCD1   (1U)          /*!< Bit field size in bits for LCD_WF1_BPALCD1. */

/*! @brief Read current value of the LCD_WF1_BPALCD1 field. */
#define BR_LCD_WF1_BPALCD1(x) (BME_UBFX8(HW_LCD_WF1_ADDR(x), BP_LCD_WF1_BPALCD1, BS_LCD_WF1_BPALCD1))

/*! @brief Format value for bitfield LCD_WF1_BPALCD1. */
#define BF_LCD_WF1_BPALCD1(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF1_BPALCD1) & BM_LCD_WF1_BPALCD1)

/*! @brief Set the BPALCD1 field to a new value. */
#define BW_LCD_WF1_BPALCD1(x, v) (BME_BFI8(HW_LCD_WF1_ADDR(x), ((uint8_t)(v) << BP_LCD_WF1_BPALCD1), BP_LCD_WF1_BPALCD1, 1))
/*@}*/

/*!
 * @name Register LCD_WF1, field BPBLCD1[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF1_BPBLCD1   (1U)          /*!< Bit position for LCD_WF1_BPBLCD1. */
#define BM_LCD_WF1_BPBLCD1   (0x02U)       /*!< Bit mask for LCD_WF1_BPBLCD1. */
#define BS_LCD_WF1_BPBLCD1   (1U)          /*!< Bit field size in bits for LCD_WF1_BPBLCD1. */

/*! @brief Read current value of the LCD_WF1_BPBLCD1 field. */
#define BR_LCD_WF1_BPBLCD1(x) (BME_UBFX8(HW_LCD_WF1_ADDR(x), BP_LCD_WF1_BPBLCD1, BS_LCD_WF1_BPBLCD1))

/*! @brief Format value for bitfield LCD_WF1_BPBLCD1. */
#define BF_LCD_WF1_BPBLCD1(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF1_BPBLCD1) & BM_LCD_WF1_BPBLCD1)

/*! @brief Set the BPBLCD1 field to a new value. */
#define BW_LCD_WF1_BPBLCD1(x, v) (BME_BFI8(HW_LCD_WF1_ADDR(x), ((uint8_t)(v) << BP_LCD_WF1_BPBLCD1), BP_LCD_WF1_BPBLCD1, 1))
/*@}*/

/*!
 * @name Register LCD_WF1, field BPCLCD1[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF1_BPCLCD1   (2U)          /*!< Bit position for LCD_WF1_BPCLCD1. */
#define BM_LCD_WF1_BPCLCD1   (0x04U)       /*!< Bit mask for LCD_WF1_BPCLCD1. */
#define BS_LCD_WF1_BPCLCD1   (1U)          /*!< Bit field size in bits for LCD_WF1_BPCLCD1. */

/*! @brief Read current value of the LCD_WF1_BPCLCD1 field. */
#define BR_LCD_WF1_BPCLCD1(x) (BME_UBFX8(HW_LCD_WF1_ADDR(x), BP_LCD_WF1_BPCLCD1, BS_LCD_WF1_BPCLCD1))

/*! @brief Format value for bitfield LCD_WF1_BPCLCD1. */
#define BF_LCD_WF1_BPCLCD1(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF1_BPCLCD1) & BM_LCD_WF1_BPCLCD1)

/*! @brief Set the BPCLCD1 field to a new value. */
#define BW_LCD_WF1_BPCLCD1(x, v) (BME_BFI8(HW_LCD_WF1_ADDR(x), ((uint8_t)(v) << BP_LCD_WF1_BPCLCD1), BP_LCD_WF1_BPCLCD1, 1))
/*@}*/

/*!
 * @name Register LCD_WF1, field BPDLCD1[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF1_BPDLCD1   (3U)          /*!< Bit position for LCD_WF1_BPDLCD1. */
#define BM_LCD_WF1_BPDLCD1   (0x08U)       /*!< Bit mask for LCD_WF1_BPDLCD1. */
#define BS_LCD_WF1_BPDLCD1   (1U)          /*!< Bit field size in bits for LCD_WF1_BPDLCD1. */

