flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Read current value of the LCD_WF1_BPDLCD1 field. */
#define BR_LCD_WF1_BPDLCD1(x) (BME_UBFX8(HW_LCD_WF1_ADDR(x), BP_LCD_WF1_BPDLCD1, BS_LCD_WF1_BPDLCD1))

/*! @brief Format value for bitfield LCD_WF1_BPDLCD1. */
#define BF_LCD_WF1_BPDLCD1(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF1_BPDLCD1) & BM_LCD_WF1_BPDLCD1)

/*! @brief Set the BPDLCD1 field to a new value. */
#define BW_LCD_WF1_BPDLCD1(x, v) (BME_BFI8(HW_LCD_WF1_ADDR(x), ((uint8_t)(v) << BP_LCD_WF1_BPDLCD1), BP_LCD_WF1_BPDLCD1, 1))
/*@}*/

/*!
 * @name Register LCD_WF1, field BPELCD1[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF1_BPELCD1   (4U)          /*!< Bit position for LCD_WF1_BPELCD1. */
#define BM_LCD_WF1_BPELCD1   (0x10U)       /*!< Bit mask for LCD_WF1_BPELCD1. */
#define BS_LCD_WF1_BPELCD1   (1U)          /*!< Bit field size in bits for LCD_WF1_BPELCD1. */

/*! @brief Read current value of the LCD_WF1_BPELCD1 field. */
#define BR_LCD_WF1_BPELCD1(x) (BME_UBFX8(HW_LCD_WF1_ADDR(x), BP_LCD_WF1_BPELCD1, BS_LCD_WF1_BPELCD1))

/*! @brief Format value for bitfield LCD_WF1_BPELCD1. */
#define BF_LCD_WF1_BPELCD1(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF1_BPELCD1) & BM_LCD_WF1_BPELCD1)

/*! @brief Set the BPELCD1 field to a new value. */
#define BW_LCD_WF1_BPELCD1(x, v) (BME_BFI8(HW_LCD_WF1_ADDR(x), ((uint8_t)(v) << BP_LCD_WF1_BPELCD1), BP_LCD_WF1_BPELCD1, 1))
/*@}*/

/*!
 * @name Register LCD_WF1, field BPFLCD1[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF1_BPFLCD1   (5U)          /*!< Bit position for LCD_WF1_BPFLCD1. */
#define BM_LCD_WF1_BPFLCD1   (0x20U)       /*!< Bit mask for LCD_WF1_BPFLCD1. */
#define BS_LCD_WF1_BPFLCD1   (1U)          /*!< Bit field size in bits for LCD_WF1_BPFLCD1. */

/*! @brief Read current value of the LCD_WF1_BPFLCD1 field. */
#define BR_LCD_WF1_BPFLCD1(x) (BME_UBFX8(HW_LCD_WF1_ADDR(x), BP_LCD_WF1_BPFLCD1, BS_LCD_WF1_BPFLCD1))

/*! @brief Format value for bitfield LCD_WF1_BPFLCD1. */
#define BF_LCD_WF1_BPFLCD1(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF1_BPFLCD1) & BM_LCD_WF1_BPFLCD1)

/*! @brief Set the BPFLCD1 field to a new value. */
#define BW_LCD_WF1_BPFLCD1(x, v) (BME_BFI8(HW_LCD_WF1_ADDR(x), ((uint8_t)(v) << BP_LCD_WF1_BPFLCD1), BP_LCD_WF1_BPFLCD1, 1))
/*@}*/

/*!
 * @name Register LCD_WF1, field BPGLCD1[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF1_BPGLCD1   (6U)          /*!< Bit position for LCD_WF1_BPGLCD1. */
#define BM_LCD_WF1_BPGLCD1   (0x40U)       /*!< Bit mask for LCD_WF1_BPGLCD1. */
#define BS_LCD_WF1_BPGLCD1   (1U)          /*!< Bit field size in bits for LCD_WF1_BPGLCD1. */

/*! @brief Read current value of the LCD_WF1_BPGLCD1 field. */
#define BR_LCD_WF1_BPGLCD1(x) (BME_UBFX8(HW_LCD_WF1_ADDR(x), BP_LCD_WF1_BPGLCD1, BS_LCD_WF1_BPGLCD1))

/*! @brief Format value for bitfield LCD_WF1_BPGLCD1. */
#define BF_LCD_WF1_BPGLCD1(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF1_BPGLCD1) & BM_LCD_WF1_BPGLCD1)

/*! @brief Set the BPGLCD1 field to a new value. */
#define BW_LCD_WF1_BPGLCD1(x, v) (BME_BFI8(HW_LCD_WF1_ADDR(x), ((uint8_t)(v) << BP_LCD_WF1_BPGLCD1), BP_LCD_WF1_BPGLCD1, 1))
/*@}*/

/*!
 * @name Register LCD_WF1, field BPHLCD1[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF1_BPHLCD1   (7U)          /*!< Bit position for LCD_WF1_BPHLCD1. */
#define BM_LCD_WF1_BPHLCD1   (0x80U)       /*!< Bit mask for LCD_WF1_BPHLCD1. */
#define BS_LCD_WF1_BPHLCD1   (1U)          /*!< Bit field size in bits for LCD_WF1_BPHLCD1. */

/*! @brief Read current value of the LCD_WF1_BPHLCD1 field. */
#define BR_LCD_WF1_BPHLCD1(x) (BME_UBFX8(HW_LCD_WF1_ADDR(x), BP_LCD_WF1_BPHLCD1, BS_LCD_WF1_BPHLCD1))

/*! @brief Format value for bitfield LCD_WF1_BPHLCD1. */
#define BF_LCD_WF1_BPHLCD1(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF1_BPHLCD1) & BM_LCD_WF1_BPHLCD1)

/*! @brief Set the BPHLCD1 field to a new value. */
#define BW_LCD_WF1_BPHLCD1(x, v) (BME_BFI8(HW_LCD_WF1_ADDR(x), ((uint8_t)(v) << BP_LCD_WF1_BPHLCD1), BP_LCD_WF1_BPHLCD1, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF2 - LCD Waveform Register 2.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF2 - LCD Waveform Register 2. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf2
{
    uint8_t U;
    struct _hw_lcd_wf2_bitfields
    {
        uint8_t BPALCD2 : 1;           /*!< [0]  */
        uint8_t BPBLCD2 : 1;           /*!< [1]  */
        uint8_t BPCLCD2 : 1;           /*!< [2]  */
        uint8_t BPDLCD2 : 1;           /*!< [3]  */
        uint8_t BPELCD2 : 1;           /*!< [4]  */
        uint8_t BPFLCD2 : 1;           /*!< [5]  */
        uint8_t BPGLCD2 : 1;           /*!< [6]  */
        uint8_t BPHLCD2 : 1;           /*!< [7]  */
    } B;
} hw_lcd_wf2_t;

/*!
 * @name Constants and macros for entire LCD_WF2 register
 */
/*@{*/
#define HW_LCD_WF2_ADDR(x)       ((uint32_t)(x) + 0x22U)

#define HW_LCD_WF2(x)            (*(__IO hw_lcd_wf2_t *) HW_LCD_WF2_ADDR(x))
#define HW_LCD_WF2_RD(x)         (HW_LCD_WF2(x).U)
#define HW_LCD_WF2_WR(x, v)      (HW_LCD_WF2(x).U = (v))
#define HW_LCD_WF2_SET(x, v)     (BME_OR8(HW_LCD_WF2_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF2_CLR(x, v)     (BME_AND8(HW_LCD_WF2_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF2_TOG(x, v)     (BME_XOR8(HW_LCD_WF2_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF2 bitfields
 */

/*!
 * @name Register LCD_WF2, field BPALCD2[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF2_BPALCD2   (0U)          /*!< Bit position for LCD_WF2_BPALCD2. */
#define BM_LCD_WF2_BPALCD2   (0x01U)       /*!< Bit mask for LCD_WF2_BPALCD2. */
#define BS_LCD_WF2_BPALCD2   (1U)          /*!< Bit field size in bits for LCD_WF2_BPALCD2. */

/*! @brief Read current value of the LCD_WF2_BPALCD2 field. */
#define BR_LCD_WF2_BPALCD2(x) (BME_UBFX8(HW_LCD_WF2_ADDR(x), BP_LCD_WF2_BPALCD2, BS_LCD_WF2_BPALCD2))

/*! @brief Format value for bitfield LCD_WF2_BPALCD2. */
#define BF_LCD_WF2_BPALCD2(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF2_BPALCD2) & BM_LCD_WF2_BPALCD2)

/*! @brief Set the BPALCD2 field to a new value. */
#define BW_LCD_WF2_BPALCD2(x, v) (BME_BFI8(HW_LCD_WF2_ADDR(x), ((uint8_t)(v) << BP_LCD_WF2_BPALCD2), BP_LCD_WF2_BPALCD2, 1))
/*@}*/

/*!
 * @name Register LCD_WF2, field BPBLCD2[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF2_BPBLCD2   (1U)          /*!< Bit position for LCD_WF2_BPBLCD2. */
#define BM_LCD_WF2_BPBLCD2   (0x02U)       /*!< Bit mask for LCD_WF2_BPBLCD2. */
#define BS_LCD_WF2_BPBLCD2   (1U)          /*!< Bit field size in bits for LCD_WF2_BPBLCD2. */

/*! @brief Read current value of the LCD_WF2_BPBLCD2 field. */
#define BR_LCD_WF2_BPBLCD2(x) (BME_UBFX8(HW_LCD_WF2_ADDR(x), BP_LCD_WF2_BPBLCD2, BS_LCD_WF2_BPBLCD2))

