flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Set the BPFLCD3 field to a new value. */
#define BW_LCD_WF3_BPFLCD3(x, v) (BME_BFI8(HW_LCD_WF3_ADDR(x), ((uint8_t)(v) << BP_LCD_WF3_BPFLCD3), BP_LCD_WF3_BPFLCD3, 1))
/*@}*/

/*!
 * @name Register LCD_WF3, field BPGLCD3[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF3_BPGLCD3   (6U)          /*!< Bit position for LCD_WF3_BPGLCD3. */
#define BM_LCD_WF3_BPGLCD3   (0x40U)       /*!< Bit mask for LCD_WF3_BPGLCD3. */
#define BS_LCD_WF3_BPGLCD3   (1U)          /*!< Bit field size in bits for LCD_WF3_BPGLCD3. */

/*! @brief Read current value of the LCD_WF3_BPGLCD3 field. */
#define BR_LCD_WF3_BPGLCD3(x) (BME_UBFX8(HW_LCD_WF3_ADDR(x), BP_LCD_WF3_BPGLCD3, BS_LCD_WF3_BPGLCD3))

/*! @brief Format value for bitfield LCD_WF3_BPGLCD3. */
#define BF_LCD_WF3_BPGLCD3(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF3_BPGLCD3) & BM_LCD_WF3_BPGLCD3)

/*! @brief Set the BPGLCD3 field to a new value. */
#define BW_LCD_WF3_BPGLCD3(x, v) (BME_BFI8(HW_LCD_WF3_ADDR(x), ((uint8_t)(v) << BP_LCD_WF3_BPGLCD3), BP_LCD_WF3_BPGLCD3, 1))
/*@}*/

/*!
 * @name Register LCD_WF3, field BPHLCD3[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF3_BPHLCD3   (7U)          /*!< Bit position for LCD_WF3_BPHLCD3. */
#define BM_LCD_WF3_BPHLCD3   (0x80U)       /*!< Bit mask for LCD_WF3_BPHLCD3. */
#define BS_LCD_WF3_BPHLCD3   (1U)          /*!< Bit field size in bits for LCD_WF3_BPHLCD3. */

/*! @brief Read current value of the LCD_WF3_BPHLCD3 field. */
#define BR_LCD_WF3_BPHLCD3(x) (BME_UBFX8(HW_LCD_WF3_ADDR(x), BP_LCD_WF3_BPHLCD3, BS_LCD_WF3_BPHLCD3))

/*! @brief Format value for bitfield LCD_WF3_BPHLCD3. */
#define BF_LCD_WF3_BPHLCD3(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF3_BPHLCD3) & BM_LCD_WF3_BPHLCD3)

/*! @brief Set the BPHLCD3 field to a new value. */
#define BW_LCD_WF3_BPHLCD3(x, v) (BME_BFI8(HW_LCD_WF3_ADDR(x), ((uint8_t)(v) << BP_LCD_WF3_BPHLCD3), BP_LCD_WF3_BPHLCD3, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF4 - LCD Waveform Register 4.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF4 - LCD Waveform Register 4. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf4
{
    uint8_t U;
    struct _hw_lcd_wf4_bitfields
    {
        uint8_t BPALCD4 : 1;           /*!< [0]  */
        uint8_t BPBLCD4 : 1;           /*!< [1]  */
        uint8_t BPCLCD4 : 1;           /*!< [2]  */
        uint8_t BPDLCD4 : 1;           /*!< [3]  */
        uint8_t BPELCD4 : 1;           /*!< [4]  */
        uint8_t BPFLCD4 : 1;           /*!< [5]  */
        uint8_t BPGLCD4 : 1;           /*!< [6]  */
        uint8_t BPHLCD4 : 1;           /*!< [7]  */
    } B;
} hw_lcd_wf4_t;

/*!
 * @name Constants and macros for entire LCD_WF4 register
 */
/*@{*/
#define HW_LCD_WF4_ADDR(x)       ((uint32_t)(x) + 0x24U)

#define HW_LCD_WF4(x)            (*(__IO hw_lcd_wf4_t *) HW_LCD_WF4_ADDR(x))
#define HW_LCD_WF4_RD(x)         (HW_LCD_WF4(x).U)
#define HW_LCD_WF4_WR(x, v)      (HW_LCD_WF4(x).U = (v))
#define HW_LCD_WF4_SET(x, v)     (BME_OR8(HW_LCD_WF4_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF4_CLR(x, v)     (BME_AND8(HW_LCD_WF4_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF4_TOG(x, v)     (BME_XOR8(HW_LCD_WF4_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF4 bitfields
 */

/*!
 * @name Register LCD_WF4, field BPALCD4[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF4_BPALCD4   (0U)          /*!< Bit position for LCD_WF4_BPALCD4. */
#define BM_LCD_WF4_BPALCD4   (0x01U)       /*!< Bit mask for LCD_WF4_BPALCD4. */
#define BS_LCD_WF4_BPALCD4   (1U)          /*!< Bit field size in bits for LCD_WF4_BPALCD4. */

/*! @brief Read current value of the LCD_WF4_BPALCD4 field. */
#define BR_LCD_WF4_BPALCD4(x) (BME_UBFX8(HW_LCD_WF4_ADDR(x), BP_LCD_WF4_BPALCD4, BS_LCD_WF4_BPALCD4))

/*! @brief Format value for bitfield LCD_WF4_BPALCD4. */
#define BF_LCD_WF4_BPALCD4(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF4_BPALCD4) & BM_LCD_WF4_BPALCD4)

/*! @brief Set the BPALCD4 field to a new value. */
#define BW_LCD_WF4_BPALCD4(x, v) (BME_BFI8(HW_LCD_WF4_ADDR(x), ((uint8_t)(v) << BP_LCD_WF4_BPALCD4), BP_LCD_WF4_BPALCD4, 1))
/*@}*/

/*!
 * @name Register LCD_WF4, field BPBLCD4[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF4_BPBLCD4   (1U)          /*!< Bit position for LCD_WF4_BPBLCD4. */
#define BM_LCD_WF4_BPBLCD4   (0x02U)       /*!< Bit mask for LCD_WF4_BPBLCD4. */
#define BS_LCD_WF4_BPBLCD4   (1U)          /*!< Bit field size in bits for LCD_WF4_BPBLCD4. */

/*! @brief Read current value of the LCD_WF4_BPBLCD4 field. */
#define BR_LCD_WF4_BPBLCD4(x) (BME_UBFX8(HW_LCD_WF4_ADDR(x), BP_LCD_WF4_BPBLCD4, BS_LCD_WF4_BPBLCD4))

/*! @brief Format value for bitfield LCD_WF4_BPBLCD4. */
#define BF_LCD_WF4_BPBLCD4(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF4_BPBLCD4) & BM_LCD_WF4_BPBLCD4)

/*! @brief Set the BPBLCD4 field to a new value. */
#define BW_LCD_WF4_BPBLCD4(x, v) (BME_BFI8(HW_LCD_WF4_ADDR(x), ((uint8_t)(v) << BP_LCD_WF4_BPBLCD4), BP_LCD_WF4_BPBLCD4, 1))
/*@}*/

/*!
 * @name Register LCD_WF4, field BPCLCD4[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF4_BPCLCD4   (2U)          /*!< Bit position for LCD_WF4_BPCLCD4. */
#define BM_LCD_WF4_BPCLCD4   (0x04U)       /*!< Bit mask for LCD_WF4_BPCLCD4. */
#define BS_LCD_WF4_BPCLCD4   (1U)          /*!< Bit field size in bits for LCD_WF4_BPCLCD4. */

/*! @brief Read current value of the LCD_WF4_BPCLCD4 field. */
#define BR_LCD_WF4_BPCLCD4(x) (BME_UBFX8(HW_LCD_WF4_ADDR(x), BP_LCD_WF4_BPCLCD4, BS_LCD_WF4_BPCLCD4))

/*! @brief Format value for bitfield LCD_WF4_BPCLCD4. */
#define BF_LCD_WF4_BPCLCD4(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF4_BPCLCD4) & BM_LCD_WF4_BPCLCD4)

/*! @brief Set the BPCLCD4 field to a new value. */
#define BW_LCD_WF4_BPCLCD4(x, v) (BME_BFI8(HW_LCD_WF4_ADDR(x), ((uint8_t)(v) << BP_LCD_WF4_BPCLCD4), BP_LCD_WF4_BPCLCD4, 1))
/*@}*/

/*!
 * @name Register LCD_WF4, field BPDLCD4[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF4_BPDLCD4   (3U)          /*!< Bit position for LCD_WF4_BPDLCD4. */
#define BM_LCD_WF4_BPDLCD4   (0x08U)       /*!< Bit mask for LCD_WF4_BPDLCD4. */
#define BS_LCD_WF4_BPDLCD4   (1U)          /*!< Bit field size in bits for LCD_WF4_BPDLCD4. */

