flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Read current value of the LCD_WF4_BPDLCD4 field. */
#define BR_LCD_WF4_BPDLCD4(x) (BME_UBFX8(HW_LCD_WF4_ADDR(x), BP_LCD_WF4_BPDLCD4, BS_LCD_WF4_BPDLCD4))

/*! @brief Format value for bitfield LCD_WF4_BPDLCD4. */
#define BF_LCD_WF4_BPDLCD4(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF4_BPDLCD4) & BM_LCD_WF4_BPDLCD4)

/*! @brief Set the BPDLCD4 field to a new value. */
#define BW_LCD_WF4_BPDLCD4(x, v) (BME_BFI8(HW_LCD_WF4_ADDR(x), ((uint8_t)(v) << BP_LCD_WF4_BPDLCD4), BP_LCD_WF4_BPDLCD4, 1))
/*@}*/

/*!
 * @name Register LCD_WF4, field BPELCD4[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF4_BPELCD4   (4U)          /*!< Bit position for LCD_WF4_BPELCD4. */
#define BM_LCD_WF4_BPELCD4   (0x10U)       /*!< Bit mask for LCD_WF4_BPELCD4. */
#define BS_LCD_WF4_BPELCD4   (1U)          /*!< Bit field size in bits for LCD_WF4_BPELCD4. */

/*! @brief Read current value of the LCD_WF4_BPELCD4 field. */
#define BR_LCD_WF4_BPELCD4(x) (BME_UBFX8(HW_LCD_WF4_ADDR(x), BP_LCD_WF4_BPELCD4, BS_LCD_WF4_BPELCD4))

/*! @brief Format value for bitfield LCD_WF4_BPELCD4. */
#define BF_LCD_WF4_BPELCD4(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF4_BPELCD4) & BM_LCD_WF4_BPELCD4)

/*! @brief Set the BPELCD4 field to a new value. */
#define BW_LCD_WF4_BPELCD4(x, v) (BME_BFI8(HW_LCD_WF4_ADDR(x), ((uint8_t)(v) << BP_LCD_WF4_BPELCD4), BP_LCD_WF4_BPELCD4, 1))
/*@}*/

/*!
 * @name Register LCD_WF4, field BPFLCD4[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF4_BPFLCD4   (5U)          /*!< Bit position for LCD_WF4_BPFLCD4. */
#define BM_LCD_WF4_BPFLCD4   (0x20U)       /*!< Bit mask for LCD_WF4_BPFLCD4. */
#define BS_LCD_WF4_BPFLCD4   (1U)          /*!< Bit field size in bits for LCD_WF4_BPFLCD4. */

/*! @brief Read current value of the LCD_WF4_BPFLCD4 field. */
#define BR_LCD_WF4_BPFLCD4(x) (BME_UBFX8(HW_LCD_WF4_ADDR(x), BP_LCD_WF4_BPFLCD4, BS_LCD_WF4_BPFLCD4))

/*! @brief Format value for bitfield LCD_WF4_BPFLCD4. */
#define BF_LCD_WF4_BPFLCD4(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF4_BPFLCD4) & BM_LCD_WF4_BPFLCD4)

/*! @brief Set the BPFLCD4 field to a new value. */
#define BW_LCD_WF4_BPFLCD4(x, v) (BME_BFI8(HW_LCD_WF4_ADDR(x), ((uint8_t)(v) << BP_LCD_WF4_BPFLCD4), BP_LCD_WF4_BPFLCD4, 1))
/*@}*/

/*!
 * @name Register LCD_WF4, field BPGLCD4[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF4_BPGLCD4   (6U)          /*!< Bit position for LCD_WF4_BPGLCD4. */
#define BM_LCD_WF4_BPGLCD4   (0x40U)       /*!< Bit mask for LCD_WF4_BPGLCD4. */
#define BS_LCD_WF4_BPGLCD4   (1U)          /*!< Bit field size in bits for LCD_WF4_BPGLCD4. */

/*! @brief Read current value of the LCD_WF4_BPGLCD4 field. */
#define BR_LCD_WF4_BPGLCD4(x) (BME_UBFX8(HW_LCD_WF4_ADDR(x), BP_LCD_WF4_BPGLCD4, BS_LCD_WF4_BPGLCD4))

/*! @brief Format value for bitfield LCD_WF4_BPGLCD4. */
#define BF_LCD_WF4_BPGLCD4(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF4_BPGLCD4) & BM_LCD_WF4_BPGLCD4)

/*! @brief Set the BPGLCD4 field to a new value. */
#define BW_LCD_WF4_BPGLCD4(x, v) (BME_BFI8(HW_LCD_WF4_ADDR(x), ((uint8_t)(v) << BP_LCD_WF4_BPGLCD4), BP_LCD_WF4_BPGLCD4, 1))
/*@}*/

/*!
 * @name Register LCD_WF4, field BPHLCD4[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF4_BPHLCD4   (7U)          /*!< Bit position for LCD_WF4_BPHLCD4. */
#define BM_LCD_WF4_BPHLCD4   (0x80U)       /*!< Bit mask for LCD_WF4_BPHLCD4. */
#define BS_LCD_WF4_BPHLCD4   (1U)          /*!< Bit field size in bits for LCD_WF4_BPHLCD4. */

/*! @brief Read current value of the LCD_WF4_BPHLCD4 field. */
#define BR_LCD_WF4_BPHLCD4(x) (BME_UBFX8(HW_LCD_WF4_ADDR(x), BP_LCD_WF4_BPHLCD4, BS_LCD_WF4_BPHLCD4))

/*! @brief Format value for bitfield LCD_WF4_BPHLCD4. */
#define BF_LCD_WF4_BPHLCD4(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF4_BPHLCD4) & BM_LCD_WF4_BPHLCD4)

/*! @brief Set the BPHLCD4 field to a new value. */
#define BW_LCD_WF4_BPHLCD4(x, v) (BME_BFI8(HW_LCD_WF4_ADDR(x), ((uint8_t)(v) << BP_LCD_WF4_BPHLCD4), BP_LCD_WF4_BPHLCD4, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF5 - LCD Waveform Register 5.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF5 - LCD Waveform Register 5. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf5
{
    uint8_t U;
    struct _hw_lcd_wf5_bitfields
    {
        uint8_t BPALCD5 : 1;           /*!< [0]  */
        uint8_t BPBLCD5 : 1;           /*!< [1]  */
        uint8_t BPCLCD5 : 1;           /*!< [2]  */
        uint8_t BPDLCD5 : 1;           /*!< [3]  */
        uint8_t BPELCD5 : 1;           /*!< [4]  */
        uint8_t BPFLCD5 : 1;           /*!< [5]  */
        uint8_t BPGLCD5 : 1;           /*!< [6]  */
        uint8_t BPHLCD5 : 1;           /*!< [7]  */
    } B;
} hw_lcd_wf5_t;

/*!
 * @name Constants and macros for entire LCD_WF5 register
 */
/*@{*/
#define HW_LCD_WF5_ADDR(x)       ((uint32_t)(x) + 0x25U)

#define HW_LCD_WF5(x)            (*(__IO hw_lcd_wf5_t *) HW_LCD_WF5_ADDR(x))
#define HW_LCD_WF5_RD(x)         (HW_LCD_WF5(x).U)
#define HW_LCD_WF5_WR(x, v)      (HW_LCD_WF5(x).U = (v))
#define HW_LCD_WF5_SET(x, v)     (BME_OR8(HW_LCD_WF5_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF5_CLR(x, v)     (BME_AND8(HW_LCD_WF5_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF5_TOG(x, v)     (BME_XOR8(HW_LCD_WF5_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF5 bitfields
 */

/*!
 * @name Register LCD_WF5, field BPALCD5[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF5_BPALCD5   (0U)          /*!< Bit position for LCD_WF5_BPALCD5. */
#define BM_LCD_WF5_BPALCD5   (0x01U)       /*!< Bit mask for LCD_WF5_BPALCD5. */
#define BS_LCD_WF5_BPALCD5   (1U)          /*!< Bit field size in bits for LCD_WF5_BPALCD5. */

/*! @brief Read current value of the LCD_WF5_BPALCD5 field. */
#define BR_LCD_WF5_BPALCD5(x) (BME_UBFX8(HW_LCD_WF5_ADDR(x), BP_LCD_WF5_BPALCD5, BS_LCD_WF5_BPALCD5))

/*! @brief Format value for bitfield LCD_WF5_BPALCD5. */
#define BF_LCD_WF5_BPALCD5(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF5_BPALCD5) & BM_LCD_WF5_BPALCD5)

/*! @brief Set the BPALCD5 field to a new value. */
#define BW_LCD_WF5_BPALCD5(x, v) (BME_BFI8(HW_LCD_WF5_ADDR(x), ((uint8_t)(v) << BP_LCD_WF5_BPALCD5), BP_LCD_WF5_BPALCD5, 1))
/*@}*/

/*!
 * @name Register LCD_WF5, field BPBLCD5[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF5_BPBLCD5   (1U)          /*!< Bit position for LCD_WF5_BPBLCD5. */
#define BM_LCD_WF5_BPBLCD5   (0x02U)       /*!< Bit mask for LCD_WF5_BPBLCD5. */
#define BS_LCD_WF5_BPBLCD5   (1U)          /*!< Bit field size in bits for LCD_WF5_BPBLCD5. */

/*! @brief Read current value of the LCD_WF5_BPBLCD5 field. */
#define BR_LCD_WF5_BPBLCD5(x) (BME_UBFX8(HW_LCD_WF5_ADDR(x), BP_LCD_WF5_BPBLCD5, BS_LCD_WF5_BPBLCD5))

