flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Format value for bitfield LCD_WF5_BPBLCD5. */
#define BF_LCD_WF5_BPBLCD5(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF5_BPBLCD5) & BM_LCD_WF5_BPBLCD5)

/*! @brief Set the BPBLCD5 field to a new value. */
#define BW_LCD_WF5_BPBLCD5(x, v) (BME_BFI8(HW_LCD_WF5_ADDR(x), ((uint8_t)(v) << BP_LCD_WF5_BPBLCD5), BP_LCD_WF5_BPBLCD5, 1))
/*@}*/

/*!
 * @name Register LCD_WF5, field BPCLCD5[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF5_BPCLCD5   (2U)          /*!< Bit position for LCD_WF5_BPCLCD5. */
#define BM_LCD_WF5_BPCLCD5   (0x04U)       /*!< Bit mask for LCD_WF5_BPCLCD5. */
#define BS_LCD_WF5_BPCLCD5   (1U)          /*!< Bit field size in bits for LCD_WF5_BPCLCD5. */

/*! @brief Read current value of the LCD_WF5_BPCLCD5 field. */
#define BR_LCD_WF5_BPCLCD5(x) (BME_UBFX8(HW_LCD_WF5_ADDR(x), BP_LCD_WF5_BPCLCD5, BS_LCD_WF5_BPCLCD5))

/*! @brief Format value for bitfield LCD_WF5_BPCLCD5. */
#define BF_LCD_WF5_BPCLCD5(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF5_BPCLCD5) & BM_LCD_WF5_BPCLCD5)

/*! @brief Set the BPCLCD5 field to a new value. */
#define BW_LCD_WF5_BPCLCD5(x, v) (BME_BFI8(HW_LCD_WF5_ADDR(x), ((uint8_t)(v) << BP_LCD_WF5_BPCLCD5), BP_LCD_WF5_BPCLCD5, 1))
/*@}*/

/*!
 * @name Register LCD_WF5, field BPDLCD5[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF5_BPDLCD5   (3U)          /*!< Bit position for LCD_WF5_BPDLCD5. */
#define BM_LCD_WF5_BPDLCD5   (0x08U)       /*!< Bit mask for LCD_WF5_BPDLCD5. */
#define BS_LCD_WF5_BPDLCD5   (1U)          /*!< Bit field size in bits for LCD_WF5_BPDLCD5. */

/*! @brief Read current value of the LCD_WF5_BPDLCD5 field. */
#define BR_LCD_WF5_BPDLCD5(x) (BME_UBFX8(HW_LCD_WF5_ADDR(x), BP_LCD_WF5_BPDLCD5, BS_LCD_WF5_BPDLCD5))

/*! @brief Format value for bitfield LCD_WF5_BPDLCD5. */
#define BF_LCD_WF5_BPDLCD5(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF5_BPDLCD5) & BM_LCD_WF5_BPDLCD5)

/*! @brief Set the BPDLCD5 field to a new value. */
#define BW_LCD_WF5_BPDLCD5(x, v) (BME_BFI8(HW_LCD_WF5_ADDR(x), ((uint8_t)(v) << BP_LCD_WF5_BPDLCD5), BP_LCD_WF5_BPDLCD5, 1))
/*@}*/

/*!
 * @name Register LCD_WF5, field BPELCD5[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF5_BPELCD5   (4U)          /*!< Bit position for LCD_WF5_BPELCD5. */
#define BM_LCD_WF5_BPELCD5   (0x10U)       /*!< Bit mask for LCD_WF5_BPELCD5. */
#define BS_LCD_WF5_BPELCD5   (1U)          /*!< Bit field size in bits for LCD_WF5_BPELCD5. */

/*! @brief Read current value of the LCD_WF5_BPELCD5 field. */
#define BR_LCD_WF5_BPELCD5(x) (BME_UBFX8(HW_LCD_WF5_ADDR(x), BP_LCD_WF5_BPELCD5, BS_LCD_WF5_BPELCD5))

/*! @brief Format value for bitfield LCD_WF5_BPELCD5. */
#define BF_LCD_WF5_BPELCD5(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF5_BPELCD5) & BM_LCD_WF5_BPELCD5)

/*! @brief Set the BPELCD5 field to a new value. */
#define BW_LCD_WF5_BPELCD5(x, v) (BME_BFI8(HW_LCD_WF5_ADDR(x), ((uint8_t)(v) << BP_LCD_WF5_BPELCD5), BP_LCD_WF5_BPELCD5, 1))
/*@}*/

/*!
 * @name Register LCD_WF5, field BPFLCD5[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF5_BPFLCD5   (5U)          /*!< Bit position for LCD_WF5_BPFLCD5. */
#define BM_LCD_WF5_BPFLCD5   (0x20U)       /*!< Bit mask for LCD_WF5_BPFLCD5. */
#define BS_LCD_WF5_BPFLCD5   (1U)          /*!< Bit field size in bits for LCD_WF5_BPFLCD5. */

/*! @brief Read current value of the LCD_WF5_BPFLCD5 field. */
#define BR_LCD_WF5_BPFLCD5(x) (BME_UBFX8(HW_LCD_WF5_ADDR(x), BP_LCD_WF5_BPFLCD5, BS_LCD_WF5_BPFLCD5))

/*! @brief Format value for bitfield LCD_WF5_BPFLCD5. */
#define BF_LCD_WF5_BPFLCD5(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF5_BPFLCD5) & BM_LCD_WF5_BPFLCD5)

/*! @brief Set the BPFLCD5 field to a new value. */
#define BW_LCD_WF5_BPFLCD5(x, v) (BME_BFI8(HW_LCD_WF5_ADDR(x), ((uint8_t)(v) << BP_LCD_WF5_BPFLCD5), BP_LCD_WF5_BPFLCD5, 1))
/*@}*/

/*!
 * @name Register LCD_WF5, field BPGLCD5[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF5_BPGLCD5   (6U)          /*!< Bit position for LCD_WF5_BPGLCD5. */
#define BM_LCD_WF5_BPGLCD5   (0x40U)       /*!< Bit mask for LCD_WF5_BPGLCD5. */
#define BS_LCD_WF5_BPGLCD5   (1U)          /*!< Bit field size in bits for LCD_WF5_BPGLCD5. */

/*! @brief Read current value of the LCD_WF5_BPGLCD5 field. */
#define BR_LCD_WF5_BPGLCD5(x) (BME_UBFX8(HW_LCD_WF5_ADDR(x), BP_LCD_WF5_BPGLCD5, BS_LCD_WF5_BPGLCD5))

/*! @brief Format value for bitfield LCD_WF5_BPGLCD5. */
#define BF_LCD_WF5_BPGLCD5(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF5_BPGLCD5) & BM_LCD_WF5_BPGLCD5)

/*! @brief Set the BPGLCD5 field to a new value. */
#define BW_LCD_WF5_BPGLCD5(x, v) (BME_BFI8(HW_LCD_WF5_ADDR(x), ((uint8_t)(v) << BP_LCD_WF5_BPGLCD5), BP_LCD_WF5_BPGLCD5, 1))
/*@}*/

/*!
 * @name Register LCD_WF5, field BPHLCD5[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF5_BPHLCD5   (7U)          /*!< Bit position for LCD_WF5_BPHLCD5. */
#define BM_LCD_WF5_BPHLCD5   (0x80U)       /*!< Bit mask for LCD_WF5_BPHLCD5. */
#define BS_LCD_WF5_BPHLCD5   (1U)          /*!< Bit field size in bits for LCD_WF5_BPHLCD5. */

/*! @brief Read current value of the LCD_WF5_BPHLCD5 field. */
#define BR_LCD_WF5_BPHLCD5(x) (BME_UBFX8(HW_LCD_WF5_ADDR(x), BP_LCD_WF5_BPHLCD5, BS_LCD_WF5_BPHLCD5))

/*! @brief Format value for bitfield LCD_WF5_BPHLCD5. */
#define BF_LCD_WF5_BPHLCD5(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF5_BPHLCD5) & BM_LCD_WF5_BPHLCD5)

/*! @brief Set the BPHLCD5 field to a new value. */
#define BW_LCD_WF5_BPHLCD5(x, v) (BME_BFI8(HW_LCD_WF5_ADDR(x), ((uint8_t)(v) << BP_LCD_WF5_BPHLCD5), BP_LCD_WF5_BPHLCD5, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF6 - LCD Waveform Register 6.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF6 - LCD Waveform Register 6. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf6
{
    uint8_t U;
    struct _hw_lcd_wf6_bitfields
    {
        uint8_t BPALCD6 : 1;           /*!< [0]  */
        uint8_t BPBLCD6 : 1;           /*!< [1]  */
        uint8_t BPCLCD6 : 1;           /*!< [2]  */
        uint8_t BPDLCD6 : 1;           /*!< [3]  */
        uint8_t BPELCD6 : 1;           /*!< [4]  */
        uint8_t BPFLCD6 : 1;           /*!< [5]  */
        uint8_t BPGLCD6 : 1;           /*!< [6]  */
        uint8_t BPHLCD6 : 1;           /*!< [7]  */
    } B;
} hw_lcd_wf6_t;

/*!
 * @name Constants and macros for entire LCD_WF6 register
 */
/*@{*/
#define HW_LCD_WF6_ADDR(x)       ((uint32_t)(x) + 0x26U)

#define HW_LCD_WF6(x)            (*(__IO hw_lcd_wf6_t *) HW_LCD_WF6_ADDR(x))
#define HW_LCD_WF6_RD(x)         (HW_LCD_WF6(x).U)
#define HW_LCD_WF6_WR(x, v)      (HW_LCD_WF6(x).U = (v))
#define HW_LCD_WF6_SET(x, v)     (BME_OR8(HW_LCD_WF6_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF6_CLR(x, v)     (BME_AND8(HW_LCD_WF6_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF6_TOG(x, v)     (BME_XOR8(HW_LCD_WF6_ADDR(x), (uint8_t)(v)))
/*@}*/

