flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*
 * Constants & macros for individual LCD_WF6 bitfields
 */

/*!
 * @name Register LCD_WF6, field BPALCD6[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF6_BPALCD6   (0U)          /*!< Bit position for LCD_WF6_BPALCD6. */
#define BM_LCD_WF6_BPALCD6   (0x01U)       /*!< Bit mask for LCD_WF6_BPALCD6. */
#define BS_LCD_WF6_BPALCD6   (1U)          /*!< Bit field size in bits for LCD_WF6_BPALCD6. */

/*! @brief Read current value of the LCD_WF6_BPALCD6 field. */
#define BR_LCD_WF6_BPALCD6(x) (BME_UBFX8(HW_LCD_WF6_ADDR(x), BP_LCD_WF6_BPALCD6, BS_LCD_WF6_BPALCD6))

/*! @brief Format value for bitfield LCD_WF6_BPALCD6. */
#define BF_LCD_WF6_BPALCD6(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF6_BPALCD6) & BM_LCD_WF6_BPALCD6)

/*! @brief Set the BPALCD6 field to a new value. */
#define BW_LCD_WF6_BPALCD6(x, v) (BME_BFI8(HW_LCD_WF6_ADDR(x), ((uint8_t)(v) << BP_LCD_WF6_BPALCD6), BP_LCD_WF6_BPALCD6, 1))
/*@}*/

/*!
 * @name Register LCD_WF6, field BPBLCD6[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF6_BPBLCD6   (1U)          /*!< Bit position for LCD_WF6_BPBLCD6. */
#define BM_LCD_WF6_BPBLCD6   (0x02U)       /*!< Bit mask for LCD_WF6_BPBLCD6. */
#define BS_LCD_WF6_BPBLCD6   (1U)          /*!< Bit field size in bits for LCD_WF6_BPBLCD6. */

/*! @brief Read current value of the LCD_WF6_BPBLCD6 field. */
#define BR_LCD_WF6_BPBLCD6(x) (BME_UBFX8(HW_LCD_WF6_ADDR(x), BP_LCD_WF6_BPBLCD6, BS_LCD_WF6_BPBLCD6))

/*! @brief Format value for bitfield LCD_WF6_BPBLCD6. */
#define BF_LCD_WF6_BPBLCD6(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF6_BPBLCD6) & BM_LCD_WF6_BPBLCD6)

/*! @brief Set the BPBLCD6 field to a new value. */
#define BW_LCD_WF6_BPBLCD6(x, v) (BME_BFI8(HW_LCD_WF6_ADDR(x), ((uint8_t)(v) << BP_LCD_WF6_BPBLCD6), BP_LCD_WF6_BPBLCD6, 1))
/*@}*/

/*!
 * @name Register LCD_WF6, field BPCLCD6[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF6_BPCLCD6   (2U)          /*!< Bit position for LCD_WF6_BPCLCD6. */
#define BM_LCD_WF6_BPCLCD6   (0x04U)       /*!< Bit mask for LCD_WF6_BPCLCD6. */
#define BS_LCD_WF6_BPCLCD6   (1U)          /*!< Bit field size in bits for LCD_WF6_BPCLCD6. */

/*! @brief Read current value of the LCD_WF6_BPCLCD6 field. */
#define BR_LCD_WF6_BPCLCD6(x) (BME_UBFX8(HW_LCD_WF6_ADDR(x), BP_LCD_WF6_BPCLCD6, BS_LCD_WF6_BPCLCD6))

/*! @brief Format value for bitfield LCD_WF6_BPCLCD6. */
#define BF_LCD_WF6_BPCLCD6(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF6_BPCLCD6) & BM_LCD_WF6_BPCLCD6)

/*! @brief Set the BPCLCD6 field to a new value. */
#define BW_LCD_WF6_BPCLCD6(x, v) (BME_BFI8(HW_LCD_WF6_ADDR(x), ((uint8_t)(v) << BP_LCD_WF6_BPCLCD6), BP_LCD_WF6_BPCLCD6, 1))
/*@}*/

/*!
 * @name Register LCD_WF6, field BPDLCD6[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF6_BPDLCD6   (3U)          /*!< Bit position for LCD_WF6_BPDLCD6. */
#define BM_LCD_WF6_BPDLCD6   (0x08U)       /*!< Bit mask for LCD_WF6_BPDLCD6. */
#define BS_LCD_WF6_BPDLCD6   (1U)          /*!< Bit field size in bits for LCD_WF6_BPDLCD6. */

/*! @brief Read current value of the LCD_WF6_BPDLCD6 field. */
#define BR_LCD_WF6_BPDLCD6(x) (BME_UBFX8(HW_LCD_WF6_ADDR(x), BP_LCD_WF6_BPDLCD6, BS_LCD_WF6_BPDLCD6))

/*! @brief Format value for bitfield LCD_WF6_BPDLCD6. */
#define BF_LCD_WF6_BPDLCD6(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF6_BPDLCD6) & BM_LCD_WF6_BPDLCD6)

/*! @brief Set the BPDLCD6 field to a new value. */
#define BW_LCD_WF6_BPDLCD6(x, v) (BME_BFI8(HW_LCD_WF6_ADDR(x), ((uint8_t)(v) << BP_LCD_WF6_BPDLCD6), BP_LCD_WF6_BPDLCD6, 1))
/*@}*/

/*!
 * @name Register LCD_WF6, field BPELCD6[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF6_BPELCD6   (4U)          /*!< Bit position for LCD_WF6_BPELCD6. */
#define BM_LCD_WF6_BPELCD6   (0x10U)       /*!< Bit mask for LCD_WF6_BPELCD6. */
#define BS_LCD_WF6_BPELCD6   (1U)          /*!< Bit field size in bits for LCD_WF6_BPELCD6. */

/*! @brief Read current value of the LCD_WF6_BPELCD6 field. */
#define BR_LCD_WF6_BPELCD6(x) (BME_UBFX8(HW_LCD_WF6_ADDR(x), BP_LCD_WF6_BPELCD6, BS_LCD_WF6_BPELCD6))

/*! @brief Format value for bitfield LCD_WF6_BPELCD6. */
#define BF_LCD_WF6_BPELCD6(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF6_BPELCD6) & BM_LCD_WF6_BPELCD6)

/*! @brief Set the BPELCD6 field to a new value. */
#define BW_LCD_WF6_BPELCD6(x, v) (BME_BFI8(HW_LCD_WF6_ADDR(x), ((uint8_t)(v) << BP_LCD_WF6_BPELCD6), BP_LCD_WF6_BPELCD6, 1))
/*@}*/

/*!
 * @name Register LCD_WF6, field BPFLCD6[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF6_BPFLCD6   (5U)          /*!< Bit position for LCD_WF6_BPFLCD6. */
#define BM_LCD_WF6_BPFLCD6   (0x20U)       /*!< Bit mask for LCD_WF6_BPFLCD6. */
#define BS_LCD_WF6_BPFLCD6   (1U)          /*!< Bit field size in bits for LCD_WF6_BPFLCD6. */

/*! @brief Read current value of the LCD_WF6_BPFLCD6 field. */
#define BR_LCD_WF6_BPFLCD6(x) (BME_UBFX8(HW_LCD_WF6_ADDR(x), BP_LCD_WF6_BPFLCD6, BS_LCD_WF6_BPFLCD6))

/*! @brief Format value for bitfield LCD_WF6_BPFLCD6. */
#define BF_LCD_WF6_BPFLCD6(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF6_BPFLCD6) & BM_LCD_WF6_BPFLCD6)

/*! @brief Set the BPFLCD6 field to a new value. */
#define BW_LCD_WF6_BPFLCD6(x, v) (BME_BFI8(HW_LCD_WF6_ADDR(x), ((uint8_t)(v) << BP_LCD_WF6_BPFLCD6), BP_LCD_WF6_BPFLCD6, 1))
/*@}*/

/*!
 * @name Register LCD_WF6, field BPGLCD6[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF6_BPGLCD6   (6U)          /*!< Bit position for LCD_WF6_BPGLCD6. */
#define BM_LCD_WF6_BPGLCD6   (0x40U)       /*!< Bit mask for LCD_WF6_BPGLCD6. */
#define BS_LCD_WF6_BPGLCD6   (1U)          /*!< Bit field size in bits for LCD_WF6_BPGLCD6. */

/*! @brief Read current value of the LCD_WF6_BPGLCD6 field. */
#define BR_LCD_WF6_BPGLCD6(x) (BME_UBFX8(HW_LCD_WF6_ADDR(x), BP_LCD_WF6_BPGLCD6, BS_LCD_WF6_BPGLCD6))

/*! @brief Format value for bitfield LCD_WF6_BPGLCD6. */
#define BF_LCD_WF6_BPGLCD6(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF6_BPGLCD6) & BM_LCD_WF6_BPGLCD6)

/*! @brief Set the BPGLCD6 field to a new value. */
#define BW_LCD_WF6_BPGLCD6(x, v) (BME_BFI8(HW_LCD_WF6_ADDR(x), ((uint8_t)(v) << BP_LCD_WF6_BPGLCD6), BP_LCD_WF6_BPGLCD6, 1))
/*@}*/

/*!
 * @name Register LCD_WF6, field BPHLCD6[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF6_BPHLCD6   (7U)          /*!< Bit position for LCD_WF6_BPHLCD6. */
#define BM_LCD_WF6_BPHLCD6   (0x80U)       /*!< Bit mask for LCD_WF6_BPHLCD6. */
#define BS_LCD_WF6_BPHLCD6   (1U)          /*!< Bit field size in bits for LCD_WF6_BPHLCD6. */

