flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Read current value of the LCD_WF6_BPHLCD6 field. */
#define BR_LCD_WF6_BPHLCD6(x) (BME_UBFX8(HW_LCD_WF6_ADDR(x), BP_LCD_WF6_BPHLCD6, BS_LCD_WF6_BPHLCD6))

/*! @brief Format value for bitfield LCD_WF6_BPHLCD6. */
#define BF_LCD_WF6_BPHLCD6(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF6_BPHLCD6) & BM_LCD_WF6_BPHLCD6)

/*! @brief Set the BPHLCD6 field to a new value. */
#define BW_LCD_WF6_BPHLCD6(x, v) (BME_BFI8(HW_LCD_WF6_ADDR(x), ((uint8_t)(v) << BP_LCD_WF6_BPHLCD6), BP_LCD_WF6_BPHLCD6, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF7 - LCD Waveform Register 7.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF7 - LCD Waveform Register 7. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf7
{
    uint8_t U;
    struct _hw_lcd_wf7_bitfields
    {
        uint8_t BPALCD7 : 1;           /*!< [0]  */
        uint8_t BPBLCD7 : 1;           /*!< [1]  */
        uint8_t BPCLCD7 : 1;           /*!< [2]  */
        uint8_t BPDLCD7 : 1;           /*!< [3]  */
        uint8_t BPELCD7 : 1;           /*!< [4]  */
        uint8_t BPFLCD7 : 1;           /*!< [5]  */
        uint8_t BPGLCD7 : 1;           /*!< [6]  */
        uint8_t BPHLCD7 : 1;           /*!< [7]  */
    } B;
} hw_lcd_wf7_t;

/*!
 * @name Constants and macros for entire LCD_WF7 register
 */
/*@{*/
#define HW_LCD_WF7_ADDR(x)       ((uint32_t)(x) + 0x27U)

#define HW_LCD_WF7(x)            (*(__IO hw_lcd_wf7_t *) HW_LCD_WF7_ADDR(x))
#define HW_LCD_WF7_RD(x)         (HW_LCD_WF7(x).U)
#define HW_LCD_WF7_WR(x, v)      (HW_LCD_WF7(x).U = (v))
#define HW_LCD_WF7_SET(x, v)     (BME_OR8(HW_LCD_WF7_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF7_CLR(x, v)     (BME_AND8(HW_LCD_WF7_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF7_TOG(x, v)     (BME_XOR8(HW_LCD_WF7_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF7 bitfields
 */

/*!
 * @name Register LCD_WF7, field BPALCD7[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF7_BPALCD7   (0U)          /*!< Bit position for LCD_WF7_BPALCD7. */
#define BM_LCD_WF7_BPALCD7   (0x01U)       /*!< Bit mask for LCD_WF7_BPALCD7. */
#define BS_LCD_WF7_BPALCD7   (1U)          /*!< Bit field size in bits for LCD_WF7_BPALCD7. */

/*! @brief Read current value of the LCD_WF7_BPALCD7 field. */
#define BR_LCD_WF7_BPALCD7(x) (BME_UBFX8(HW_LCD_WF7_ADDR(x), BP_LCD_WF7_BPALCD7, BS_LCD_WF7_BPALCD7))

/*! @brief Format value for bitfield LCD_WF7_BPALCD7. */
#define BF_LCD_WF7_BPALCD7(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF7_BPALCD7) & BM_LCD_WF7_BPALCD7)

/*! @brief Set the BPALCD7 field to a new value. */
#define BW_LCD_WF7_BPALCD7(x, v) (BME_BFI8(HW_LCD_WF7_ADDR(x), ((uint8_t)(v) << BP_LCD_WF7_BPALCD7), BP_LCD_WF7_BPALCD7, 1))
/*@}*/

/*!
 * @name Register LCD_WF7, field BPBLCD7[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF7_BPBLCD7   (1U)          /*!< Bit position for LCD_WF7_BPBLCD7. */
#define BM_LCD_WF7_BPBLCD7   (0x02U)       /*!< Bit mask for LCD_WF7_BPBLCD7. */
#define BS_LCD_WF7_BPBLCD7   (1U)          /*!< Bit field size in bits for LCD_WF7_BPBLCD7. */

/*! @brief Read current value of the LCD_WF7_BPBLCD7 field. */
#define BR_LCD_WF7_BPBLCD7(x) (BME_UBFX8(HW_LCD_WF7_ADDR(x), BP_LCD_WF7_BPBLCD7, BS_LCD_WF7_BPBLCD7))

/*! @brief Format value for bitfield LCD_WF7_BPBLCD7. */
#define BF_LCD_WF7_BPBLCD7(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF7_BPBLCD7) & BM_LCD_WF7_BPBLCD7)

/*! @brief Set the BPBLCD7 field to a new value. */
#define BW_LCD_WF7_BPBLCD7(x, v) (BME_BFI8(HW_LCD_WF7_ADDR(x), ((uint8_t)(v) << BP_LCD_WF7_BPBLCD7), BP_LCD_WF7_BPBLCD7, 1))
/*@}*/

/*!
 * @name Register LCD_WF7, field BPCLCD7[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF7_BPCLCD7   (2U)          /*!< Bit position for LCD_WF7_BPCLCD7. */
#define BM_LCD_WF7_BPCLCD7   (0x04U)       /*!< Bit mask for LCD_WF7_BPCLCD7. */
#define BS_LCD_WF7_BPCLCD7   (1U)          /*!< Bit field size in bits for LCD_WF7_BPCLCD7. */

/*! @brief Read current value of the LCD_WF7_BPCLCD7 field. */
#define BR_LCD_WF7_BPCLCD7(x) (BME_UBFX8(HW_LCD_WF7_ADDR(x), BP_LCD_WF7_BPCLCD7, BS_LCD_WF7_BPCLCD7))

/*! @brief Format value for bitfield LCD_WF7_BPCLCD7. */
#define BF_LCD_WF7_BPCLCD7(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF7_BPCLCD7) & BM_LCD_WF7_BPCLCD7)

/*! @brief Set the BPCLCD7 field to a new value. */
#define BW_LCD_WF7_BPCLCD7(x, v) (BME_BFI8(HW_LCD_WF7_ADDR(x), ((uint8_t)(v) << BP_LCD_WF7_BPCLCD7), BP_LCD_WF7_BPCLCD7, 1))
/*@}*/

/*!
 * @name Register LCD_WF7, field BPDLCD7[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF7_BPDLCD7   (3U)          /*!< Bit position for LCD_WF7_BPDLCD7. */
#define BM_LCD_WF7_BPDLCD7   (0x08U)       /*!< Bit mask for LCD_WF7_BPDLCD7. */
#define BS_LCD_WF7_BPDLCD7   (1U)          /*!< Bit field size in bits for LCD_WF7_BPDLCD7. */

/*! @brief Read current value of the LCD_WF7_BPDLCD7 field. */
#define BR_LCD_WF7_BPDLCD7(x) (BME_UBFX8(HW_LCD_WF7_ADDR(x), BP_LCD_WF7_BPDLCD7, BS_LCD_WF7_BPDLCD7))

/*! @brief Format value for bitfield LCD_WF7_BPDLCD7. */
#define BF_LCD_WF7_BPDLCD7(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF7_BPDLCD7) & BM_LCD_WF7_BPDLCD7)

/*! @brief Set the BPDLCD7 field to a new value. */
#define BW_LCD_WF7_BPDLCD7(x, v) (BME_BFI8(HW_LCD_WF7_ADDR(x), ((uint8_t)(v) << BP_LCD_WF7_BPDLCD7), BP_LCD_WF7_BPDLCD7, 1))
/*@}*/

/*!
 * @name Register LCD_WF7, field BPELCD7[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF7_BPELCD7   (4U)          /*!< Bit position for LCD_WF7_BPELCD7. */
#define BM_LCD_WF7_BPELCD7   (0x10U)       /*!< Bit mask for LCD_WF7_BPELCD7. */
#define BS_LCD_WF7_BPELCD7   (1U)          /*!< Bit field size in bits for LCD_WF7_BPELCD7. */

