flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*
 * Constants & macros for individual LCD_WF9 bitfields
 */

/*!
 * @name Register LCD_WF9, field BPALCD9[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF9_BPALCD9   (0U)          /*!< Bit position for LCD_WF9_BPALCD9. */
#define BM_LCD_WF9_BPALCD9   (0x01U)       /*!< Bit mask for LCD_WF9_BPALCD9. */
#define BS_LCD_WF9_BPALCD9   (1U)          /*!< Bit field size in bits for LCD_WF9_BPALCD9. */

/*! @brief Read current value of the LCD_WF9_BPALCD9 field. */
#define BR_LCD_WF9_BPALCD9(x) (BME_UBFX8(HW_LCD_WF9_ADDR(x), BP_LCD_WF9_BPALCD9, BS_LCD_WF9_BPALCD9))

/*! @brief Format value for bitfield LCD_WF9_BPALCD9. */
#define BF_LCD_WF9_BPALCD9(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF9_BPALCD9) & BM_LCD_WF9_BPALCD9)

/*! @brief Set the BPALCD9 field to a new value. */
#define BW_LCD_WF9_BPALCD9(x, v) (BME_BFI8(HW_LCD_WF9_ADDR(x), ((uint8_t)(v) << BP_LCD_WF9_BPALCD9), BP_LCD_WF9_BPALCD9, 1))
/*@}*/

/*!
 * @name Register LCD_WF9, field BPBLCD9[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF9_BPBLCD9   (1U)          /*!< Bit position for LCD_WF9_BPBLCD9. */
#define BM_LCD_WF9_BPBLCD9   (0x02U)       /*!< Bit mask for LCD_WF9_BPBLCD9. */
#define BS_LCD_WF9_BPBLCD9   (1U)          /*!< Bit field size in bits for LCD_WF9_BPBLCD9. */

/*! @brief Read current value of the LCD_WF9_BPBLCD9 field. */
#define BR_LCD_WF9_BPBLCD9(x) (BME_UBFX8(HW_LCD_WF9_ADDR(x), BP_LCD_WF9_BPBLCD9, BS_LCD_WF9_BPBLCD9))

/*! @brief Format value for bitfield LCD_WF9_BPBLCD9. */
#define BF_LCD_WF9_BPBLCD9(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF9_BPBLCD9) & BM_LCD_WF9_BPBLCD9)

/*! @brief Set the BPBLCD9 field to a new value. */
#define BW_LCD_WF9_BPBLCD9(x, v) (BME_BFI8(HW_LCD_WF9_ADDR(x), ((uint8_t)(v) << BP_LCD_WF9_BPBLCD9), BP_LCD_WF9_BPBLCD9, 1))
/*@}*/

/*!
 * @name Register LCD_WF9, field BPCLCD9[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF9_BPCLCD9   (2U)          /*!< Bit position for LCD_WF9_BPCLCD9. */
#define BM_LCD_WF9_BPCLCD9   (0x04U)       /*!< Bit mask for LCD_WF9_BPCLCD9. */
#define BS_LCD_WF9_BPCLCD9   (1U)          /*!< Bit field size in bits for LCD_WF9_BPCLCD9. */

/*! @brief Read current value of the LCD_WF9_BPCLCD9 field. */
#define BR_LCD_WF9_BPCLCD9(x) (BME_UBFX8(HW_LCD_WF9_ADDR(x), BP_LCD_WF9_BPCLCD9, BS_LCD_WF9_BPCLCD9))

/*! @brief Format value for bitfield LCD_WF9_BPCLCD9. */
#define BF_LCD_WF9_BPCLCD9(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF9_BPCLCD9) & BM_LCD_WF9_BPCLCD9)

/*! @brief Set the BPCLCD9 field to a new value. */
#define BW_LCD_WF9_BPCLCD9(x, v) (BME_BFI8(HW_LCD_WF9_ADDR(x), ((uint8_t)(v) << BP_LCD_WF9_BPCLCD9), BP_LCD_WF9_BPCLCD9, 1))
/*@}*/

/*!
 * @name Register LCD_WF9, field BPDLCD9[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF9_BPDLCD9   (3U)          /*!< Bit position for LCD_WF9_BPDLCD9. */
#define BM_LCD_WF9_BPDLCD9   (0x08U)       /*!< Bit mask for LCD_WF9_BPDLCD9. */
#define BS_LCD_WF9_BPDLCD9   (1U)          /*!< Bit field size in bits for LCD_WF9_BPDLCD9. */

/*! @brief Read current value of the LCD_WF9_BPDLCD9 field. */
#define BR_LCD_WF9_BPDLCD9(x) (BME_UBFX8(HW_LCD_WF9_ADDR(x), BP_LCD_WF9_BPDLCD9, BS_LCD_WF9_BPDLCD9))

/*! @brief Format value for bitfield LCD_WF9_BPDLCD9. */
#define BF_LCD_WF9_BPDLCD9(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF9_BPDLCD9) & BM_LCD_WF9_BPDLCD9)

/*! @brief Set the BPDLCD9 field to a new value. */
#define BW_LCD_WF9_BPDLCD9(x, v) (BME_BFI8(HW_LCD_WF9_ADDR(x), ((uint8_t)(v) << BP_LCD_WF9_BPDLCD9), BP_LCD_WF9_BPDLCD9, 1))
/*@}*/

/*!
 * @name Register LCD_WF9, field BPELCD9[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF9_BPELCD9   (4U)          /*!< Bit position for LCD_WF9_BPELCD9. */
#define BM_LCD_WF9_BPELCD9   (0x10U)       /*!< Bit mask for LCD_WF9_BPELCD9. */
#define BS_LCD_WF9_BPELCD9   (1U)          /*!< Bit field size in bits for LCD_WF9_BPELCD9. */

/*! @brief Read current value of the LCD_WF9_BPELCD9 field. */
#define BR_LCD_WF9_BPELCD9(x) (BME_UBFX8(HW_LCD_WF9_ADDR(x), BP_LCD_WF9_BPELCD9, BS_LCD_WF9_BPELCD9))

/*! @brief Format value for bitfield LCD_WF9_BPELCD9. */
#define BF_LCD_WF9_BPELCD9(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF9_BPELCD9) & BM_LCD_WF9_BPELCD9)

/*! @brief Set the BPELCD9 field to a new value. */
#define BW_LCD_WF9_BPELCD9(x, v) (BME_BFI8(HW_LCD_WF9_ADDR(x), ((uint8_t)(v) << BP_LCD_WF9_BPELCD9), BP_LCD_WF9_BPELCD9, 1))
/*@}*/

/*!
 * @name Register LCD_WF9, field BPFLCD9[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF9_BPFLCD9   (5U)          /*!< Bit position for LCD_WF9_BPFLCD9. */
#define BM_LCD_WF9_BPFLCD9   (0x20U)       /*!< Bit mask for LCD_WF9_BPFLCD9. */
#define BS_LCD_WF9_BPFLCD9   (1U)          /*!< Bit field size in bits for LCD_WF9_BPFLCD9. */

/*! @brief Read current value of the LCD_WF9_BPFLCD9 field. */
#define BR_LCD_WF9_BPFLCD9(x) (BME_UBFX8(HW_LCD_WF9_ADDR(x), BP_LCD_WF9_BPFLCD9, BS_LCD_WF9_BPFLCD9))

/*! @brief Format value for bitfield LCD_WF9_BPFLCD9. */
#define BF_LCD_WF9_BPFLCD9(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF9_BPFLCD9) & BM_LCD_WF9_BPFLCD9)

/*! @brief Set the BPFLCD9 field to a new value. */
#define BW_LCD_WF9_BPFLCD9(x, v) (BME_BFI8(HW_LCD_WF9_ADDR(x), ((uint8_t)(v) << BP_LCD_WF9_BPFLCD9), BP_LCD_WF9_BPFLCD9, 1))
/*@}*/

/*!
 * @name Register LCD_WF9, field BPGLCD9[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF9_BPGLCD9   (6U)          /*!< Bit position for LCD_WF9_BPGLCD9. */
#define BM_LCD_WF9_BPGLCD9   (0x40U)       /*!< Bit mask for LCD_WF9_BPGLCD9. */
#define BS_LCD_WF9_BPGLCD9   (1U)          /*!< Bit field size in bits for LCD_WF9_BPGLCD9. */

/*! @brief Read current value of the LCD_WF9_BPGLCD9 field. */
#define BR_LCD_WF9_BPGLCD9(x) (BME_UBFX8(HW_LCD_WF9_ADDR(x), BP_LCD_WF9_BPGLCD9, BS_LCD_WF9_BPGLCD9))

/*! @brief Format value for bitfield LCD_WF9_BPGLCD9. */
#define BF_LCD_WF9_BPGLCD9(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF9_BPGLCD9) & BM_LCD_WF9_BPGLCD9)

/*! @brief Set the BPGLCD9 field to a new value. */
#define BW_LCD_WF9_BPGLCD9(x, v) (BME_BFI8(HW_LCD_WF9_ADDR(x), ((uint8_t)(v) << BP_LCD_WF9_BPGLCD9), BP_LCD_WF9_BPGLCD9, 1))
/*@}*/

/*!
 * @name Register LCD_WF9, field BPHLCD9[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF9_BPHLCD9   (7U)          /*!< Bit position for LCD_WF9_BPHLCD9. */
#define BM_LCD_WF9_BPHLCD9   (0x80U)       /*!< Bit mask for LCD_WF9_BPHLCD9. */
#define BS_LCD_WF9_BPHLCD9   (1U)          /*!< Bit field size in bits for LCD_WF9_BPHLCD9. */

