flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Read current value of the LCD_WF9_BPHLCD9 field. */
#define BR_LCD_WF9_BPHLCD9(x) (BME_UBFX8(HW_LCD_WF9_ADDR(x), BP_LCD_WF9_BPHLCD9, BS_LCD_WF9_BPHLCD9))

/*! @brief Format value for bitfield LCD_WF9_BPHLCD9. */
#define BF_LCD_WF9_BPHLCD9(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF9_BPHLCD9) & BM_LCD_WF9_BPHLCD9)

/*! @brief Set the BPHLCD9 field to a new value. */
#define BW_LCD_WF9_BPHLCD9(x, v) (BME_BFI8(HW_LCD_WF9_ADDR(x), ((uint8_t)(v) << BP_LCD_WF9_BPHLCD9), BP_LCD_WF9_BPHLCD9, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF10 - LCD Waveform Register 10.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF10 - LCD Waveform Register 10. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf10
{
    uint8_t U;
    struct _hw_lcd_wf10_bitfields
    {
        uint8_t BPALCD10 : 1;          /*!< [0]  */
        uint8_t BPBLCD10 : 1;          /*!< [1]  */
        uint8_t BPCLCD10 : 1;          /*!< [2]  */
        uint8_t BPDLCD10 : 1;          /*!< [3]  */
        uint8_t BPELCD10 : 1;          /*!< [4]  */
        uint8_t BPFLCD10 : 1;          /*!< [5]  */
        uint8_t BPGLCD10 : 1;          /*!< [6]  */
        uint8_t BPHLCD10 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf10_t;

/*!
 * @name Constants and macros for entire LCD_WF10 register
 */
/*@{*/
#define HW_LCD_WF10_ADDR(x)      ((uint32_t)(x) + 0x2AU)

#define HW_LCD_WF10(x)           (*(__IO hw_lcd_wf10_t *) HW_LCD_WF10_ADDR(x))
#define HW_LCD_WF10_RD(x)        (HW_LCD_WF10(x).U)
#define HW_LCD_WF10_WR(x, v)     (HW_LCD_WF10(x).U = (v))
#define HW_LCD_WF10_SET(x, v)    (BME_OR8(HW_LCD_WF10_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF10_CLR(x, v)    (BME_AND8(HW_LCD_WF10_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF10_TOG(x, v)    (BME_XOR8(HW_LCD_WF10_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF10 bitfields
 */

/*!
 * @name Register LCD_WF10, field BPALCD10[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF10_BPALCD10 (0U)          /*!< Bit position for LCD_WF10_BPALCD10. */
#define BM_LCD_WF10_BPALCD10 (0x01U)       /*!< Bit mask for LCD_WF10_BPALCD10. */
#define BS_LCD_WF10_BPALCD10 (1U)          /*!< Bit field size in bits for LCD_WF10_BPALCD10. */

/*! @brief Read current value of the LCD_WF10_BPALCD10 field. */
#define BR_LCD_WF10_BPALCD10(x) (BME_UBFX8(HW_LCD_WF10_ADDR(x), BP_LCD_WF10_BPALCD10, BS_LCD_WF10_BPALCD10))

/*! @brief Format value for bitfield LCD_WF10_BPALCD10. */
#define BF_LCD_WF10_BPALCD10(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF10_BPALCD10) & BM_LCD_WF10_BPALCD10)

/*! @brief Set the BPALCD10 field to a new value. */
#define BW_LCD_WF10_BPALCD10(x, v) (BME_BFI8(HW_LCD_WF10_ADDR(x), ((uint8_t)(v) << BP_LCD_WF10_BPALCD10), BP_LCD_WF10_BPALCD10, 1))
/*@}*/

/*!
 * @name Register LCD_WF10, field BPBLCD10[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF10_BPBLCD10 (1U)          /*!< Bit position for LCD_WF10_BPBLCD10. */
#define BM_LCD_WF10_BPBLCD10 (0x02U)       /*!< Bit mask for LCD_WF10_BPBLCD10. */
#define BS_LCD_WF10_BPBLCD10 (1U)          /*!< Bit field size in bits for LCD_WF10_BPBLCD10. */

/*! @brief Read current value of the LCD_WF10_BPBLCD10 field. */
#define BR_LCD_WF10_BPBLCD10(x) (BME_UBFX8(HW_LCD_WF10_ADDR(x), BP_LCD_WF10_BPBLCD10, BS_LCD_WF10_BPBLCD10))

/*! @brief Format value for bitfield LCD_WF10_BPBLCD10. */
#define BF_LCD_WF10_BPBLCD10(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF10_BPBLCD10) & BM_LCD_WF10_BPBLCD10)

/*! @brief Set the BPBLCD10 field to a new value. */
#define BW_LCD_WF10_BPBLCD10(x, v) (BME_BFI8(HW_LCD_WF10_ADDR(x), ((uint8_t)(v) << BP_LCD_WF10_BPBLCD10), BP_LCD_WF10_BPBLCD10, 1))
/*@}*/

/*!
 * @name Register LCD_WF10, field BPCLCD10[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF10_BPCLCD10 (2U)          /*!< Bit position for LCD_WF10_BPCLCD10. */
#define BM_LCD_WF10_BPCLCD10 (0x04U)       /*!< Bit mask for LCD_WF10_BPCLCD10. */
#define BS_LCD_WF10_BPCLCD10 (1U)          /*!< Bit field size in bits for LCD_WF10_BPCLCD10. */

/*! @brief Read current value of the LCD_WF10_BPCLCD10 field. */
#define BR_LCD_WF10_BPCLCD10(x) (BME_UBFX8(HW_LCD_WF10_ADDR(x), BP_LCD_WF10_BPCLCD10, BS_LCD_WF10_BPCLCD10))

/*! @brief Format value for bitfield LCD_WF10_BPCLCD10. */
#define BF_LCD_WF10_BPCLCD10(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF10_BPCLCD10) & BM_LCD_WF10_BPCLCD10)

/*! @brief Set the BPCLCD10 field to a new value. */
#define BW_LCD_WF10_BPCLCD10(x, v) (BME_BFI8(HW_LCD_WF10_ADDR(x), ((uint8_t)(v) << BP_LCD_WF10_BPCLCD10), BP_LCD_WF10_BPCLCD10, 1))
/*@}*/

/*!
 * @name Register LCD_WF10, field BPDLCD10[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF10_BPDLCD10 (3U)          /*!< Bit position for LCD_WF10_BPDLCD10. */
#define BM_LCD_WF10_BPDLCD10 (0x08U)       /*!< Bit mask for LCD_WF10_BPDLCD10. */
#define BS_LCD_WF10_BPDLCD10 (1U)          /*!< Bit field size in bits for LCD_WF10_BPDLCD10. */

/*! @brief Read current value of the LCD_WF10_BPDLCD10 field. */
#define BR_LCD_WF10_BPDLCD10(x) (BME_UBFX8(HW_LCD_WF10_ADDR(x), BP_LCD_WF10_BPDLCD10, BS_LCD_WF10_BPDLCD10))

/*! @brief Format value for bitfield LCD_WF10_BPDLCD10. */
#define BF_LCD_WF10_BPDLCD10(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF10_BPDLCD10) & BM_LCD_WF10_BPDLCD10)

/*! @brief Set the BPDLCD10 field to a new value. */
#define BW_LCD_WF10_BPDLCD10(x, v) (BME_BFI8(HW_LCD_WF10_ADDR(x), ((uint8_t)(v) << BP_LCD_WF10_BPDLCD10), BP_LCD_WF10_BPDLCD10, 1))
/*@}*/

/*!
 * @name Register LCD_WF10, field BPELCD10[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF10_BPELCD10 (4U)          /*!< Bit position for LCD_WF10_BPELCD10. */
#define BM_LCD_WF10_BPELCD10 (0x10U)       /*!< Bit mask for LCD_WF10_BPELCD10. */
#define BS_LCD_WF10_BPELCD10 (1U)          /*!< Bit field size in bits for LCD_WF10_BPELCD10. */

