flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Read current value of the LCD_WF10_BPELCD10 field. */
#define BR_LCD_WF10_BPELCD10(x) (BME_UBFX8(HW_LCD_WF10_ADDR(x), BP_LCD_WF10_BPELCD10, BS_LCD_WF10_BPELCD10))

/*! @brief Format value for bitfield LCD_WF10_BPELCD10. */
#define BF_LCD_WF10_BPELCD10(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF10_BPELCD10) & BM_LCD_WF10_BPELCD10)

/*! @brief Set the BPELCD10 field to a new value. */
#define BW_LCD_WF10_BPELCD10(x, v) (BME_BFI8(HW_LCD_WF10_ADDR(x), ((uint8_t)(v) << BP_LCD_WF10_BPELCD10), BP_LCD_WF10_BPELCD10, 1))
/*@}*/

/*!
 * @name Register LCD_WF10, field BPFLCD10[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF10_BPFLCD10 (5U)          /*!< Bit position for LCD_WF10_BPFLCD10. */
#define BM_LCD_WF10_BPFLCD10 (0x20U)       /*!< Bit mask for LCD_WF10_BPFLCD10. */
#define BS_LCD_WF10_BPFLCD10 (1U)          /*!< Bit field size in bits for LCD_WF10_BPFLCD10. */

/*! @brief Read current value of the LCD_WF10_BPFLCD10 field. */
#define BR_LCD_WF10_BPFLCD10(x) (BME_UBFX8(HW_LCD_WF10_ADDR(x), BP_LCD_WF10_BPFLCD10, BS_LCD_WF10_BPFLCD10))

/*! @brief Format value for bitfield LCD_WF10_BPFLCD10. */
#define BF_LCD_WF10_BPFLCD10(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF10_BPFLCD10) & BM_LCD_WF10_BPFLCD10)

/*! @brief Set the BPFLCD10 field to a new value. */
#define BW_LCD_WF10_BPFLCD10(x, v) (BME_BFI8(HW_LCD_WF10_ADDR(x), ((uint8_t)(v) << BP_LCD_WF10_BPFLCD10), BP_LCD_WF10_BPFLCD10, 1))
/*@}*/

/*!
 * @name Register LCD_WF10, field BPGLCD10[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF10_BPGLCD10 (6U)          /*!< Bit position for LCD_WF10_BPGLCD10. */
#define BM_LCD_WF10_BPGLCD10 (0x40U)       /*!< Bit mask for LCD_WF10_BPGLCD10. */
#define BS_LCD_WF10_BPGLCD10 (1U)          /*!< Bit field size in bits for LCD_WF10_BPGLCD10. */

/*! @brief Read current value of the LCD_WF10_BPGLCD10 field. */
#define BR_LCD_WF10_BPGLCD10(x) (BME_UBFX8(HW_LCD_WF10_ADDR(x), BP_LCD_WF10_BPGLCD10, BS_LCD_WF10_BPGLCD10))

/*! @brief Format value for bitfield LCD_WF10_BPGLCD10. */
#define BF_LCD_WF10_BPGLCD10(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF10_BPGLCD10) & BM_LCD_WF10_BPGLCD10)

/*! @brief Set the BPGLCD10 field to a new value. */
#define BW_LCD_WF10_BPGLCD10(x, v) (BME_BFI8(HW_LCD_WF10_ADDR(x), ((uint8_t)(v) << BP_LCD_WF10_BPGLCD10), BP_LCD_WF10_BPGLCD10, 1))
/*@}*/

/*!
 * @name Register LCD_WF10, field BPHLCD10[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF10_BPHLCD10 (7U)          /*!< Bit position for LCD_WF10_BPHLCD10. */
#define BM_LCD_WF10_BPHLCD10 (0x80U)       /*!< Bit mask for LCD_WF10_BPHLCD10. */
#define BS_LCD_WF10_BPHLCD10 (1U)          /*!< Bit field size in bits for LCD_WF10_BPHLCD10. */

/*! @brief Read current value of the LCD_WF10_BPHLCD10 field. */
#define BR_LCD_WF10_BPHLCD10(x) (BME_UBFX8(HW_LCD_WF10_ADDR(x), BP_LCD_WF10_BPHLCD10, BS_LCD_WF10_BPHLCD10))

/*! @brief Format value for bitfield LCD_WF10_BPHLCD10. */
#define BF_LCD_WF10_BPHLCD10(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF10_BPHLCD10) & BM_LCD_WF10_BPHLCD10)

/*! @brief Set the BPHLCD10 field to a new value. */
#define BW_LCD_WF10_BPHLCD10(x, v) (BME_BFI8(HW_LCD_WF10_ADDR(x), ((uint8_t)(v) << BP_LCD_WF10_BPHLCD10), BP_LCD_WF10_BPHLCD10, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF11 - LCD Waveform Register 11.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF11 - LCD Waveform Register 11. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf11
{
    uint8_t U;
    struct _hw_lcd_wf11_bitfields
    {
        uint8_t BPALCD11 : 1;          /*!< [0]  */
        uint8_t BPBLCD11 : 1;          /*!< [1]  */
        uint8_t BPCLCD11 : 1;          /*!< [2]  */
        uint8_t BPDLCD11 : 1;          /*!< [3]  */
        uint8_t BPELCD11 : 1;          /*!< [4]  */
        uint8_t BPFLCD11 : 1;          /*!< [5]  */
        uint8_t BPGLCD11 : 1;          /*!< [6]  */
        uint8_t BPHLCD11 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf11_t;

/*!
 * @name Constants and macros for entire LCD_WF11 register
 */
/*@{*/
#define HW_LCD_WF11_ADDR(x)      ((uint32_t)(x) + 0x2BU)

#define HW_LCD_WF11(x)           (*(__IO hw_lcd_wf11_t *) HW_LCD_WF11_ADDR(x))
#define HW_LCD_WF11_RD(x)        (HW_LCD_WF11(x).U)
#define HW_LCD_WF11_WR(x, v)     (HW_LCD_WF11(x).U = (v))
#define HW_LCD_WF11_SET(x, v)    (BME_OR8(HW_LCD_WF11_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF11_CLR(x, v)    (BME_AND8(HW_LCD_WF11_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF11_TOG(x, v)    (BME_XOR8(HW_LCD_WF11_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF11 bitfields
 */

/*!
 * @name Register LCD_WF11, field BPALCD11[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF11_BPALCD11 (0U)          /*!< Bit position for LCD_WF11_BPALCD11. */
#define BM_LCD_WF11_BPALCD11 (0x01U)       /*!< Bit mask for LCD_WF11_BPALCD11. */
#define BS_LCD_WF11_BPALCD11 (1U)          /*!< Bit field size in bits for LCD_WF11_BPALCD11. */

/*! @brief Read current value of the LCD_WF11_BPALCD11 field. */
#define BR_LCD_WF11_BPALCD11(x) (BME_UBFX8(HW_LCD_WF11_ADDR(x), BP_LCD_WF11_BPALCD11, BS_LCD_WF11_BPALCD11))

/*! @brief Format value for bitfield LCD_WF11_BPALCD11. */
#define BF_LCD_WF11_BPALCD11(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF11_BPALCD11) & BM_LCD_WF11_BPALCD11)

/*! @brief Set the BPALCD11 field to a new value. */
#define BW_LCD_WF11_BPALCD11(x, v) (BME_BFI8(HW_LCD_WF11_ADDR(x), ((uint8_t)(v) << BP_LCD_WF11_BPALCD11), BP_LCD_WF11_BPALCD11, 1))
/*@}*/

/*!
 * @name Register LCD_WF11, field BPBLCD11[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF11_BPBLCD11 (1U)          /*!< Bit position for LCD_WF11_BPBLCD11. */
#define BM_LCD_WF11_BPBLCD11 (0x02U)       /*!< Bit mask for LCD_WF11_BPBLCD11. */
#define BS_LCD_WF11_BPBLCD11 (1U)          /*!< Bit field size in bits for LCD_WF11_BPBLCD11. */

/*! @brief Read current value of the LCD_WF11_BPBLCD11 field. */
#define BR_LCD_WF11_BPBLCD11(x) (BME_UBFX8(HW_LCD_WF11_ADDR(x), BP_LCD_WF11_BPBLCD11, BS_LCD_WF11_BPBLCD11))

/*! @brief Format value for bitfield LCD_WF11_BPBLCD11. */
#define BF_LCD_WF11_BPBLCD11(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF11_BPBLCD11) & BM_LCD_WF11_BPBLCD11)

/*! @brief Set the BPBLCD11 field to a new value. */
#define BW_LCD_WF11_BPBLCD11(x, v) (BME_BFI8(HW_LCD_WF11_ADDR(x), ((uint8_t)(v) << BP_LCD_WF11_BPBLCD11), BP_LCD_WF11_BPBLCD11, 1))
/*@}*/

/*!
 * @name Register LCD_WF11, field BPCLCD11[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF11_BPCLCD11 (2U)          /*!< Bit position for LCD_WF11_BPCLCD11. */
#define BM_LCD_WF11_BPCLCD11 (0x04U)       /*!< Bit mask for LCD_WF11_BPCLCD11. */
#define BS_LCD_WF11_BPCLCD11 (1U)          /*!< Bit field size in bits for LCD_WF11_BPCLCD11. */

/*! @brief Read current value of the LCD_WF11_BPCLCD11 field. */
#define BR_LCD_WF11_BPCLCD11(x) (BME_UBFX8(HW_LCD_WF11_ADDR(x), BP_LCD_WF11_BPCLCD11, BS_LCD_WF11_BPCLCD11))

/*! @brief Format value for bitfield LCD_WF11_BPCLCD11. */
#define BF_LCD_WF11_BPCLCD11(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF11_BPCLCD11) & BM_LCD_WF11_BPCLCD11)

/*! @brief Set the BPCLCD11 field to a new value. */
#define BW_LCD_WF11_BPCLCD11(x, v) (BME_BFI8(HW_LCD_WF11_ADDR(x), ((uint8_t)(v) << BP_LCD_WF11_BPCLCD11), BP_LCD_WF11_BPCLCD11, 1))
/*@}*/

/*!
 * @name Register LCD_WF11, field BPDLCD11[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF11_BPDLCD11 (3U)          /*!< Bit position for LCD_WF11_BPDLCD11. */
#define BM_LCD_WF11_BPDLCD11 (0x08U)       /*!< Bit mask for LCD_WF11_BPDLCD11. */
#define BS_LCD_WF11_BPDLCD11 (1U)          /*!< Bit field size in bits for LCD_WF11_BPDLCD11. */

/*! @brief Read current value of the LCD_WF11_BPDLCD11 field. */
#define BR_LCD_WF11_BPDLCD11(x) (BME_UBFX8(HW_LCD_WF11_ADDR(x), BP_LCD_WF11_BPDLCD11, BS_LCD_WF11_BPDLCD11))

/*! @brief Format value for bitfield LCD_WF11_BPDLCD11. */
#define BF_LCD_WF11_BPDLCD11(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF11_BPDLCD11) & BM_LCD_WF11_BPDLCD11)

/*! @brief Set the BPDLCD11 field to a new value. */
#define BW_LCD_WF11_BPDLCD11(x, v) (BME_BFI8(HW_LCD_WF11_ADDR(x), ((uint8_t)(v) << BP_LCD_WF11_BPDLCD11), BP_LCD_WF11_BPDLCD11, 1))
/*@}*/

/*!
 * @name Register LCD_WF11, field BPELCD11[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF11_BPELCD11 (4U)          /*!< Bit position for LCD_WF11_BPELCD11. */
#define BM_LCD_WF11_BPELCD11 (0x10U)       /*!< Bit mask for LCD_WF11_BPELCD11. */
#define BS_LCD_WF11_BPELCD11 (1U)          /*!< Bit field size in bits for LCD_WF11_BPELCD11. */

/*! @brief Read current value of the LCD_WF11_BPELCD11 field. */
#define BR_LCD_WF11_BPELCD11(x) (BME_UBFX8(HW_LCD_WF11_ADDR(x), BP_LCD_WF11_BPELCD11, BS_LCD_WF11_BPELCD11))

