flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Read current value of the LCD_WF12_BPBLCD12 field. */
#define BR_LCD_WF12_BPBLCD12(x) (BME_UBFX8(HW_LCD_WF12_ADDR(x), BP_LCD_WF12_BPBLCD12, BS_LCD_WF12_BPBLCD12))

/*! @brief Format value for bitfield LCD_WF12_BPBLCD12. */
#define BF_LCD_WF12_BPBLCD12(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF12_BPBLCD12) & BM_LCD_WF12_BPBLCD12)

/*! @brief Set the BPBLCD12 field to a new value. */
#define BW_LCD_WF12_BPBLCD12(x, v) (BME_BFI8(HW_LCD_WF12_ADDR(x), ((uint8_t)(v) << BP_LCD_WF12_BPBLCD12), BP_LCD_WF12_BPBLCD12, 1))
/*@}*/

/*!
 * @name Register LCD_WF12, field BPCLCD12[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF12_BPCLCD12 (2U)          /*!< Bit position for LCD_WF12_BPCLCD12. */
#define BM_LCD_WF12_BPCLCD12 (0x04U)       /*!< Bit mask for LCD_WF12_BPCLCD12. */
#define BS_LCD_WF12_BPCLCD12 (1U)          /*!< Bit field size in bits for LCD_WF12_BPCLCD12. */

/*! @brief Read current value of the LCD_WF12_BPCLCD12 field. */
#define BR_LCD_WF12_BPCLCD12(x) (BME_UBFX8(HW_LCD_WF12_ADDR(x), BP_LCD_WF12_BPCLCD12, BS_LCD_WF12_BPCLCD12))

/*! @brief Format value for bitfield LCD_WF12_BPCLCD12. */
#define BF_LCD_WF12_BPCLCD12(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF12_BPCLCD12) & BM_LCD_WF12_BPCLCD12)

/*! @brief Set the BPCLCD12 field to a new value. */
#define BW_LCD_WF12_BPCLCD12(x, v) (BME_BFI8(HW_LCD_WF12_ADDR(x), ((uint8_t)(v) << BP_LCD_WF12_BPCLCD12), BP_LCD_WF12_BPCLCD12, 1))
/*@}*/

/*!
 * @name Register LCD_WF12, field BPDLCD12[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF12_BPDLCD12 (3U)          /*!< Bit position for LCD_WF12_BPDLCD12. */
#define BM_LCD_WF12_BPDLCD12 (0x08U)       /*!< Bit mask for LCD_WF12_BPDLCD12. */
#define BS_LCD_WF12_BPDLCD12 (1U)          /*!< Bit field size in bits for LCD_WF12_BPDLCD12. */

/*! @brief Read current value of the LCD_WF12_BPDLCD12 field. */
#define BR_LCD_WF12_BPDLCD12(x) (BME_UBFX8(HW_LCD_WF12_ADDR(x), BP_LCD_WF12_BPDLCD12, BS_LCD_WF12_BPDLCD12))

/*! @brief Format value for bitfield LCD_WF12_BPDLCD12. */
#define BF_LCD_WF12_BPDLCD12(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF12_BPDLCD12) & BM_LCD_WF12_BPDLCD12)

/*! @brief Set the BPDLCD12 field to a new value. */
#define BW_LCD_WF12_BPDLCD12(x, v) (BME_BFI8(HW_LCD_WF12_ADDR(x), ((uint8_t)(v) << BP_LCD_WF12_BPDLCD12), BP_LCD_WF12_BPDLCD12, 1))
/*@}*/

/*!
 * @name Register LCD_WF12, field BPELCD12[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF12_BPELCD12 (4U)          /*!< Bit position for LCD_WF12_BPELCD12. */
#define BM_LCD_WF12_BPELCD12 (0x10U)       /*!< Bit mask for LCD_WF12_BPELCD12. */
#define BS_LCD_WF12_BPELCD12 (1U)          /*!< Bit field size in bits for LCD_WF12_BPELCD12. */

/*! @brief Read current value of the LCD_WF12_BPELCD12 field. */
#define BR_LCD_WF12_BPELCD12(x) (BME_UBFX8(HW_LCD_WF12_ADDR(x), BP_LCD_WF12_BPELCD12, BS_LCD_WF12_BPELCD12))

/*! @brief Format value for bitfield LCD_WF12_BPELCD12. */
#define BF_LCD_WF12_BPELCD12(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF12_BPELCD12) & BM_LCD_WF12_BPELCD12)

/*! @brief Set the BPELCD12 field to a new value. */
#define BW_LCD_WF12_BPELCD12(x, v) (BME_BFI8(HW_LCD_WF12_ADDR(x), ((uint8_t)(v) << BP_LCD_WF12_BPELCD12), BP_LCD_WF12_BPELCD12, 1))
/*@}*/

/*!
 * @name Register LCD_WF12, field BPFLCD12[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF12_BPFLCD12 (5U)          /*!< Bit position for LCD_WF12_BPFLCD12. */
#define BM_LCD_WF12_BPFLCD12 (0x20U)       /*!< Bit mask for LCD_WF12_BPFLCD12. */
#define BS_LCD_WF12_BPFLCD12 (1U)          /*!< Bit field size in bits for LCD_WF12_BPFLCD12. */

/*! @brief Read current value of the LCD_WF12_BPFLCD12 field. */
#define BR_LCD_WF12_BPFLCD12(x) (BME_UBFX8(HW_LCD_WF12_ADDR(x), BP_LCD_WF12_BPFLCD12, BS_LCD_WF12_BPFLCD12))

/*! @brief Format value for bitfield LCD_WF12_BPFLCD12. */
#define BF_LCD_WF12_BPFLCD12(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF12_BPFLCD12) & BM_LCD_WF12_BPFLCD12)

/*! @brief Set the BPFLCD12 field to a new value. */
#define BW_LCD_WF12_BPFLCD12(x, v) (BME_BFI8(HW_LCD_WF12_ADDR(x), ((uint8_t)(v) << BP_LCD_WF12_BPFLCD12), BP_LCD_WF12_BPFLCD12, 1))
/*@}*/

/*!
 * @name Register LCD_WF12, field BPGLCD12[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF12_BPGLCD12 (6U)          /*!< Bit position for LCD_WF12_BPGLCD12. */
#define BM_LCD_WF12_BPGLCD12 (0x40U)       /*!< Bit mask for LCD_WF12_BPGLCD12. */
#define BS_LCD_WF12_BPGLCD12 (1U)          /*!< Bit field size in bits for LCD_WF12_BPGLCD12. */

/*! @brief Read current value of the LCD_WF12_BPGLCD12 field. */
#define BR_LCD_WF12_BPGLCD12(x) (BME_UBFX8(HW_LCD_WF12_ADDR(x), BP_LCD_WF12_BPGLCD12, BS_LCD_WF12_BPGLCD12))

/*! @brief Format value for bitfield LCD_WF12_BPGLCD12. */
#define BF_LCD_WF12_BPGLCD12(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF12_BPGLCD12) & BM_LCD_WF12_BPGLCD12)

/*! @brief Set the BPGLCD12 field to a new value. */
#define BW_LCD_WF12_BPGLCD12(x, v) (BME_BFI8(HW_LCD_WF12_ADDR(x), ((uint8_t)(v) << BP_LCD_WF12_BPGLCD12), BP_LCD_WF12_BPGLCD12, 1))
/*@}*/

/*!
 * @name Register LCD_WF12, field BPHLCD12[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF12_BPHLCD12 (7U)          /*!< Bit position for LCD_WF12_BPHLCD12. */
#define BM_LCD_WF12_BPHLCD12 (0x80U)       /*!< Bit mask for LCD_WF12_BPHLCD12. */
#define BS_LCD_WF12_BPHLCD12 (1U)          /*!< Bit field size in bits for LCD_WF12_BPHLCD12. */

