flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Read current value of the LCD_WF15_BPBLCD15 field. */
#define BR_LCD_WF15_BPBLCD15(x) (BME_UBFX8(HW_LCD_WF15_ADDR(x), BP_LCD_WF15_BPBLCD15, BS_LCD_WF15_BPBLCD15))

/*! @brief Format value for bitfield LCD_WF15_BPBLCD15. */
#define BF_LCD_WF15_BPBLCD15(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF15_BPBLCD15) & BM_LCD_WF15_BPBLCD15)

/*! @brief Set the BPBLCD15 field to a new value. */
#define BW_LCD_WF15_BPBLCD15(x, v) (BME_BFI8(HW_LCD_WF15_ADDR(x), ((uint8_t)(v) << BP_LCD_WF15_BPBLCD15), BP_LCD_WF15_BPBLCD15, 1))
/*@}*/

/*!
 * @name Register LCD_WF15, field BPCLCD15[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF15_BPCLCD15 (2U)          /*!< Bit position for LCD_WF15_BPCLCD15. */
#define BM_LCD_WF15_BPCLCD15 (0x04U)       /*!< Bit mask for LCD_WF15_BPCLCD15. */
#define BS_LCD_WF15_BPCLCD15 (1U)          /*!< Bit field size in bits for LCD_WF15_BPCLCD15. */

/*! @brief Read current value of the LCD_WF15_BPCLCD15 field. */
#define BR_LCD_WF15_BPCLCD15(x) (BME_UBFX8(HW_LCD_WF15_ADDR(x), BP_LCD_WF15_BPCLCD15, BS_LCD_WF15_BPCLCD15))

/*! @brief Format value for bitfield LCD_WF15_BPCLCD15. */
#define BF_LCD_WF15_BPCLCD15(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF15_BPCLCD15) & BM_LCD_WF15_BPCLCD15)

/*! @brief Set the BPCLCD15 field to a new value. */
#define BW_LCD_WF15_BPCLCD15(x, v) (BME_BFI8(HW_LCD_WF15_ADDR(x), ((uint8_t)(v) << BP_LCD_WF15_BPCLCD15), BP_LCD_WF15_BPCLCD15, 1))
/*@}*/

/*!
 * @name Register LCD_WF15, field BPDLCD15[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF15_BPDLCD15 (3U)          /*!< Bit position for LCD_WF15_BPDLCD15. */
#define BM_LCD_WF15_BPDLCD15 (0x08U)       /*!< Bit mask for LCD_WF15_BPDLCD15. */
#define BS_LCD_WF15_BPDLCD15 (1U)          /*!< Bit field size in bits for LCD_WF15_BPDLCD15. */

/*! @brief Read current value of the LCD_WF15_BPDLCD15 field. */
#define BR_LCD_WF15_BPDLCD15(x) (BME_UBFX8(HW_LCD_WF15_ADDR(x), BP_LCD_WF15_BPDLCD15, BS_LCD_WF15_BPDLCD15))

/*! @brief Format value for bitfield LCD_WF15_BPDLCD15. */
#define BF_LCD_WF15_BPDLCD15(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF15_BPDLCD15) & BM_LCD_WF15_BPDLCD15)

/*! @brief Set the BPDLCD15 field to a new value. */
#define BW_LCD_WF15_BPDLCD15(x, v) (BME_BFI8(HW_LCD_WF15_ADDR(x), ((uint8_t)(v) << BP_LCD_WF15_BPDLCD15), BP_LCD_WF15_BPDLCD15, 1))
/*@}*/

/*!
 * @name Register LCD_WF15, field BPELCD15[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF15_BPELCD15 (4U)          /*!< Bit position for LCD_WF15_BPELCD15. */
#define BM_LCD_WF15_BPELCD15 (0x10U)       /*!< Bit mask for LCD_WF15_BPELCD15. */
#define BS_LCD_WF15_BPELCD15 (1U)          /*!< Bit field size in bits for LCD_WF15_BPELCD15. */

/*! @brief Read current value of the LCD_WF15_BPELCD15 field. */
#define BR_LCD_WF15_BPELCD15(x) (BME_UBFX8(HW_LCD_WF15_ADDR(x), BP_LCD_WF15_BPELCD15, BS_LCD_WF15_BPELCD15))

/*! @brief Format value for bitfield LCD_WF15_BPELCD15. */
#define BF_LCD_WF15_BPELCD15(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF15_BPELCD15) & BM_LCD_WF15_BPELCD15)

/*! @brief Set the BPELCD15 field to a new value. */
#define BW_LCD_WF15_BPELCD15(x, v) (BME_BFI8(HW_LCD_WF15_ADDR(x), ((uint8_t)(v) << BP_LCD_WF15_BPELCD15), BP_LCD_WF15_BPELCD15, 1))
/*@}*/

/*!
 * @name Register LCD_WF15, field BPFLCD15[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF15_BPFLCD15 (5U)          /*!< Bit position for LCD_WF15_BPFLCD15. */
#define BM_LCD_WF15_BPFLCD15 (0x20U)       /*!< Bit mask for LCD_WF15_BPFLCD15. */
#define BS_LCD_WF15_BPFLCD15 (1U)          /*!< Bit field size in bits for LCD_WF15_BPFLCD15. */

/*! @brief Read current value of the LCD_WF15_BPFLCD15 field. */
#define BR_LCD_WF15_BPFLCD15(x) (BME_UBFX8(HW_LCD_WF15_ADDR(x), BP_LCD_WF15_BPFLCD15, BS_LCD_WF15_BPFLCD15))

/*! @brief Format value for bitfield LCD_WF15_BPFLCD15. */
#define BF_LCD_WF15_BPFLCD15(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF15_BPFLCD15) & BM_LCD_WF15_BPFLCD15)

/*! @brief Set the BPFLCD15 field to a new value. */
#define BW_LCD_WF15_BPFLCD15(x, v) (BME_BFI8(HW_LCD_WF15_ADDR(x), ((uint8_t)(v) << BP_LCD_WF15_BPFLCD15), BP_LCD_WF15_BPFLCD15, 1))
/*@}*/

/*!
 * @name Register LCD_WF15, field BPGLCD15[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF15_BPGLCD15 (6U)          /*!< Bit position for LCD_WF15_BPGLCD15. */
#define BM_LCD_WF15_BPGLCD15 (0x40U)       /*!< Bit mask for LCD_WF15_BPGLCD15. */
#define BS_LCD_WF15_BPGLCD15 (1U)          /*!< Bit field size in bits for LCD_WF15_BPGLCD15. */

/*! @brief Read current value of the LCD_WF15_BPGLCD15 field. */
#define BR_LCD_WF15_BPGLCD15(x) (BME_UBFX8(HW_LCD_WF15_ADDR(x), BP_LCD_WF15_BPGLCD15, BS_LCD_WF15_BPGLCD15))

/*! @brief Format value for bitfield LCD_WF15_BPGLCD15. */
#define BF_LCD_WF15_BPGLCD15(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF15_BPGLCD15) & BM_LCD_WF15_BPGLCD15)

/*! @brief Set the BPGLCD15 field to a new value. */
#define BW_LCD_WF15_BPGLCD15(x, v) (BME_BFI8(HW_LCD_WF15_ADDR(x), ((uint8_t)(v) << BP_LCD_WF15_BPGLCD15), BP_LCD_WF15_BPGLCD15, 1))
/*@}*/

/*!
 * @name Register LCD_WF15, field BPHLCD15[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF15_BPHLCD15 (7U)          /*!< Bit position for LCD_WF15_BPHLCD15. */
#define BM_LCD_WF15_BPHLCD15 (0x80U)       /*!< Bit mask for LCD_WF15_BPHLCD15. */
#define BS_LCD_WF15_BPHLCD15 (1U)          /*!< Bit field size in bits for LCD_WF15_BPHLCD15. */

