flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Read current value of the LCD_WF17_BPCLCD17 field. */
#define BR_LCD_WF17_BPCLCD17(x) (BME_UBFX8(HW_LCD_WF17_ADDR(x), BP_LCD_WF17_BPCLCD17, BS_LCD_WF17_BPCLCD17))

/*! @brief Format value for bitfield LCD_WF17_BPCLCD17. */
#define BF_LCD_WF17_BPCLCD17(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF17_BPCLCD17) & BM_LCD_WF17_BPCLCD17)

/*! @brief Set the BPCLCD17 field to a new value. */
#define BW_LCD_WF17_BPCLCD17(x, v) (BME_BFI8(HW_LCD_WF17_ADDR(x), ((uint8_t)(v) << BP_LCD_WF17_BPCLCD17), BP_LCD_WF17_BPCLCD17, 1))
/*@}*/

/*!
 * @name Register LCD_WF17, field BPDLCD17[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF17_BPDLCD17 (3U)          /*!< Bit position for LCD_WF17_BPDLCD17. */
#define BM_LCD_WF17_BPDLCD17 (0x08U)       /*!< Bit mask for LCD_WF17_BPDLCD17. */
#define BS_LCD_WF17_BPDLCD17 (1U)          /*!< Bit field size in bits for LCD_WF17_BPDLCD17. */

/*! @brief Read current value of the LCD_WF17_BPDLCD17 field. */
#define BR_LCD_WF17_BPDLCD17(x) (BME_UBFX8(HW_LCD_WF17_ADDR(x), BP_LCD_WF17_BPDLCD17, BS_LCD_WF17_BPDLCD17))

/*! @brief Format value for bitfield LCD_WF17_BPDLCD17. */
#define BF_LCD_WF17_BPDLCD17(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF17_BPDLCD17) & BM_LCD_WF17_BPDLCD17)

/*! @brief Set the BPDLCD17 field to a new value. */
#define BW_LCD_WF17_BPDLCD17(x, v) (BME_BFI8(HW_LCD_WF17_ADDR(x), ((uint8_t)(v) << BP_LCD_WF17_BPDLCD17), BP_LCD_WF17_BPDLCD17, 1))
/*@}*/

/*!
 * @name Register LCD_WF17, field BPELCD17[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF17_BPELCD17 (4U)          /*!< Bit position for LCD_WF17_BPELCD17. */
#define BM_LCD_WF17_BPELCD17 (0x10U)       /*!< Bit mask for LCD_WF17_BPELCD17. */
#define BS_LCD_WF17_BPELCD17 (1U)          /*!< Bit field size in bits for LCD_WF17_BPELCD17. */

/*! @brief Read current value of the LCD_WF17_BPELCD17 field. */
#define BR_LCD_WF17_BPELCD17(x) (BME_UBFX8(HW_LCD_WF17_ADDR(x), BP_LCD_WF17_BPELCD17, BS_LCD_WF17_BPELCD17))

/*! @brief Format value for bitfield LCD_WF17_BPELCD17. */
#define BF_LCD_WF17_BPELCD17(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF17_BPELCD17) & BM_LCD_WF17_BPELCD17)

/*! @brief Set the BPELCD17 field to a new value. */
#define BW_LCD_WF17_BPELCD17(x, v) (BME_BFI8(HW_LCD_WF17_ADDR(x), ((uint8_t)(v) << BP_LCD_WF17_BPELCD17), BP_LCD_WF17_BPELCD17, 1))
/*@}*/

/*!
 * @name Register LCD_WF17, field BPFLCD17[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF17_BPFLCD17 (5U)          /*!< Bit position for LCD_WF17_BPFLCD17. */
#define BM_LCD_WF17_BPFLCD17 (0x20U)       /*!< Bit mask for LCD_WF17_BPFLCD17. */
#define BS_LCD_WF17_BPFLCD17 (1U)          /*!< Bit field size in bits for LCD_WF17_BPFLCD17. */

/*! @brief Read current value of the LCD_WF17_BPFLCD17 field. */
#define BR_LCD_WF17_BPFLCD17(x) (BME_UBFX8(HW_LCD_WF17_ADDR(x), BP_LCD_WF17_BPFLCD17, BS_LCD_WF17_BPFLCD17))

/*! @brief Format value for bitfield LCD_WF17_BPFLCD17. */
#define BF_LCD_WF17_BPFLCD17(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF17_BPFLCD17) & BM_LCD_WF17_BPFLCD17)

/*! @brief Set the BPFLCD17 field to a new value. */
#define BW_LCD_WF17_BPFLCD17(x, v) (BME_BFI8(HW_LCD_WF17_ADDR(x), ((uint8_t)(v) << BP_LCD_WF17_BPFLCD17), BP_LCD_WF17_BPFLCD17, 1))
/*@}*/

/*!
 * @name Register LCD_WF17, field BPGLCD17[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF17_BPGLCD17 (6U)          /*!< Bit position for LCD_WF17_BPGLCD17. */
#define BM_LCD_WF17_BPGLCD17 (0x40U)       /*!< Bit mask for LCD_WF17_BPGLCD17. */
#define BS_LCD_WF17_BPGLCD17 (1U)          /*!< Bit field size in bits for LCD_WF17_BPGLCD17. */

/*! @brief Read current value of the LCD_WF17_BPGLCD17 field. */
#define BR_LCD_WF17_BPGLCD17(x) (BME_UBFX8(HW_LCD_WF17_ADDR(x), BP_LCD_WF17_BPGLCD17, BS_LCD_WF17_BPGLCD17))

/*! @brief Format value for bitfield LCD_WF17_BPGLCD17. */
#define BF_LCD_WF17_BPGLCD17(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF17_BPGLCD17) & BM_LCD_WF17_BPGLCD17)

/*! @brief Set the BPGLCD17 field to a new value. */
#define BW_LCD_WF17_BPGLCD17(x, v) (BME_BFI8(HW_LCD_WF17_ADDR(x), ((uint8_t)(v) << BP_LCD_WF17_BPGLCD17), BP_LCD_WF17_BPGLCD17, 1))
/*@}*/

/*!
 * @name Register LCD_WF17, field BPHLCD17[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF17_BPHLCD17 (7U)          /*!< Bit position for LCD_WF17_BPHLCD17. */
#define BM_LCD_WF17_BPHLCD17 (0x80U)       /*!< Bit mask for LCD_WF17_BPHLCD17. */
#define BS_LCD_WF17_BPHLCD17 (1U)          /*!< Bit field size in bits for LCD_WF17_BPHLCD17. */

/*! @brief Read current value of the LCD_WF17_BPHLCD17 field. */
#define BR_LCD_WF17_BPHLCD17(x) (BME_UBFX8(HW_LCD_WF17_ADDR(x), BP_LCD_WF17_BPHLCD17, BS_LCD_WF17_BPHLCD17))

/*! @brief Format value for bitfield LCD_WF17_BPHLCD17. */
#define BF_LCD_WF17_BPHLCD17(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF17_BPHLCD17) & BM_LCD_WF17_BPHLCD17)

/*! @brief Set the BPHLCD17 field to a new value. */
#define BW_LCD_WF17_BPHLCD17(x, v) (BME_BFI8(HW_LCD_WF17_ADDR(x), ((uint8_t)(v) << BP_LCD_WF17_BPHLCD17), BP_LCD_WF17_BPHLCD17, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF18 - LCD Waveform Register 18.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF18 - LCD Waveform Register 18. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf18
{
    uint8_t U;
    struct _hw_lcd_wf18_bitfields
    {
        uint8_t BPALCD18 : 1;          /*!< [0]  */
        uint8_t BPBLCD18 : 1;          /*!< [1]  */
        uint8_t BPCLCD18 : 1;          /*!< [2]  */
        uint8_t BPDLCD18 : 1;          /*!< [3]  */
        uint8_t BPELCD18 : 1;          /*!< [4]  */
        uint8_t BPFLCD18 : 1;          /*!< [5]  */
        uint8_t BPGLCD18 : 1;          /*!< [6]  */
        uint8_t BPHLCD18 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf18_t;

/*!
 * @name Constants and macros for entire LCD_WF18 register
 */
/*@{*/
#define HW_LCD_WF18_ADDR(x)      ((uint32_t)(x) + 0x32U)

#define HW_LCD_WF18(x)           (*(__IO hw_lcd_wf18_t *) HW_LCD_WF18_ADDR(x))
#define HW_LCD_WF18_RD(x)        (HW_LCD_WF18(x).U)
#define HW_LCD_WF18_WR(x, v)     (HW_LCD_WF18(x).U = (v))
#define HW_LCD_WF18_SET(x, v)    (BME_OR8(HW_LCD_WF18_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF18_CLR(x, v)    (BME_AND8(HW_LCD_WF18_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF18_TOG(x, v)    (BME_XOR8(HW_LCD_WF18_ADDR(x), (uint8_t)(v)))
/*@}*/

