flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Read current value of the LCD_WF18_BPGLCD18 field. */
#define BR_LCD_WF18_BPGLCD18(x) (BME_UBFX8(HW_LCD_WF18_ADDR(x), BP_LCD_WF18_BPGLCD18, BS_LCD_WF18_BPGLCD18))

/*! @brief Format value for bitfield LCD_WF18_BPGLCD18. */
#define BF_LCD_WF18_BPGLCD18(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF18_BPGLCD18) & BM_LCD_WF18_BPGLCD18)

/*! @brief Set the BPGLCD18 field to a new value. */
#define BW_LCD_WF18_BPGLCD18(x, v) (BME_BFI8(HW_LCD_WF18_ADDR(x), ((uint8_t)(v) << BP_LCD_WF18_BPGLCD18), BP_LCD_WF18_BPGLCD18, 1))
/*@}*/

/*!
 * @name Register LCD_WF18, field BPHLCD18[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF18_BPHLCD18 (7U)          /*!< Bit position for LCD_WF18_BPHLCD18. */
#define BM_LCD_WF18_BPHLCD18 (0x80U)       /*!< Bit mask for LCD_WF18_BPHLCD18. */
#define BS_LCD_WF18_BPHLCD18 (1U)          /*!< Bit field size in bits for LCD_WF18_BPHLCD18. */

/*! @brief Read current value of the LCD_WF18_BPHLCD18 field. */
#define BR_LCD_WF18_BPHLCD18(x) (BME_UBFX8(HW_LCD_WF18_ADDR(x), BP_LCD_WF18_BPHLCD18, BS_LCD_WF18_BPHLCD18))

/*! @brief Format value for bitfield LCD_WF18_BPHLCD18. */
#define BF_LCD_WF18_BPHLCD18(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF18_BPHLCD18) & BM_LCD_WF18_BPHLCD18)

/*! @brief Set the BPHLCD18 field to a new value. */
#define BW_LCD_WF18_BPHLCD18(x, v) (BME_BFI8(HW_LCD_WF18_ADDR(x), ((uint8_t)(v) << BP_LCD_WF18_BPHLCD18), BP_LCD_WF18_BPHLCD18, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF19 - LCD Waveform Register 19.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF19 - LCD Waveform Register 19. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf19
{
    uint8_t U;
    struct _hw_lcd_wf19_bitfields
    {
        uint8_t BPALCD19 : 1;          /*!< [0]  */
        uint8_t BPBLCD19 : 1;          /*!< [1]  */
        uint8_t BPCLCD19 : 1;          /*!< [2]  */
        uint8_t BPDLCD19 : 1;          /*!< [3]  */
        uint8_t BPELCD19 : 1;          /*!< [4]  */
        uint8_t BPFLCD19 : 1;          /*!< [5]  */
        uint8_t BPGLCD19 : 1;          /*!< [6]  */
        uint8_t BPHLCD19 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf19_t;

/*!
 * @name Constants and macros for entire LCD_WF19 register
 */
/*@{*/
#define HW_LCD_WF19_ADDR(x)      ((uint32_t)(x) + 0x33U)

#define HW_LCD_WF19(x)           (*(__IO hw_lcd_wf19_t *) HW_LCD_WF19_ADDR(x))
#define HW_LCD_WF19_RD(x)        (HW_LCD_WF19(x).U)
#define HW_LCD_WF19_WR(x, v)     (HW_LCD_WF19(x).U = (v))
#define HW_LCD_WF19_SET(x, v)    (BME_OR8(HW_LCD_WF19_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF19_CLR(x, v)    (BME_AND8(HW_LCD_WF19_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF19_TOG(x, v)    (BME_XOR8(HW_LCD_WF19_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF19 bitfields
 */

/*!
 * @name Register LCD_WF19, field BPALCD19[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF19_BPALCD19 (0U)          /*!< Bit position for LCD_WF19_BPALCD19. */
#define BM_LCD_WF19_BPALCD19 (0x01U)       /*!< Bit mask for LCD_WF19_BPALCD19. */
#define BS_LCD_WF19_BPALCD19 (1U)          /*!< Bit field size in bits for LCD_WF19_BPALCD19. */

/*! @brief Read current value of the LCD_WF19_BPALCD19 field. */
#define BR_LCD_WF19_BPALCD19(x) (BME_UBFX8(HW_LCD_WF19_ADDR(x), BP_LCD_WF19_BPALCD19, BS_LCD_WF19_BPALCD19))

/*! @brief Format value for bitfield LCD_WF19_BPALCD19. */
#define BF_LCD_WF19_BPALCD19(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF19_BPALCD19) & BM_LCD_WF19_BPALCD19)

/*! @brief Set the BPALCD19 field to a new value. */
#define BW_LCD_WF19_BPALCD19(x, v) (BME_BFI8(HW_LCD_WF19_ADDR(x), ((uint8_t)(v) << BP_LCD_WF19_BPALCD19), BP_LCD_WF19_BPALCD19, 1))
/*@}*/

/*!
 * @name Register LCD_WF19, field BPBLCD19[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF19_BPBLCD19 (1U)          /*!< Bit position for LCD_WF19_BPBLCD19. */
#define BM_LCD_WF19_BPBLCD19 (0x02U)       /*!< Bit mask for LCD_WF19_BPBLCD19. */
#define BS_LCD_WF19_BPBLCD19 (1U)          /*!< Bit field size in bits for LCD_WF19_BPBLCD19. */

/*! @brief Read current value of the LCD_WF19_BPBLCD19 field. */
#define BR_LCD_WF19_BPBLCD19(x) (BME_UBFX8(HW_LCD_WF19_ADDR(x), BP_LCD_WF19_BPBLCD19, BS_LCD_WF19_BPBLCD19))

/*! @brief Format value for bitfield LCD_WF19_BPBLCD19. */
#define BF_LCD_WF19_BPBLCD19(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF19_BPBLCD19) & BM_LCD_WF19_BPBLCD19)

/*! @brief Set the BPBLCD19 field to a new value. */
#define BW_LCD_WF19_BPBLCD19(x, v) (BME_BFI8(HW_LCD_WF19_ADDR(x), ((uint8_t)(v) << BP_LCD_WF19_BPBLCD19), BP_LCD_WF19_BPBLCD19, 1))
/*@}*/

/*!
 * @name Register LCD_WF19, field BPCLCD19[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF19_BPCLCD19 (2U)          /*!< Bit position for LCD_WF19_BPCLCD19. */
#define BM_LCD_WF19_BPCLCD19 (0x04U)       /*!< Bit mask for LCD_WF19_BPCLCD19. */
#define BS_LCD_WF19_BPCLCD19 (1U)          /*!< Bit field size in bits for LCD_WF19_BPCLCD19. */

/*! @brief Read current value of the LCD_WF19_BPCLCD19 field. */
#define BR_LCD_WF19_BPCLCD19(x) (BME_UBFX8(HW_LCD_WF19_ADDR(x), BP_LCD_WF19_BPCLCD19, BS_LCD_WF19_BPCLCD19))

/*! @brief Format value for bitfield LCD_WF19_BPCLCD19. */
#define BF_LCD_WF19_BPCLCD19(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF19_BPCLCD19) & BM_LCD_WF19_BPCLCD19)

/*! @brief Set the BPCLCD19 field to a new value. */
#define BW_LCD_WF19_BPCLCD19(x, v) (BME_BFI8(HW_LCD_WF19_ADDR(x), ((uint8_t)(v) << BP_LCD_WF19_BPCLCD19), BP_LCD_WF19_BPCLCD19, 1))
/*@}*/

/*!
 * @name Register LCD_WF19, field BPDLCD19[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF19_BPDLCD19 (3U)          /*!< Bit position for LCD_WF19_BPDLCD19. */
#define BM_LCD_WF19_BPDLCD19 (0x08U)       /*!< Bit mask for LCD_WF19_BPDLCD19. */
#define BS_LCD_WF19_BPDLCD19 (1U)          /*!< Bit field size in bits for LCD_WF19_BPDLCD19. */

