flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Read current value of the LCD_WF20_BPALCD20 field. */
#define BR_LCD_WF20_BPALCD20(x) (BME_UBFX8(HW_LCD_WF20_ADDR(x), BP_LCD_WF20_BPALCD20, BS_LCD_WF20_BPALCD20))

/*! @brief Format value for bitfield LCD_WF20_BPALCD20. */
#define BF_LCD_WF20_BPALCD20(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF20_BPALCD20) & BM_LCD_WF20_BPALCD20)

/*! @brief Set the BPALCD20 field to a new value. */
#define BW_LCD_WF20_BPALCD20(x, v) (BME_BFI8(HW_LCD_WF20_ADDR(x), ((uint8_t)(v) << BP_LCD_WF20_BPALCD20), BP_LCD_WF20_BPALCD20, 1))
/*@}*/

/*!
 * @name Register LCD_WF20, field BPBLCD20[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF20_BPBLCD20 (1U)          /*!< Bit position for LCD_WF20_BPBLCD20. */
#define BM_LCD_WF20_BPBLCD20 (0x02U)       /*!< Bit mask for LCD_WF20_BPBLCD20. */
#define BS_LCD_WF20_BPBLCD20 (1U)          /*!< Bit field size in bits for LCD_WF20_BPBLCD20. */

/*! @brief Read current value of the LCD_WF20_BPBLCD20 field. */
#define BR_LCD_WF20_BPBLCD20(x) (BME_UBFX8(HW_LCD_WF20_ADDR(x), BP_LCD_WF20_BPBLCD20, BS_LCD_WF20_BPBLCD20))

/*! @brief Format value for bitfield LCD_WF20_BPBLCD20. */
#define BF_LCD_WF20_BPBLCD20(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF20_BPBLCD20) & BM_LCD_WF20_BPBLCD20)

/*! @brief Set the BPBLCD20 field to a new value. */
#define BW_LCD_WF20_BPBLCD20(x, v) (BME_BFI8(HW_LCD_WF20_ADDR(x), ((uint8_t)(v) << BP_LCD_WF20_BPBLCD20), BP_LCD_WF20_BPBLCD20, 1))
/*@}*/

/*!
 * @name Register LCD_WF20, field BPCLCD20[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF20_BPCLCD20 (2U)          /*!< Bit position for LCD_WF20_BPCLCD20. */
#define BM_LCD_WF20_BPCLCD20 (0x04U)       /*!< Bit mask for LCD_WF20_BPCLCD20. */
#define BS_LCD_WF20_BPCLCD20 (1U)          /*!< Bit field size in bits for LCD_WF20_BPCLCD20. */

/*! @brief Read current value of the LCD_WF20_BPCLCD20 field. */
#define BR_LCD_WF20_BPCLCD20(x) (BME_UBFX8(HW_LCD_WF20_ADDR(x), BP_LCD_WF20_BPCLCD20, BS_LCD_WF20_BPCLCD20))

/*! @brief Format value for bitfield LCD_WF20_BPCLCD20. */
#define BF_LCD_WF20_BPCLCD20(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF20_BPCLCD20) & BM_LCD_WF20_BPCLCD20)

/*! @brief Set the BPCLCD20 field to a new value. */
#define BW_LCD_WF20_BPCLCD20(x, v) (BME_BFI8(HW_LCD_WF20_ADDR(x), ((uint8_t)(v) << BP_LCD_WF20_BPCLCD20), BP_LCD_WF20_BPCLCD20, 1))
/*@}*/

/*!
 * @name Register LCD_WF20, field BPDLCD20[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF20_BPDLCD20 (3U)          /*!< Bit position for LCD_WF20_BPDLCD20. */
#define BM_LCD_WF20_BPDLCD20 (0x08U)       /*!< Bit mask for LCD_WF20_BPDLCD20. */
#define BS_LCD_WF20_BPDLCD20 (1U)          /*!< Bit field size in bits for LCD_WF20_BPDLCD20. */

/*! @brief Read current value of the LCD_WF20_BPDLCD20 field. */
#define BR_LCD_WF20_BPDLCD20(x) (BME_UBFX8(HW_LCD_WF20_ADDR(x), BP_LCD_WF20_BPDLCD20, BS_LCD_WF20_BPDLCD20))

/*! @brief Format value for bitfield LCD_WF20_BPDLCD20. */
#define BF_LCD_WF20_BPDLCD20(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF20_BPDLCD20) & BM_LCD_WF20_BPDLCD20)

/*! @brief Set the BPDLCD20 field to a new value. */
#define BW_LCD_WF20_BPDLCD20(x, v) (BME_BFI8(HW_LCD_WF20_ADDR(x), ((uint8_t)(v) << BP_LCD_WF20_BPDLCD20), BP_LCD_WF20_BPDLCD20, 1))
/*@}*/

/*!
 * @name Register LCD_WF20, field BPELCD20[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF20_BPELCD20 (4U)          /*!< Bit position for LCD_WF20_BPELCD20. */
#define BM_LCD_WF20_BPELCD20 (0x10U)       /*!< Bit mask for LCD_WF20_BPELCD20. */
#define BS_LCD_WF20_BPELCD20 (1U)          /*!< Bit field size in bits for LCD_WF20_BPELCD20. */

/*! @brief Read current value of the LCD_WF20_BPELCD20 field. */
#define BR_LCD_WF20_BPELCD20(x) (BME_UBFX8(HW_LCD_WF20_ADDR(x), BP_LCD_WF20_BPELCD20, BS_LCD_WF20_BPELCD20))

/*! @brief Format value for bitfield LCD_WF20_BPELCD20. */
#define BF_LCD_WF20_BPELCD20(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF20_BPELCD20) & BM_LCD_WF20_BPELCD20)

/*! @brief Set the BPELCD20 field to a new value. */
#define BW_LCD_WF20_BPELCD20(x, v) (BME_BFI8(HW_LCD_WF20_ADDR(x), ((uint8_t)(v) << BP_LCD_WF20_BPELCD20), BP_LCD_WF20_BPELCD20, 1))
/*@}*/

/*!
 * @name Register LCD_WF20, field BPFLCD20[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF20_BPFLCD20 (5U)          /*!< Bit position for LCD_WF20_BPFLCD20. */
#define BM_LCD_WF20_BPFLCD20 (0x20U)       /*!< Bit mask for LCD_WF20_BPFLCD20. */
#define BS_LCD_WF20_BPFLCD20 (1U)          /*!< Bit field size in bits for LCD_WF20_BPFLCD20. */

/*! @brief Read current value of the LCD_WF20_BPFLCD20 field. */
#define BR_LCD_WF20_BPFLCD20(x) (BME_UBFX8(HW_LCD_WF20_ADDR(x), BP_LCD_WF20_BPFLCD20, BS_LCD_WF20_BPFLCD20))

/*! @brief Format value for bitfield LCD_WF20_BPFLCD20. */
#define BF_LCD_WF20_BPFLCD20(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF20_BPFLCD20) & BM_LCD_WF20_BPFLCD20)

/*! @brief Set the BPFLCD20 field to a new value. */
#define BW_LCD_WF20_BPFLCD20(x, v) (BME_BFI8(HW_LCD_WF20_ADDR(x), ((uint8_t)(v) << BP_LCD_WF20_BPFLCD20), BP_LCD_WF20_BPFLCD20, 1))
/*@}*/

/*!
 * @name Register LCD_WF20, field BPGLCD20[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF20_BPGLCD20 (6U)          /*!< Bit position for LCD_WF20_BPGLCD20. */
#define BM_LCD_WF20_BPGLCD20 (0x40U)       /*!< Bit mask for LCD_WF20_BPGLCD20. */
#define BS_LCD_WF20_BPGLCD20 (1U)          /*!< Bit field size in bits for LCD_WF20_BPGLCD20. */

