flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Set the BPBLCD22 field to a new value. */
#define BW_LCD_WF22_BPBLCD22(x, v) (BME_BFI8(HW_LCD_WF22_ADDR(x), ((uint8_t)(v) << BP_LCD_WF22_BPBLCD22), BP_LCD_WF22_BPBLCD22, 1))
/*@}*/

/*!
 * @name Register LCD_WF22, field BPCLCD22[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF22_BPCLCD22 (2U)          /*!< Bit position for LCD_WF22_BPCLCD22. */
#define BM_LCD_WF22_BPCLCD22 (0x04U)       /*!< Bit mask for LCD_WF22_BPCLCD22. */
#define BS_LCD_WF22_BPCLCD22 (1U)          /*!< Bit field size in bits for LCD_WF22_BPCLCD22. */

/*! @brief Read current value of the LCD_WF22_BPCLCD22 field. */
#define BR_LCD_WF22_BPCLCD22(x) (BME_UBFX8(HW_LCD_WF22_ADDR(x), BP_LCD_WF22_BPCLCD22, BS_LCD_WF22_BPCLCD22))

/*! @brief Format value for bitfield LCD_WF22_BPCLCD22. */
#define BF_LCD_WF22_BPCLCD22(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF22_BPCLCD22) & BM_LCD_WF22_BPCLCD22)

/*! @brief Set the BPCLCD22 field to a new value. */
#define BW_LCD_WF22_BPCLCD22(x, v) (BME_BFI8(HW_LCD_WF22_ADDR(x), ((uint8_t)(v) << BP_LCD_WF22_BPCLCD22), BP_LCD_WF22_BPCLCD22, 1))
/*@}*/

/*!
 * @name Register LCD_WF22, field BPDLCD22[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF22_BPDLCD22 (3U)          /*!< Bit position for LCD_WF22_BPDLCD22. */
#define BM_LCD_WF22_BPDLCD22 (0x08U)       /*!< Bit mask for LCD_WF22_BPDLCD22. */
#define BS_LCD_WF22_BPDLCD22 (1U)          /*!< Bit field size in bits for LCD_WF22_BPDLCD22. */

/*! @brief Read current value of the LCD_WF22_BPDLCD22 field. */
#define BR_LCD_WF22_BPDLCD22(x) (BME_UBFX8(HW_LCD_WF22_ADDR(x), BP_LCD_WF22_BPDLCD22, BS_LCD_WF22_BPDLCD22))

/*! @brief Format value for bitfield LCD_WF22_BPDLCD22. */
#define BF_LCD_WF22_BPDLCD22(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF22_BPDLCD22) & BM_LCD_WF22_BPDLCD22)

/*! @brief Set the BPDLCD22 field to a new value. */
#define BW_LCD_WF22_BPDLCD22(x, v) (BME_BFI8(HW_LCD_WF22_ADDR(x), ((uint8_t)(v) << BP_LCD_WF22_BPDLCD22), BP_LCD_WF22_BPDLCD22, 1))
/*@}*/

/*!
 * @name Register LCD_WF22, field BPELCD22[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF22_BPELCD22 (4U)          /*!< Bit position for LCD_WF22_BPELCD22. */
#define BM_LCD_WF22_BPELCD22 (0x10U)       /*!< Bit mask for LCD_WF22_BPELCD22. */
#define BS_LCD_WF22_BPELCD22 (1U)          /*!< Bit field size in bits for LCD_WF22_BPELCD22. */

/*! @brief Read current value of the LCD_WF22_BPELCD22 field. */
#define BR_LCD_WF22_BPELCD22(x) (BME_UBFX8(HW_LCD_WF22_ADDR(x), BP_LCD_WF22_BPELCD22, BS_LCD_WF22_BPELCD22))

/*! @brief Format value for bitfield LCD_WF22_BPELCD22. */
#define BF_LCD_WF22_BPELCD22(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF22_BPELCD22) & BM_LCD_WF22_BPELCD22)

/*! @brief Set the BPELCD22 field to a new value. */
#define BW_LCD_WF22_BPELCD22(x, v) (BME_BFI8(HW_LCD_WF22_ADDR(x), ((uint8_t)(v) << BP_LCD_WF22_BPELCD22), BP_LCD_WF22_BPELCD22, 1))
/*@}*/

/*!
 * @name Register LCD_WF22, field BPFLCD22[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF22_BPFLCD22 (5U)          /*!< Bit position for LCD_WF22_BPFLCD22. */
#define BM_LCD_WF22_BPFLCD22 (0x20U)       /*!< Bit mask for LCD_WF22_BPFLCD22. */
#define BS_LCD_WF22_BPFLCD22 (1U)          /*!< Bit field size in bits for LCD_WF22_BPFLCD22. */

/*! @brief Read current value of the LCD_WF22_BPFLCD22 field. */
#define BR_LCD_WF22_BPFLCD22(x) (BME_UBFX8(HW_LCD_WF22_ADDR(x), BP_LCD_WF22_BPFLCD22, BS_LCD_WF22_BPFLCD22))

/*! @brief Format value for bitfield LCD_WF22_BPFLCD22. */
#define BF_LCD_WF22_BPFLCD22(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF22_BPFLCD22) & BM_LCD_WF22_BPFLCD22)

/*! @brief Set the BPFLCD22 field to a new value. */
#define BW_LCD_WF22_BPFLCD22(x, v) (BME_BFI8(HW_LCD_WF22_ADDR(x), ((uint8_t)(v) << BP_LCD_WF22_BPFLCD22), BP_LCD_WF22_BPFLCD22, 1))
/*@}*/

/*!
 * @name Register LCD_WF22, field BPGLCD22[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF22_BPGLCD22 (6U)          /*!< Bit position for LCD_WF22_BPGLCD22. */
#define BM_LCD_WF22_BPGLCD22 (0x40U)       /*!< Bit mask for LCD_WF22_BPGLCD22. */
#define BS_LCD_WF22_BPGLCD22 (1U)          /*!< Bit field size in bits for LCD_WF22_BPGLCD22. */

/*! @brief Read current value of the LCD_WF22_BPGLCD22 field. */
#define BR_LCD_WF22_BPGLCD22(x) (BME_UBFX8(HW_LCD_WF22_ADDR(x), BP_LCD_WF22_BPGLCD22, BS_LCD_WF22_BPGLCD22))

/*! @brief Format value for bitfield LCD_WF22_BPGLCD22. */
#define BF_LCD_WF22_BPGLCD22(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF22_BPGLCD22) & BM_LCD_WF22_BPGLCD22)

/*! @brief Set the BPGLCD22 field to a new value. */
#define BW_LCD_WF22_BPGLCD22(x, v) (BME_BFI8(HW_LCD_WF22_ADDR(x), ((uint8_t)(v) << BP_LCD_WF22_BPGLCD22), BP_LCD_WF22_BPGLCD22, 1))
/*@}*/

/*!
 * @name Register LCD_WF22, field BPHLCD22[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF22_BPHLCD22 (7U)          /*!< Bit position for LCD_WF22_BPHLCD22. */
#define BM_LCD_WF22_BPHLCD22 (0x80U)       /*!< Bit mask for LCD_WF22_BPHLCD22. */
#define BS_LCD_WF22_BPHLCD22 (1U)          /*!< Bit field size in bits for LCD_WF22_BPHLCD22. */

/*! @brief Read current value of the LCD_WF22_BPHLCD22 field. */
#define BR_LCD_WF22_BPHLCD22(x) (BME_UBFX8(HW_LCD_WF22_ADDR(x), BP_LCD_WF22_BPHLCD22, BS_LCD_WF22_BPHLCD22))

/*! @brief Format value for bitfield LCD_WF22_BPHLCD22. */
#define BF_LCD_WF22_BPHLCD22(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF22_BPHLCD22) & BM_LCD_WF22_BPHLCD22)

/*! @brief Set the BPHLCD22 field to a new value. */
#define BW_LCD_WF22_BPHLCD22(x, v) (BME_BFI8(HW_LCD_WF22_ADDR(x), ((uint8_t)(v) << BP_LCD_WF22_BPHLCD22), BP_LCD_WF22_BPHLCD22, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF23 - LCD Waveform Register 23.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF23 - LCD Waveform Register 23. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf23
{
    uint8_t U;
    struct _hw_lcd_wf23_bitfields
    {
        uint8_t BPALCD23 : 1;          /*!< [0]  */
        uint8_t BPBLCD23 : 1;          /*!< [1]  */
        uint8_t BPCLCD23 : 1;          /*!< [2]  */
        uint8_t BPDLCD23 : 1;          /*!< [3]  */
        uint8_t BPELCD23 : 1;          /*!< [4]  */
        uint8_t BPFLCD23 : 1;          /*!< [5]  */
        uint8_t BPGLCD23 : 1;          /*!< [6]  */
        uint8_t BPHLCD23 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf23_t;

/*!
 * @name Constants and macros for entire LCD_WF23 register
 */
/*@{*/
#define HW_LCD_WF23_ADDR(x)      ((uint32_t)(x) + 0x37U)

#define HW_LCD_WF23(x)           (*(__IO hw_lcd_wf23_t *) HW_LCD_WF23_ADDR(x))
#define HW_LCD_WF23_RD(x)        (HW_LCD_WF23(x).U)
#define HW_LCD_WF23_WR(x, v)     (HW_LCD_WF23(x).U = (v))
#define HW_LCD_WF23_SET(x, v)    (BME_OR8(HW_LCD_WF23_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF23_CLR(x, v)    (BME_AND8(HW_LCD_WF23_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF23_TOG(x, v)    (BME_XOR8(HW_LCD_WF23_ADDR(x), (uint8_t)(v)))
/*@}*/

