flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Read current value of the LCD_WF26_BPHLCD26 field. */
#define BR_LCD_WF26_BPHLCD26(x) (BME_UBFX8(HW_LCD_WF26_ADDR(x), BP_LCD_WF26_BPHLCD26, BS_LCD_WF26_BPHLCD26))

/*! @brief Format value for bitfield LCD_WF26_BPHLCD26. */
#define BF_LCD_WF26_BPHLCD26(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF26_BPHLCD26) & BM_LCD_WF26_BPHLCD26)

/*! @brief Set the BPHLCD26 field to a new value. */
#define BW_LCD_WF26_BPHLCD26(x, v) (BME_BFI8(HW_LCD_WF26_ADDR(x), ((uint8_t)(v) << BP_LCD_WF26_BPHLCD26), BP_LCD_WF26_BPHLCD26, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF27 - LCD Waveform Register 27.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF27 - LCD Waveform Register 27. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf27
{
    uint8_t U;
    struct _hw_lcd_wf27_bitfields
    {
        uint8_t BPALCD27 : 1;          /*!< [0]  */
        uint8_t BPBLCD27 : 1;          /*!< [1]  */
        uint8_t BPCLCD27 : 1;          /*!< [2]  */
        uint8_t BPDLCD27 : 1;          /*!< [3]  */
        uint8_t BPELCD27 : 1;          /*!< [4]  */
        uint8_t BPFLCD27 : 1;          /*!< [5]  */
        uint8_t BPGLCD27 : 1;          /*!< [6]  */
        uint8_t BPHLCD27 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf27_t;

/*!
 * @name Constants and macros for entire LCD_WF27 register
 */
/*@{*/
#define HW_LCD_WF27_ADDR(x)      ((uint32_t)(x) + 0x3BU)

#define HW_LCD_WF27(x)           (*(__IO hw_lcd_wf27_t *) HW_LCD_WF27_ADDR(x))
#define HW_LCD_WF27_RD(x)        (HW_LCD_WF27(x).U)
#define HW_LCD_WF27_WR(x, v)     (HW_LCD_WF27(x).U = (v))
#define HW_LCD_WF27_SET(x, v)    (BME_OR8(HW_LCD_WF27_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF27_CLR(x, v)    (BME_AND8(HW_LCD_WF27_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF27_TOG(x, v)    (BME_XOR8(HW_LCD_WF27_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF27 bitfields
 */

/*!
 * @name Register LCD_WF27, field BPALCD27[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF27_BPALCD27 (0U)          /*!< Bit position for LCD_WF27_BPALCD27. */
#define BM_LCD_WF27_BPALCD27 (0x01U)       /*!< Bit mask for LCD_WF27_BPALCD27. */
#define BS_LCD_WF27_BPALCD27 (1U)          /*!< Bit field size in bits for LCD_WF27_BPALCD27. */

/*! @brief Read current value of the LCD_WF27_BPALCD27 field. */
#define BR_LCD_WF27_BPALCD27(x) (BME_UBFX8(HW_LCD_WF27_ADDR(x), BP_LCD_WF27_BPALCD27, BS_LCD_WF27_BPALCD27))

/*! @brief Format value for bitfield LCD_WF27_BPALCD27. */
#define BF_LCD_WF27_BPALCD27(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF27_BPALCD27) & BM_LCD_WF27_BPALCD27)

/*! @brief Set the BPALCD27 field to a new value. */
#define BW_LCD_WF27_BPALCD27(x, v) (BME_BFI8(HW_LCD_WF27_ADDR(x), ((uint8_t)(v) << BP_LCD_WF27_BPALCD27), BP_LCD_WF27_BPALCD27, 1))
/*@}*/

/*!
 * @name Register LCD_WF27, field BPBLCD27[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF27_BPBLCD27 (1U)          /*!< Bit position for LCD_WF27_BPBLCD27. */
#define BM_LCD_WF27_BPBLCD27 (0x02U)       /*!< Bit mask for LCD_WF27_BPBLCD27. */
#define BS_LCD_WF27_BPBLCD27 (1U)          /*!< Bit field size in bits for LCD_WF27_BPBLCD27. */

/*! @brief Read current value of the LCD_WF27_BPBLCD27 field. */
#define BR_LCD_WF27_BPBLCD27(x) (BME_UBFX8(HW_LCD_WF27_ADDR(x), BP_LCD_WF27_BPBLCD27, BS_LCD_WF27_BPBLCD27))

/*! @brief Format value for bitfield LCD_WF27_BPBLCD27. */
#define BF_LCD_WF27_BPBLCD27(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF27_BPBLCD27) & BM_LCD_WF27_BPBLCD27)

/*! @brief Set the BPBLCD27 field to a new value. */
#define BW_LCD_WF27_BPBLCD27(x, v) (BME_BFI8(HW_LCD_WF27_ADDR(x), ((uint8_t)(v) << BP_LCD_WF27_BPBLCD27), BP_LCD_WF27_BPBLCD27, 1))
/*@}*/

/*!
 * @name Register LCD_WF27, field BPCLCD27[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF27_BPCLCD27 (2U)          /*!< Bit position for LCD_WF27_BPCLCD27. */
#define BM_LCD_WF27_BPCLCD27 (0x04U)       /*!< Bit mask for LCD_WF27_BPCLCD27. */
#define BS_LCD_WF27_BPCLCD27 (1U)          /*!< Bit field size in bits for LCD_WF27_BPCLCD27. */

/*! @brief Read current value of the LCD_WF27_BPCLCD27 field. */
#define BR_LCD_WF27_BPCLCD27(x) (BME_UBFX8(HW_LCD_WF27_ADDR(x), BP_LCD_WF27_BPCLCD27, BS_LCD_WF27_BPCLCD27))

/*! @brief Format value for bitfield LCD_WF27_BPCLCD27. */
#define BF_LCD_WF27_BPCLCD27(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF27_BPCLCD27) & BM_LCD_WF27_BPCLCD27)

/*! @brief Set the BPCLCD27 field to a new value. */
#define BW_LCD_WF27_BPCLCD27(x, v) (BME_BFI8(HW_LCD_WF27_ADDR(x), ((uint8_t)(v) << BP_LCD_WF27_BPCLCD27), BP_LCD_WF27_BPCLCD27, 1))
/*@}*/

/*!
 * @name Register LCD_WF27, field BPDLCD27[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF27_BPDLCD27 (3U)          /*!< Bit position for LCD_WF27_BPDLCD27. */
#define BM_LCD_WF27_BPDLCD27 (0x08U)       /*!< Bit mask for LCD_WF27_BPDLCD27. */
#define BS_LCD_WF27_BPDLCD27 (1U)          /*!< Bit field size in bits for LCD_WF27_BPDLCD27. */

/*! @brief Read current value of the LCD_WF27_BPDLCD27 field. */
#define BR_LCD_WF27_BPDLCD27(x) (BME_UBFX8(HW_LCD_WF27_ADDR(x), BP_LCD_WF27_BPDLCD27, BS_LCD_WF27_BPDLCD27))

/*! @brief Format value for bitfield LCD_WF27_BPDLCD27. */
#define BF_LCD_WF27_BPDLCD27(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF27_BPDLCD27) & BM_LCD_WF27_BPDLCD27)

/*! @brief Set the BPDLCD27 field to a new value. */
#define BW_LCD_WF27_BPDLCD27(x, v) (BME_BFI8(HW_LCD_WF27_ADDR(x), ((uint8_t)(v) << BP_LCD_WF27_BPDLCD27), BP_LCD_WF27_BPDLCD27, 1))
/*@}*/

/*!
 * @name Register LCD_WF27, field BPELCD27[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF27_BPELCD27 (4U)          /*!< Bit position for LCD_WF27_BPELCD27. */
#define BM_LCD_WF27_BPELCD27 (0x10U)       /*!< Bit mask for LCD_WF27_BPELCD27. */
#define BS_LCD_WF27_BPELCD27 (1U)          /*!< Bit field size in bits for LCD_WF27_BPELCD27. */

/*! @brief Read current value of the LCD_WF27_BPELCD27 field. */
#define BR_LCD_WF27_BPELCD27(x) (BME_UBFX8(HW_LCD_WF27_ADDR(x), BP_LCD_WF27_BPELCD27, BS_LCD_WF27_BPELCD27))

/*! @brief Format value for bitfield LCD_WF27_BPELCD27. */
#define BF_LCD_WF27_BPELCD27(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF27_BPELCD27) & BM_LCD_WF27_BPELCD27)

/*! @brief Set the BPELCD27 field to a new value. */
#define BW_LCD_WF27_BPELCD27(x, v) (BME_BFI8(HW_LCD_WF27_ADDR(x), ((uint8_t)(v) << BP_LCD_WF27_BPELCD27), BP_LCD_WF27_BPELCD27, 1))
/*@}*/

/*!
 * @name Register LCD_WF27, field BPFLCD27[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF27_BPFLCD27 (5U)          /*!< Bit position for LCD_WF27_BPFLCD27. */
#define BM_LCD_WF27_BPFLCD27 (0x20U)       /*!< Bit mask for LCD_WF27_BPFLCD27. */
#define BS_LCD_WF27_BPFLCD27 (1U)          /*!< Bit field size in bits for LCD_WF27_BPFLCD27. */

/*! @brief Read current value of the LCD_WF27_BPFLCD27 field. */
#define BR_LCD_WF27_BPFLCD27(x) (BME_UBFX8(HW_LCD_WF27_ADDR(x), BP_LCD_WF27_BPFLCD27, BS_LCD_WF27_BPFLCD27))

/*! @brief Format value for bitfield LCD_WF27_BPFLCD27. */
#define BF_LCD_WF27_BPFLCD27(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF27_BPFLCD27) & BM_LCD_WF27_BPFLCD27)

/*! @brief Set the BPFLCD27 field to a new value. */
#define BW_LCD_WF27_BPFLCD27(x, v) (BME_BFI8(HW_LCD_WF27_ADDR(x), ((uint8_t)(v) << BP_LCD_WF27_BPFLCD27), BP_LCD_WF27_BPFLCD27, 1))
/*@}*/

/*!
 * @name Register LCD_WF27, field BPGLCD27[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF27_BPGLCD27 (6U)          /*!< Bit position for LCD_WF27_BPGLCD27. */
#define BM_LCD_WF27_BPGLCD27 (0x40U)       /*!< Bit mask for LCD_WF27_BPGLCD27. */
#define BS_LCD_WF27_BPGLCD27 (1U)          /*!< Bit field size in bits for LCD_WF27_BPGLCD27. */

