flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Set the BPBLCD29 field to a new value. */
#define BW_LCD_WF29_BPBLCD29(x, v) (BME_BFI8(HW_LCD_WF29_ADDR(x), ((uint8_t)(v) << BP_LCD_WF29_BPBLCD29), BP_LCD_WF29_BPBLCD29, 1))
/*@}*/

/*!
 * @name Register LCD_WF29, field BPCLCD29[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF29_BPCLCD29 (2U)          /*!< Bit position for LCD_WF29_BPCLCD29. */
#define BM_LCD_WF29_BPCLCD29 (0x04U)       /*!< Bit mask for LCD_WF29_BPCLCD29. */
#define BS_LCD_WF29_BPCLCD29 (1U)          /*!< Bit field size in bits for LCD_WF29_BPCLCD29. */

/*! @brief Read current value of the LCD_WF29_BPCLCD29 field. */
#define BR_LCD_WF29_BPCLCD29(x) (BME_UBFX8(HW_LCD_WF29_ADDR(x), BP_LCD_WF29_BPCLCD29, BS_LCD_WF29_BPCLCD29))

/*! @brief Format value for bitfield LCD_WF29_BPCLCD29. */
#define BF_LCD_WF29_BPCLCD29(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF29_BPCLCD29) & BM_LCD_WF29_BPCLCD29)

/*! @brief Set the BPCLCD29 field to a new value. */
#define BW_LCD_WF29_BPCLCD29(x, v) (BME_BFI8(HW_LCD_WF29_ADDR(x), ((uint8_t)(v) << BP_LCD_WF29_BPCLCD29), BP_LCD_WF29_BPCLCD29, 1))
/*@}*/

/*!
 * @name Register LCD_WF29, field BPDLCD29[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF29_BPDLCD29 (3U)          /*!< Bit position for LCD_WF29_BPDLCD29. */
#define BM_LCD_WF29_BPDLCD29 (0x08U)       /*!< Bit mask for LCD_WF29_BPDLCD29. */
#define BS_LCD_WF29_BPDLCD29 (1U)          /*!< Bit field size in bits for LCD_WF29_BPDLCD29. */

/*! @brief Read current value of the LCD_WF29_BPDLCD29 field. */
#define BR_LCD_WF29_BPDLCD29(x) (BME_UBFX8(HW_LCD_WF29_ADDR(x), BP_LCD_WF29_BPDLCD29, BS_LCD_WF29_BPDLCD29))

/*! @brief Format value for bitfield LCD_WF29_BPDLCD29. */
#define BF_LCD_WF29_BPDLCD29(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF29_BPDLCD29) & BM_LCD_WF29_BPDLCD29)

/*! @brief Set the BPDLCD29 field to a new value. */
#define BW_LCD_WF29_BPDLCD29(x, v) (BME_BFI8(HW_LCD_WF29_ADDR(x), ((uint8_t)(v) << BP_LCD_WF29_BPDLCD29), BP_LCD_WF29_BPDLCD29, 1))
/*@}*/

/*!
 * @name Register LCD_WF29, field BPELCD29[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF29_BPELCD29 (4U)          /*!< Bit position for LCD_WF29_BPELCD29. */
#define BM_LCD_WF29_BPELCD29 (0x10U)       /*!< Bit mask for LCD_WF29_BPELCD29. */
#define BS_LCD_WF29_BPELCD29 (1U)          /*!< Bit field size in bits for LCD_WF29_BPELCD29. */

/*! @brief Read current value of the LCD_WF29_BPELCD29 field. */
#define BR_LCD_WF29_BPELCD29(x) (BME_UBFX8(HW_LCD_WF29_ADDR(x), BP_LCD_WF29_BPELCD29, BS_LCD_WF29_BPELCD29))

/*! @brief Format value for bitfield LCD_WF29_BPELCD29. */
#define BF_LCD_WF29_BPELCD29(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF29_BPELCD29) & BM_LCD_WF29_BPELCD29)

/*! @brief Set the BPELCD29 field to a new value. */
#define BW_LCD_WF29_BPELCD29(x, v) (BME_BFI8(HW_LCD_WF29_ADDR(x), ((uint8_t)(v) << BP_LCD_WF29_BPELCD29), BP_LCD_WF29_BPELCD29, 1))
/*@}*/

/*!
 * @name Register LCD_WF29, field BPFLCD29[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF29_BPFLCD29 (5U)          /*!< Bit position for LCD_WF29_BPFLCD29. */
#define BM_LCD_WF29_BPFLCD29 (0x20U)       /*!< Bit mask for LCD_WF29_BPFLCD29. */
#define BS_LCD_WF29_BPFLCD29 (1U)          /*!< Bit field size in bits for LCD_WF29_BPFLCD29. */

/*! @brief Read current value of the LCD_WF29_BPFLCD29 field. */
#define BR_LCD_WF29_BPFLCD29(x) (BME_UBFX8(HW_LCD_WF29_ADDR(x), BP_LCD_WF29_BPFLCD29, BS_LCD_WF29_BPFLCD29))

/*! @brief Format value for bitfield LCD_WF29_BPFLCD29. */
#define BF_LCD_WF29_BPFLCD29(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF29_BPFLCD29) & BM_LCD_WF29_BPFLCD29)

/*! @brief Set the BPFLCD29 field to a new value. */
#define BW_LCD_WF29_BPFLCD29(x, v) (BME_BFI8(HW_LCD_WF29_ADDR(x), ((uint8_t)(v) << BP_LCD_WF29_BPFLCD29), BP_LCD_WF29_BPFLCD29, 1))
/*@}*/

/*!
 * @name Register LCD_WF29, field BPGLCD29[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF29_BPGLCD29 (6U)          /*!< Bit position for LCD_WF29_BPGLCD29. */
#define BM_LCD_WF29_BPGLCD29 (0x40U)       /*!< Bit mask for LCD_WF29_BPGLCD29. */
#define BS_LCD_WF29_BPGLCD29 (1U)          /*!< Bit field size in bits for LCD_WF29_BPGLCD29. */

/*! @brief Read current value of the LCD_WF29_BPGLCD29 field. */
#define BR_LCD_WF29_BPGLCD29(x) (BME_UBFX8(HW_LCD_WF29_ADDR(x), BP_LCD_WF29_BPGLCD29, BS_LCD_WF29_BPGLCD29))

/*! @brief Format value for bitfield LCD_WF29_BPGLCD29. */
#define BF_LCD_WF29_BPGLCD29(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF29_BPGLCD29) & BM_LCD_WF29_BPGLCD29)

/*! @brief Set the BPGLCD29 field to a new value. */
#define BW_LCD_WF29_BPGLCD29(x, v) (BME_BFI8(HW_LCD_WF29_ADDR(x), ((uint8_t)(v) << BP_LCD_WF29_BPGLCD29), BP_LCD_WF29_BPGLCD29, 1))
/*@}*/

/*!
 * @name Register LCD_WF29, field BPHLCD29[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF29_BPHLCD29 (7U)          /*!< Bit position for LCD_WF29_BPHLCD29. */
#define BM_LCD_WF29_BPHLCD29 (0x80U)       /*!< Bit mask for LCD_WF29_BPHLCD29. */
#define BS_LCD_WF29_BPHLCD29 (1U)          /*!< Bit field size in bits for LCD_WF29_BPHLCD29. */

/*! @brief Read current value of the LCD_WF29_BPHLCD29 field. */
#define BR_LCD_WF29_BPHLCD29(x) (BME_UBFX8(HW_LCD_WF29_ADDR(x), BP_LCD_WF29_BPHLCD29, BS_LCD_WF29_BPHLCD29))

/*! @brief Format value for bitfield LCD_WF29_BPHLCD29. */
#define BF_LCD_WF29_BPHLCD29(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF29_BPHLCD29) & BM_LCD_WF29_BPHLCD29)

/*! @brief Set the BPHLCD29 field to a new value. */
#define BW_LCD_WF29_BPHLCD29(x, v) (BME_BFI8(HW_LCD_WF29_ADDR(x), ((uint8_t)(v) << BP_LCD_WF29_BPHLCD29), BP_LCD_WF29_BPHLCD29, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF30 - LCD Waveform Register 30.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF30 - LCD Waveform Register 30. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf30
{
    uint8_t U;
    struct _hw_lcd_wf30_bitfields
    {
        uint8_t BPALCD30 : 1;          /*!< [0]  */
        uint8_t BPBLCD30 : 1;          /*!< [1]  */
        uint8_t BPCLCD30 : 1;          /*!< [2]  */
        uint8_t BPDLCD30 : 1;          /*!< [3]  */
        uint8_t BPELCD30 : 1;          /*!< [4]  */
        uint8_t BPFLCD30 : 1;          /*!< [5]  */
        uint8_t BPGLCD30 : 1;          /*!< [6]  */
        uint8_t BPHLCD30 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf30_t;

/*!
 * @name Constants and macros for entire LCD_WF30 register
 */
/*@{*/
#define HW_LCD_WF30_ADDR(x)      ((uint32_t)(x) + 0x3EU)

