flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Format value for bitfield LCD_WF33_BPFLCD33. */
#define BF_LCD_WF33_BPFLCD33(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF33_BPFLCD33) & BM_LCD_WF33_BPFLCD33)

/*! @brief Set the BPFLCD33 field to a new value. */
#define BW_LCD_WF33_BPFLCD33(x, v) (BME_BFI8(HW_LCD_WF33_ADDR(x), ((uint8_t)(v) << BP_LCD_WF33_BPFLCD33), BP_LCD_WF33_BPFLCD33, 1))
/*@}*/

/*!
 * @name Register LCD_WF33, field BPGLCD33[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF33_BPGLCD33 (6U)          /*!< Bit position for LCD_WF33_BPGLCD33. */
#define BM_LCD_WF33_BPGLCD33 (0x40U)       /*!< Bit mask for LCD_WF33_BPGLCD33. */
#define BS_LCD_WF33_BPGLCD33 (1U)          /*!< Bit field size in bits for LCD_WF33_BPGLCD33. */

/*! @brief Read current value of the LCD_WF33_BPGLCD33 field. */
#define BR_LCD_WF33_BPGLCD33(x) (BME_UBFX8(HW_LCD_WF33_ADDR(x), BP_LCD_WF33_BPGLCD33, BS_LCD_WF33_BPGLCD33))

/*! @brief Format value for bitfield LCD_WF33_BPGLCD33. */
#define BF_LCD_WF33_BPGLCD33(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF33_BPGLCD33) & BM_LCD_WF33_BPGLCD33)

/*! @brief Set the BPGLCD33 field to a new value. */
#define BW_LCD_WF33_BPGLCD33(x, v) (BME_BFI8(HW_LCD_WF33_ADDR(x), ((uint8_t)(v) << BP_LCD_WF33_BPGLCD33), BP_LCD_WF33_BPGLCD33, 1))
/*@}*/

/*!
 * @name Register LCD_WF33, field BPHLCD33[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF33_BPHLCD33 (7U)          /*!< Bit position for LCD_WF33_BPHLCD33. */
#define BM_LCD_WF33_BPHLCD33 (0x80U)       /*!< Bit mask for LCD_WF33_BPHLCD33. */
#define BS_LCD_WF33_BPHLCD33 (1U)          /*!< Bit field size in bits for LCD_WF33_BPHLCD33. */

/*! @brief Read current value of the LCD_WF33_BPHLCD33 field. */
#define BR_LCD_WF33_BPHLCD33(x) (BME_UBFX8(HW_LCD_WF33_ADDR(x), BP_LCD_WF33_BPHLCD33, BS_LCD_WF33_BPHLCD33))

/*! @brief Format value for bitfield LCD_WF33_BPHLCD33. */
#define BF_LCD_WF33_BPHLCD33(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF33_BPHLCD33) & BM_LCD_WF33_BPHLCD33)

/*! @brief Set the BPHLCD33 field to a new value. */
#define BW_LCD_WF33_BPHLCD33(x, v) (BME_BFI8(HW_LCD_WF33_ADDR(x), ((uint8_t)(v) << BP_LCD_WF33_BPHLCD33), BP_LCD_WF33_BPHLCD33, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF34 - LCD Waveform Register 34.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF34 - LCD Waveform Register 34. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf34
{
    uint8_t U;
    struct _hw_lcd_wf34_bitfields
    {
        uint8_t BPALCD34 : 1;          /*!< [0]  */
        uint8_t BPBLCD34 : 1;          /*!< [1]  */
        uint8_t BPCLCD34 : 1;          /*!< [2]  */
        uint8_t BPDLCD34 : 1;          /*!< [3]  */
        uint8_t BPELCD34 : 1;          /*!< [4]  */
        uint8_t BPFLCD34 : 1;          /*!< [5]  */
        uint8_t BPGLCD34 : 1;          /*!< [6]  */
        uint8_t BPHLCD34 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf34_t;

/*!
 * @name Constants and macros for entire LCD_WF34 register
 */
/*@{*/
#define HW_LCD_WF34_ADDR(x)      ((uint32_t)(x) + 0x42U)

#define HW_LCD_WF34(x)           (*(__IO hw_lcd_wf34_t *) HW_LCD_WF34_ADDR(x))
#define HW_LCD_WF34_RD(x)        (HW_LCD_WF34(x).U)
#define HW_LCD_WF34_WR(x, v)     (HW_LCD_WF34(x).U = (v))
#define HW_LCD_WF34_SET(x, v)    (BME_OR8(HW_LCD_WF34_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF34_CLR(x, v)    (BME_AND8(HW_LCD_WF34_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF34_TOG(x, v)    (BME_XOR8(HW_LCD_WF34_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF34 bitfields
 */

/*!
 * @name Register LCD_WF34, field BPALCD34[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF34_BPALCD34 (0U)          /*!< Bit position for LCD_WF34_BPALCD34. */
#define BM_LCD_WF34_BPALCD34 (0x01U)       /*!< Bit mask for LCD_WF34_BPALCD34. */
#define BS_LCD_WF34_BPALCD34 (1U)          /*!< Bit field size in bits for LCD_WF34_BPALCD34. */

/*! @brief Read current value of the LCD_WF34_BPALCD34 field. */
#define BR_LCD_WF34_BPALCD34(x) (BME_UBFX8(HW_LCD_WF34_ADDR(x), BP_LCD_WF34_BPALCD34, BS_LCD_WF34_BPALCD34))

/*! @brief Format value for bitfield LCD_WF34_BPALCD34. */
#define BF_LCD_WF34_BPALCD34(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF34_BPALCD34) & BM_LCD_WF34_BPALCD34)

/*! @brief Set the BPALCD34 field to a new value. */
#define BW_LCD_WF34_BPALCD34(x, v) (BME_BFI8(HW_LCD_WF34_ADDR(x), ((uint8_t)(v) << BP_LCD_WF34_BPALCD34), BP_LCD_WF34_BPALCD34, 1))
/*@}*/

/*!
 * @name Register LCD_WF34, field BPBLCD34[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF34_BPBLCD34 (1U)          /*!< Bit position for LCD_WF34_BPBLCD34. */
#define BM_LCD_WF34_BPBLCD34 (0x02U)       /*!< Bit mask for LCD_WF34_BPBLCD34. */
#define BS_LCD_WF34_BPBLCD34 (1U)          /*!< Bit field size in bits for LCD_WF34_BPBLCD34. */

/*! @brief Read current value of the LCD_WF34_BPBLCD34 field. */
#define BR_LCD_WF34_BPBLCD34(x) (BME_UBFX8(HW_LCD_WF34_ADDR(x), BP_LCD_WF34_BPBLCD34, BS_LCD_WF34_BPBLCD34))

/*! @brief Format value for bitfield LCD_WF34_BPBLCD34. */
#define BF_LCD_WF34_BPBLCD34(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF34_BPBLCD34) & BM_LCD_WF34_BPBLCD34)

/*! @brief Set the BPBLCD34 field to a new value. */
#define BW_LCD_WF34_BPBLCD34(x, v) (BME_BFI8(HW_LCD_WF34_ADDR(x), ((uint8_t)(v) << BP_LCD_WF34_BPBLCD34), BP_LCD_WF34_BPBLCD34, 1))
/*@}*/

/*!
 * @name Register LCD_WF34, field BPCLCD34[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF34_BPCLCD34 (2U)          /*!< Bit position for LCD_WF34_BPCLCD34. */
#define BM_LCD_WF34_BPCLCD34 (0x04U)       /*!< Bit mask for LCD_WF34_BPCLCD34. */
#define BS_LCD_WF34_BPCLCD34 (1U)          /*!< Bit field size in bits for LCD_WF34_BPCLCD34. */

/*! @brief Read current value of the LCD_WF34_BPCLCD34 field. */
#define BR_LCD_WF34_BPCLCD34(x) (BME_UBFX8(HW_LCD_WF34_ADDR(x), BP_LCD_WF34_BPCLCD34, BS_LCD_WF34_BPCLCD34))

