flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Format value for bitfield LCD_WF36_BPDLCD36. */
#define BF_LCD_WF36_BPDLCD36(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF36_BPDLCD36) & BM_LCD_WF36_BPDLCD36)

/*! @brief Set the BPDLCD36 field to a new value. */
#define BW_LCD_WF36_BPDLCD36(x, v) (BME_BFI8(HW_LCD_WF36_ADDR(x), ((uint8_t)(v) << BP_LCD_WF36_BPDLCD36), BP_LCD_WF36_BPDLCD36, 1))
/*@}*/

/*!
 * @name Register LCD_WF36, field BPELCD36[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF36_BPELCD36 (4U)          /*!< Bit position for LCD_WF36_BPELCD36. */
#define BM_LCD_WF36_BPELCD36 (0x10U)       /*!< Bit mask for LCD_WF36_BPELCD36. */
#define BS_LCD_WF36_BPELCD36 (1U)          /*!< Bit field size in bits for LCD_WF36_BPELCD36. */

/*! @brief Read current value of the LCD_WF36_BPELCD36 field. */
#define BR_LCD_WF36_BPELCD36(x) (BME_UBFX8(HW_LCD_WF36_ADDR(x), BP_LCD_WF36_BPELCD36, BS_LCD_WF36_BPELCD36))

/*! @brief Format value for bitfield LCD_WF36_BPELCD36. */
#define BF_LCD_WF36_BPELCD36(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF36_BPELCD36) & BM_LCD_WF36_BPELCD36)

/*! @brief Set the BPELCD36 field to a new value. */
#define BW_LCD_WF36_BPELCD36(x, v) (BME_BFI8(HW_LCD_WF36_ADDR(x), ((uint8_t)(v) << BP_LCD_WF36_BPELCD36), BP_LCD_WF36_BPELCD36, 1))
/*@}*/

/*!
 * @name Register LCD_WF36, field BPFLCD36[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF36_BPFLCD36 (5U)          /*!< Bit position for LCD_WF36_BPFLCD36. */
#define BM_LCD_WF36_BPFLCD36 (0x20U)       /*!< Bit mask for LCD_WF36_BPFLCD36. */
#define BS_LCD_WF36_BPFLCD36 (1U)          /*!< Bit field size in bits for LCD_WF36_BPFLCD36. */

/*! @brief Read current value of the LCD_WF36_BPFLCD36 field. */
#define BR_LCD_WF36_BPFLCD36(x) (BME_UBFX8(HW_LCD_WF36_ADDR(x), BP_LCD_WF36_BPFLCD36, BS_LCD_WF36_BPFLCD36))

/*! @brief Format value for bitfield LCD_WF36_BPFLCD36. */
#define BF_LCD_WF36_BPFLCD36(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF36_BPFLCD36) & BM_LCD_WF36_BPFLCD36)

/*! @brief Set the BPFLCD36 field to a new value. */
#define BW_LCD_WF36_BPFLCD36(x, v) (BME_BFI8(HW_LCD_WF36_ADDR(x), ((uint8_t)(v) << BP_LCD_WF36_BPFLCD36), BP_LCD_WF36_BPFLCD36, 1))
/*@}*/

/*!
 * @name Register LCD_WF36, field BPGLCD36[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF36_BPGLCD36 (6U)          /*!< Bit position for LCD_WF36_BPGLCD36. */
#define BM_LCD_WF36_BPGLCD36 (0x40U)       /*!< Bit mask for LCD_WF36_BPGLCD36. */
#define BS_LCD_WF36_BPGLCD36 (1U)          /*!< Bit field size in bits for LCD_WF36_BPGLCD36. */

/*! @brief Read current value of the LCD_WF36_BPGLCD36 field. */
#define BR_LCD_WF36_BPGLCD36(x) (BME_UBFX8(HW_LCD_WF36_ADDR(x), BP_LCD_WF36_BPGLCD36, BS_LCD_WF36_BPGLCD36))

/*! @brief Format value for bitfield LCD_WF36_BPGLCD36. */
#define BF_LCD_WF36_BPGLCD36(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF36_BPGLCD36) & BM_LCD_WF36_BPGLCD36)

/*! @brief Set the BPGLCD36 field to a new value. */
#define BW_LCD_WF36_BPGLCD36(x, v) (BME_BFI8(HW_LCD_WF36_ADDR(x), ((uint8_t)(v) << BP_LCD_WF36_BPGLCD36), BP_LCD_WF36_BPGLCD36, 1))
/*@}*/

/*!
 * @name Register LCD_WF36, field BPHLCD36[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF36_BPHLCD36 (7U)          /*!< Bit position for LCD_WF36_BPHLCD36. */
#define BM_LCD_WF36_BPHLCD36 (0x80U)       /*!< Bit mask for LCD_WF36_BPHLCD36. */
#define BS_LCD_WF36_BPHLCD36 (1U)          /*!< Bit field size in bits for LCD_WF36_BPHLCD36. */

/*! @brief Read current value of the LCD_WF36_BPHLCD36 field. */
#define BR_LCD_WF36_BPHLCD36(x) (BME_UBFX8(HW_LCD_WF36_ADDR(x), BP_LCD_WF36_BPHLCD36, BS_LCD_WF36_BPHLCD36))

/*! @brief Format value for bitfield LCD_WF36_BPHLCD36. */
#define BF_LCD_WF36_BPHLCD36(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF36_BPHLCD36) & BM_LCD_WF36_BPHLCD36)

/*! @brief Set the BPHLCD36 field to a new value. */
#define BW_LCD_WF36_BPHLCD36(x, v) (BME_BFI8(HW_LCD_WF36_ADDR(x), ((uint8_t)(v) << BP_LCD_WF36_BPHLCD36), BP_LCD_WF36_BPHLCD36, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF37 - LCD Waveform Register 37.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF37 - LCD Waveform Register 37. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf37
{
    uint8_t U;
    struct _hw_lcd_wf37_bitfields
    {
        uint8_t BPALCD37 : 1;          /*!< [0]  */
        uint8_t BPBLCD37 : 1;          /*!< [1]  */
        uint8_t BPCLCD37 : 1;          /*!< [2]  */
        uint8_t BPDLCD37 : 1;          /*!< [3]  */
        uint8_t BPELCD37 : 1;          /*!< [4]  */
        uint8_t BPFLCD37 : 1;          /*!< [5]  */
        uint8_t BPGLCD37 : 1;          /*!< [6]  */
        uint8_t BPHLCD37 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf37_t;

/*!
 * @name Constants and macros for entire LCD_WF37 register
 */
/*@{*/
#define HW_LCD_WF37_ADDR(x)      ((uint32_t)(x) + 0x45U)

#define HW_LCD_WF37(x)           (*(__IO hw_lcd_wf37_t *) HW_LCD_WF37_ADDR(x))
#define HW_LCD_WF37_RD(x)        (HW_LCD_WF37(x).U)
#define HW_LCD_WF37_WR(x, v)     (HW_LCD_WF37(x).U = (v))
#define HW_LCD_WF37_SET(x, v)    (BME_OR8(HW_LCD_WF37_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF37_CLR(x, v)    (BME_AND8(HW_LCD_WF37_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF37_TOG(x, v)    (BME_XOR8(HW_LCD_WF37_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF37 bitfields
 */

/*!
 * @name Register LCD_WF37, field BPALCD37[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF37_BPALCD37 (0U)          /*!< Bit position for LCD_WF37_BPALCD37. */
#define BM_LCD_WF37_BPALCD37 (0x01U)       /*!< Bit mask for LCD_WF37_BPALCD37. */
#define BS_LCD_WF37_BPALCD37 (1U)          /*!< Bit field size in bits for LCD_WF37_BPALCD37. */

/*! @brief Read current value of the LCD_WF37_BPALCD37 field. */
#define BR_LCD_WF37_BPALCD37(x) (BME_UBFX8(HW_LCD_WF37_ADDR(x), BP_LCD_WF37_BPALCD37, BS_LCD_WF37_BPALCD37))

/*! @brief Format value for bitfield LCD_WF37_BPALCD37. */
#define BF_LCD_WF37_BPALCD37(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF37_BPALCD37) & BM_LCD_WF37_BPALCD37)

/*! @brief Set the BPALCD37 field to a new value. */
#define BW_LCD_WF37_BPALCD37(x, v) (BME_BFI8(HW_LCD_WF37_ADDR(x), ((uint8_t)(v) << BP_LCD_WF37_BPALCD37), BP_LCD_WF37_BPALCD37, 1))
/*@}*/

/*!
 * @name Register LCD_WF37, field BPBLCD37[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF37_BPBLCD37 (1U)          /*!< Bit position for LCD_WF37_BPBLCD37. */
#define BM_LCD_WF37_BPBLCD37 (0x02U)       /*!< Bit mask for LCD_WF37_BPBLCD37. */
#define BS_LCD_WF37_BPBLCD37 (1U)          /*!< Bit field size in bits for LCD_WF37_BPBLCD37. */

/*! @brief Read current value of the LCD_WF37_BPBLCD37 field. */
#define BR_LCD_WF37_BPBLCD37(x) (BME_UBFX8(HW_LCD_WF37_ADDR(x), BP_LCD_WF37_BPBLCD37, BS_LCD_WF37_BPBLCD37))

/*! @brief Format value for bitfield LCD_WF37_BPBLCD37. */
#define BF_LCD_WF37_BPBLCD37(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF37_BPBLCD37) & BM_LCD_WF37_BPBLCD37)

