flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Set the BPBLCD37 field to a new value. */
#define BW_LCD_WF37_BPBLCD37(x, v) (BME_BFI8(HW_LCD_WF37_ADDR(x), ((uint8_t)(v) << BP_LCD_WF37_BPBLCD37), BP_LCD_WF37_BPBLCD37, 1))
/*@}*/

/*!
 * @name Register LCD_WF37, field BPCLCD37[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF37_BPCLCD37 (2U)          /*!< Bit position for LCD_WF37_BPCLCD37. */
#define BM_LCD_WF37_BPCLCD37 (0x04U)       /*!< Bit mask for LCD_WF37_BPCLCD37. */
#define BS_LCD_WF37_BPCLCD37 (1U)          /*!< Bit field size in bits for LCD_WF37_BPCLCD37. */

/*! @brief Read current value of the LCD_WF37_BPCLCD37 field. */
#define BR_LCD_WF37_BPCLCD37(x) (BME_UBFX8(HW_LCD_WF37_ADDR(x), BP_LCD_WF37_BPCLCD37, BS_LCD_WF37_BPCLCD37))

/*! @brief Format value for bitfield LCD_WF37_BPCLCD37. */
#define BF_LCD_WF37_BPCLCD37(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF37_BPCLCD37) & BM_LCD_WF37_BPCLCD37)

/*! @brief Set the BPCLCD37 field to a new value. */
#define BW_LCD_WF37_BPCLCD37(x, v) (BME_BFI8(HW_LCD_WF37_ADDR(x), ((uint8_t)(v) << BP_LCD_WF37_BPCLCD37), BP_LCD_WF37_BPCLCD37, 1))
/*@}*/

/*!
 * @name Register LCD_WF37, field BPDLCD37[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF37_BPDLCD37 (3U)          /*!< Bit position for LCD_WF37_BPDLCD37. */
#define BM_LCD_WF37_BPDLCD37 (0x08U)       /*!< Bit mask for LCD_WF37_BPDLCD37. */
#define BS_LCD_WF37_BPDLCD37 (1U)          /*!< Bit field size in bits for LCD_WF37_BPDLCD37. */

/*! @brief Read current value of the LCD_WF37_BPDLCD37 field. */
#define BR_LCD_WF37_BPDLCD37(x) (BME_UBFX8(HW_LCD_WF37_ADDR(x), BP_LCD_WF37_BPDLCD37, BS_LCD_WF37_BPDLCD37))

/*! @brief Format value for bitfield LCD_WF37_BPDLCD37. */
#define BF_LCD_WF37_BPDLCD37(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF37_BPDLCD37) & BM_LCD_WF37_BPDLCD37)

/*! @brief Set the BPDLCD37 field to a new value. */
#define BW_LCD_WF37_BPDLCD37(x, v) (BME_BFI8(HW_LCD_WF37_ADDR(x), ((uint8_t)(v) << BP_LCD_WF37_BPDLCD37), BP_LCD_WF37_BPDLCD37, 1))
/*@}*/

/*!
 * @name Register LCD_WF37, field BPELCD37[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF37_BPELCD37 (4U)          /*!< Bit position for LCD_WF37_BPELCD37. */
#define BM_LCD_WF37_BPELCD37 (0x10U)       /*!< Bit mask for LCD_WF37_BPELCD37. */
#define BS_LCD_WF37_BPELCD37 (1U)          /*!< Bit field size in bits for LCD_WF37_BPELCD37. */

/*! @brief Read current value of the LCD_WF37_BPELCD37 field. */
#define BR_LCD_WF37_BPELCD37(x) (BME_UBFX8(HW_LCD_WF37_ADDR(x), BP_LCD_WF37_BPELCD37, BS_LCD_WF37_BPELCD37))

/*! @brief Format value for bitfield LCD_WF37_BPELCD37. */
#define BF_LCD_WF37_BPELCD37(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF37_BPELCD37) & BM_LCD_WF37_BPELCD37)

/*! @brief Set the BPELCD37 field to a new value. */
#define BW_LCD_WF37_BPELCD37(x, v) (BME_BFI8(HW_LCD_WF37_ADDR(x), ((uint8_t)(v) << BP_LCD_WF37_BPELCD37), BP_LCD_WF37_BPELCD37, 1))
/*@}*/

/*!
 * @name Register LCD_WF37, field BPFLCD37[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF37_BPFLCD37 (5U)          /*!< Bit position for LCD_WF37_BPFLCD37. */
#define BM_LCD_WF37_BPFLCD37 (0x20U)       /*!< Bit mask for LCD_WF37_BPFLCD37. */
#define BS_LCD_WF37_BPFLCD37 (1U)          /*!< Bit field size in bits for LCD_WF37_BPFLCD37. */

/*! @brief Read current value of the LCD_WF37_BPFLCD37 field. */
#define BR_LCD_WF37_BPFLCD37(x) (BME_UBFX8(HW_LCD_WF37_ADDR(x), BP_LCD_WF37_BPFLCD37, BS_LCD_WF37_BPFLCD37))

/*! @brief Format value for bitfield LCD_WF37_BPFLCD37. */
#define BF_LCD_WF37_BPFLCD37(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF37_BPFLCD37) & BM_LCD_WF37_BPFLCD37)

/*! @brief Set the BPFLCD37 field to a new value. */
#define BW_LCD_WF37_BPFLCD37(x, v) (BME_BFI8(HW_LCD_WF37_ADDR(x), ((uint8_t)(v) << BP_LCD_WF37_BPFLCD37), BP_LCD_WF37_BPFLCD37, 1))
/*@}*/

/*!
 * @name Register LCD_WF37, field BPGLCD37[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF37_BPGLCD37 (6U)          /*!< Bit position for LCD_WF37_BPGLCD37. */
#define BM_LCD_WF37_BPGLCD37 (0x40U)       /*!< Bit mask for LCD_WF37_BPGLCD37. */
#define BS_LCD_WF37_BPGLCD37 (1U)          /*!< Bit field size in bits for LCD_WF37_BPGLCD37. */

/*! @brief Read current value of the LCD_WF37_BPGLCD37 field. */
#define BR_LCD_WF37_BPGLCD37(x) (BME_UBFX8(HW_LCD_WF37_ADDR(x), BP_LCD_WF37_BPGLCD37, BS_LCD_WF37_BPGLCD37))

/*! @brief Format value for bitfield LCD_WF37_BPGLCD37. */
#define BF_LCD_WF37_BPGLCD37(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF37_BPGLCD37) & BM_LCD_WF37_BPGLCD37)

/*! @brief Set the BPGLCD37 field to a new value. */
#define BW_LCD_WF37_BPGLCD37(x, v) (BME_BFI8(HW_LCD_WF37_ADDR(x), ((uint8_t)(v) << BP_LCD_WF37_BPGLCD37), BP_LCD_WF37_BPGLCD37, 1))
/*@}*/

/*!
 * @name Register LCD_WF37, field BPHLCD37[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF37_BPHLCD37 (7U)          /*!< Bit position for LCD_WF37_BPHLCD37. */
#define BM_LCD_WF37_BPHLCD37 (0x80U)       /*!< Bit mask for LCD_WF37_BPHLCD37. */
#define BS_LCD_WF37_BPHLCD37 (1U)          /*!< Bit field size in bits for LCD_WF37_BPHLCD37. */

/*! @brief Read current value of the LCD_WF37_BPHLCD37 field. */
#define BR_LCD_WF37_BPHLCD37(x) (BME_UBFX8(HW_LCD_WF37_ADDR(x), BP_LCD_WF37_BPHLCD37, BS_LCD_WF37_BPHLCD37))

/*! @brief Format value for bitfield LCD_WF37_BPHLCD37. */
#define BF_LCD_WF37_BPHLCD37(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF37_BPHLCD37) & BM_LCD_WF37_BPHLCD37)

/*! @brief Set the BPHLCD37 field to a new value. */
#define BW_LCD_WF37_BPHLCD37(x, v) (BME_BFI8(HW_LCD_WF37_ADDR(x), ((uint8_t)(v) << BP_LCD_WF37_BPHLCD37), BP_LCD_WF37_BPHLCD37, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF38 - LCD Waveform Register 38.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF38 - LCD Waveform Register 38. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf38
{
    uint8_t U;
    struct _hw_lcd_wf38_bitfields
    {
        uint8_t BPALCD38 : 1;          /*!< [0]  */
        uint8_t BPBLCD38 : 1;          /*!< [1]  */
        uint8_t BPCLCD38 : 1;          /*!< [2]  */
        uint8_t BPDLCD38 : 1;          /*!< [3]  */
        uint8_t BPELCD38 : 1;          /*!< [4]  */
        uint8_t BPFLCD38 : 1;          /*!< [5]  */
        uint8_t BPGLCD38 : 1;          /*!< [6]  */
        uint8_t BPHLCD38 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf38_t;

/*!
 * @name Constants and macros for entire LCD_WF38 register
 */
/*@{*/
#define HW_LCD_WF38_ADDR(x)      ((uint32_t)(x) + 0x46U)

#define HW_LCD_WF38(x)           (*(__IO hw_lcd_wf38_t *) HW_LCD_WF38_ADDR(x))
#define HW_LCD_WF38_RD(x)        (HW_LCD_WF38(x).U)
#define HW_LCD_WF38_WR(x, v)     (HW_LCD_WF38(x).U = (v))
#define HW_LCD_WF38_SET(x, v)    (BME_OR8(HW_LCD_WF38_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF38_CLR(x, v)    (BME_AND8(HW_LCD_WF38_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF38_TOG(x, v)    (BME_XOR8(HW_LCD_WF38_ADDR(x), (uint8_t)(v)))
/*@}*/

