flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Read current value of the LCD_WF38_BPHLCD38 field. */
#define BR_LCD_WF38_BPHLCD38(x) (BME_UBFX8(HW_LCD_WF38_ADDR(x), BP_LCD_WF38_BPHLCD38, BS_LCD_WF38_BPHLCD38))

/*! @brief Format value for bitfield LCD_WF38_BPHLCD38. */
#define BF_LCD_WF38_BPHLCD38(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF38_BPHLCD38) & BM_LCD_WF38_BPHLCD38)

/*! @brief Set the BPHLCD38 field to a new value. */
#define BW_LCD_WF38_BPHLCD38(x, v) (BME_BFI8(HW_LCD_WF38_ADDR(x), ((uint8_t)(v) << BP_LCD_WF38_BPHLCD38), BP_LCD_WF38_BPHLCD38, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF39 - LCD Waveform Register 39.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF39 - LCD Waveform Register 39. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf39
{
    uint8_t U;
    struct _hw_lcd_wf39_bitfields
    {
        uint8_t BPALCD39 : 1;          /*!< [0]  */
        uint8_t BPBLCD39 : 1;          /*!< [1]  */
        uint8_t BPCLCD39 : 1;          /*!< [2]  */
        uint8_t BPDLCD39 : 1;          /*!< [3]  */
        uint8_t BPELCD39 : 1;          /*!< [4]  */
        uint8_t BPFLCD39 : 1;          /*!< [5]  */
        uint8_t BPGLCD39 : 1;          /*!< [6]  */
        uint8_t BPHLCD39 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf39_t;

/*!
 * @name Constants and macros for entire LCD_WF39 register
 */
/*@{*/
#define HW_LCD_WF39_ADDR(x)      ((uint32_t)(x) + 0x47U)

#define HW_LCD_WF39(x)           (*(__IO hw_lcd_wf39_t *) HW_LCD_WF39_ADDR(x))
#define HW_LCD_WF39_RD(x)        (HW_LCD_WF39(x).U)
#define HW_LCD_WF39_WR(x, v)     (HW_LCD_WF39(x).U = (v))
#define HW_LCD_WF39_SET(x, v)    (BME_OR8(HW_LCD_WF39_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF39_CLR(x, v)    (BME_AND8(HW_LCD_WF39_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF39_TOG(x, v)    (BME_XOR8(HW_LCD_WF39_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF39 bitfields
 */

/*!
 * @name Register LCD_WF39, field BPALCD39[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF39_BPALCD39 (0U)          /*!< Bit position for LCD_WF39_BPALCD39. */
#define BM_LCD_WF39_BPALCD39 (0x01U)       /*!< Bit mask for LCD_WF39_BPALCD39. */
#define BS_LCD_WF39_BPALCD39 (1U)          /*!< Bit field size in bits for LCD_WF39_BPALCD39. */

/*! @brief Read current value of the LCD_WF39_BPALCD39 field. */
#define BR_LCD_WF39_BPALCD39(x) (BME_UBFX8(HW_LCD_WF39_ADDR(x), BP_LCD_WF39_BPALCD39, BS_LCD_WF39_BPALCD39))

/*! @brief Format value for bitfield LCD_WF39_BPALCD39. */
#define BF_LCD_WF39_BPALCD39(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF39_BPALCD39) & BM_LCD_WF39_BPALCD39)

/*! @brief Set the BPALCD39 field to a new value. */
#define BW_LCD_WF39_BPALCD39(x, v) (BME_BFI8(HW_LCD_WF39_ADDR(x), ((uint8_t)(v) << BP_LCD_WF39_BPALCD39), BP_LCD_WF39_BPALCD39, 1))
/*@}*/

/*!
 * @name Register LCD_WF39, field BPBLCD39[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF39_BPBLCD39 (1U)          /*!< Bit position for LCD_WF39_BPBLCD39. */
#define BM_LCD_WF39_BPBLCD39 (0x02U)       /*!< Bit mask for LCD_WF39_BPBLCD39. */
#define BS_LCD_WF39_BPBLCD39 (1U)          /*!< Bit field size in bits for LCD_WF39_BPBLCD39. */

/*! @brief Read current value of the LCD_WF39_BPBLCD39 field. */
#define BR_LCD_WF39_BPBLCD39(x) (BME_UBFX8(HW_LCD_WF39_ADDR(x), BP_LCD_WF39_BPBLCD39, BS_LCD_WF39_BPBLCD39))

/*! @brief Format value for bitfield LCD_WF39_BPBLCD39. */
#define BF_LCD_WF39_BPBLCD39(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF39_BPBLCD39) & BM_LCD_WF39_BPBLCD39)

/*! @brief Set the BPBLCD39 field to a new value. */
#define BW_LCD_WF39_BPBLCD39(x, v) (BME_BFI8(HW_LCD_WF39_ADDR(x), ((uint8_t)(v) << BP_LCD_WF39_BPBLCD39), BP_LCD_WF39_BPBLCD39, 1))
/*@}*/

/*!
 * @name Register LCD_WF39, field BPCLCD39[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF39_BPCLCD39 (2U)          /*!< Bit position for LCD_WF39_BPCLCD39. */
#define BM_LCD_WF39_BPCLCD39 (0x04U)       /*!< Bit mask for LCD_WF39_BPCLCD39. */
#define BS_LCD_WF39_BPCLCD39 (1U)          /*!< Bit field size in bits for LCD_WF39_BPCLCD39. */

/*! @brief Read current value of the LCD_WF39_BPCLCD39 field. */
#define BR_LCD_WF39_BPCLCD39(x) (BME_UBFX8(HW_LCD_WF39_ADDR(x), BP_LCD_WF39_BPCLCD39, BS_LCD_WF39_BPCLCD39))

/*! @brief Format value for bitfield LCD_WF39_BPCLCD39. */
#define BF_LCD_WF39_BPCLCD39(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF39_BPCLCD39) & BM_LCD_WF39_BPCLCD39)

/*! @brief Set the BPCLCD39 field to a new value. */
#define BW_LCD_WF39_BPCLCD39(x, v) (BME_BFI8(HW_LCD_WF39_ADDR(x), ((uint8_t)(v) << BP_LCD_WF39_BPCLCD39), BP_LCD_WF39_BPCLCD39, 1))
/*@}*/

/*!
 * @name Register LCD_WF39, field BPDLCD39[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF39_BPDLCD39 (3U)          /*!< Bit position for LCD_WF39_BPDLCD39. */
#define BM_LCD_WF39_BPDLCD39 (0x08U)       /*!< Bit mask for LCD_WF39_BPDLCD39. */
#define BS_LCD_WF39_BPDLCD39 (1U)          /*!< Bit field size in bits for LCD_WF39_BPDLCD39. */

/*! @brief Read current value of the LCD_WF39_BPDLCD39 field. */
#define BR_LCD_WF39_BPDLCD39(x) (BME_UBFX8(HW_LCD_WF39_ADDR(x), BP_LCD_WF39_BPDLCD39, BS_LCD_WF39_BPDLCD39))

/*! @brief Format value for bitfield LCD_WF39_BPDLCD39. */
#define BF_LCD_WF39_BPDLCD39(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF39_BPDLCD39) & BM_LCD_WF39_BPDLCD39)

/*! @brief Set the BPDLCD39 field to a new value. */
#define BW_LCD_WF39_BPDLCD39(x, v) (BME_BFI8(HW_LCD_WF39_ADDR(x), ((uint8_t)(v) << BP_LCD_WF39_BPDLCD39), BP_LCD_WF39_BPDLCD39, 1))
/*@}*/

/*!
 * @name Register LCD_WF39, field BPELCD39[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF39_BPELCD39 (4U)          /*!< Bit position for LCD_WF39_BPELCD39. */
#define BM_LCD_WF39_BPELCD39 (0x10U)       /*!< Bit mask for LCD_WF39_BPELCD39. */
#define BS_LCD_WF39_BPELCD39 (1U)          /*!< Bit field size in bits for LCD_WF39_BPELCD39. */

/*! @brief Read current value of the LCD_WF39_BPELCD39 field. */
#define BR_LCD_WF39_BPELCD39(x) (BME_UBFX8(HW_LCD_WF39_ADDR(x), BP_LCD_WF39_BPELCD39, BS_LCD_WF39_BPELCD39))

/*! @brief Format value for bitfield LCD_WF39_BPELCD39. */
#define BF_LCD_WF39_BPELCD39(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF39_BPELCD39) & BM_LCD_WF39_BPELCD39)

/*! @brief Set the BPELCD39 field to a new value. */
#define BW_LCD_WF39_BPELCD39(x, v) (BME_BFI8(HW_LCD_WF39_ADDR(x), ((uint8_t)(v) << BP_LCD_WF39_BPELCD39), BP_LCD_WF39_BPELCD39, 1))
/*@}*/

/*!
 * @name Register LCD_WF39, field BPFLCD39[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF39_BPFLCD39 (5U)          /*!< Bit position for LCD_WF39_BPFLCD39. */
#define BM_LCD_WF39_BPFLCD39 (0x20U)       /*!< Bit mask for LCD_WF39_BPFLCD39. */
#define BS_LCD_WF39_BPFLCD39 (1U)          /*!< Bit field size in bits for LCD_WF39_BPFLCD39. */

/*! @brief Read current value of the LCD_WF39_BPFLCD39 field. */
#define BR_LCD_WF39_BPFLCD39(x) (BME_UBFX8(HW_LCD_WF39_ADDR(x), BP_LCD_WF39_BPFLCD39, BS_LCD_WF39_BPFLCD39))

/*! @brief Format value for bitfield LCD_WF39_BPFLCD39. */
#define BF_LCD_WF39_BPFLCD39(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF39_BPFLCD39) & BM_LCD_WF39_BPFLCD39)

/*! @brief Set the BPFLCD39 field to a new value. */
#define BW_LCD_WF39_BPFLCD39(x, v) (BME_BFI8(HW_LCD_WF39_ADDR(x), ((uint8_t)(v) << BP_LCD_WF39_BPFLCD39), BP_LCD_WF39_BPFLCD39, 1))
/*@}*/

/*!
 * @name Register LCD_WF39, field BPGLCD39[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF39_BPGLCD39 (6U)          /*!< Bit position for LCD_WF39_BPGLCD39. */
#define BM_LCD_WF39_BPGLCD39 (0x40U)       /*!< Bit mask for LCD_WF39_BPGLCD39. */
#define BS_LCD_WF39_BPGLCD39 (1U)          /*!< Bit field size in bits for LCD_WF39_BPGLCD39. */

