flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Read current value of the LCD_WF41_BPALCD41 field. */
#define BR_LCD_WF41_BPALCD41(x) (BME_UBFX8(HW_LCD_WF41_ADDR(x), BP_LCD_WF41_BPALCD41, BS_LCD_WF41_BPALCD41))

/*! @brief Format value for bitfield LCD_WF41_BPALCD41. */
#define BF_LCD_WF41_BPALCD41(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF41_BPALCD41) & BM_LCD_WF41_BPALCD41)

/*! @brief Set the BPALCD41 field to a new value. */
#define BW_LCD_WF41_BPALCD41(x, v) (BME_BFI8(HW_LCD_WF41_ADDR(x), ((uint8_t)(v) << BP_LCD_WF41_BPALCD41), BP_LCD_WF41_BPALCD41, 1))
/*@}*/

/*!
 * @name Register LCD_WF41, field BPBLCD41[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF41_BPBLCD41 (1U)          /*!< Bit position for LCD_WF41_BPBLCD41. */
#define BM_LCD_WF41_BPBLCD41 (0x02U)       /*!< Bit mask for LCD_WF41_BPBLCD41. */
#define BS_LCD_WF41_BPBLCD41 (1U)          /*!< Bit field size in bits for LCD_WF41_BPBLCD41. */

/*! @brief Read current value of the LCD_WF41_BPBLCD41 field. */
#define BR_LCD_WF41_BPBLCD41(x) (BME_UBFX8(HW_LCD_WF41_ADDR(x), BP_LCD_WF41_BPBLCD41, BS_LCD_WF41_BPBLCD41))

/*! @brief Format value for bitfield LCD_WF41_BPBLCD41. */
#define BF_LCD_WF41_BPBLCD41(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF41_BPBLCD41) & BM_LCD_WF41_BPBLCD41)

/*! @brief Set the BPBLCD41 field to a new value. */
#define BW_LCD_WF41_BPBLCD41(x, v) (BME_BFI8(HW_LCD_WF41_ADDR(x), ((uint8_t)(v) << BP_LCD_WF41_BPBLCD41), BP_LCD_WF41_BPBLCD41, 1))
/*@}*/

/*!
 * @name Register LCD_WF41, field BPCLCD41[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF41_BPCLCD41 (2U)          /*!< Bit position for LCD_WF41_BPCLCD41. */
#define BM_LCD_WF41_BPCLCD41 (0x04U)       /*!< Bit mask for LCD_WF41_BPCLCD41. */
#define BS_LCD_WF41_BPCLCD41 (1U)          /*!< Bit field size in bits for LCD_WF41_BPCLCD41. */

/*! @brief Read current value of the LCD_WF41_BPCLCD41 field. */
#define BR_LCD_WF41_BPCLCD41(x) (BME_UBFX8(HW_LCD_WF41_ADDR(x), BP_LCD_WF41_BPCLCD41, BS_LCD_WF41_BPCLCD41))

/*! @brief Format value for bitfield LCD_WF41_BPCLCD41. */
#define BF_LCD_WF41_BPCLCD41(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF41_BPCLCD41) & BM_LCD_WF41_BPCLCD41)

/*! @brief Set the BPCLCD41 field to a new value. */
#define BW_LCD_WF41_BPCLCD41(x, v) (BME_BFI8(HW_LCD_WF41_ADDR(x), ((uint8_t)(v) << BP_LCD_WF41_BPCLCD41), BP_LCD_WF41_BPCLCD41, 1))
/*@}*/

/*!
 * @name Register LCD_WF41, field BPDLCD41[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF41_BPDLCD41 (3U)          /*!< Bit position for LCD_WF41_BPDLCD41. */
#define BM_LCD_WF41_BPDLCD41 (0x08U)       /*!< Bit mask for LCD_WF41_BPDLCD41. */
#define BS_LCD_WF41_BPDLCD41 (1U)          /*!< Bit field size in bits for LCD_WF41_BPDLCD41. */

/*! @brief Read current value of the LCD_WF41_BPDLCD41 field. */
#define BR_LCD_WF41_BPDLCD41(x) (BME_UBFX8(HW_LCD_WF41_ADDR(x), BP_LCD_WF41_BPDLCD41, BS_LCD_WF41_BPDLCD41))

/*! @brief Format value for bitfield LCD_WF41_BPDLCD41. */
#define BF_LCD_WF41_BPDLCD41(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF41_BPDLCD41) & BM_LCD_WF41_BPDLCD41)

/*! @brief Set the BPDLCD41 field to a new value. */
#define BW_LCD_WF41_BPDLCD41(x, v) (BME_BFI8(HW_LCD_WF41_ADDR(x), ((uint8_t)(v) << BP_LCD_WF41_BPDLCD41), BP_LCD_WF41_BPDLCD41, 1))
/*@}*/

/*!
 * @name Register LCD_WF41, field BPELCD41[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF41_BPELCD41 (4U)          /*!< Bit position for LCD_WF41_BPELCD41. */
#define BM_LCD_WF41_BPELCD41 (0x10U)       /*!< Bit mask for LCD_WF41_BPELCD41. */
#define BS_LCD_WF41_BPELCD41 (1U)          /*!< Bit field size in bits for LCD_WF41_BPELCD41. */

/*! @brief Read current value of the LCD_WF41_BPELCD41 field. */
#define BR_LCD_WF41_BPELCD41(x) (BME_UBFX8(HW_LCD_WF41_ADDR(x), BP_LCD_WF41_BPELCD41, BS_LCD_WF41_BPELCD41))

/*! @brief Format value for bitfield LCD_WF41_BPELCD41. */
#define BF_LCD_WF41_BPELCD41(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF41_BPELCD41) & BM_LCD_WF41_BPELCD41)

/*! @brief Set the BPELCD41 field to a new value. */
#define BW_LCD_WF41_BPELCD41(x, v) (BME_BFI8(HW_LCD_WF41_ADDR(x), ((uint8_t)(v) << BP_LCD_WF41_BPELCD41), BP_LCD_WF41_BPELCD41, 1))
/*@}*/

/*!
 * @name Register LCD_WF41, field BPFLCD41[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF41_BPFLCD41 (5U)          /*!< Bit position for LCD_WF41_BPFLCD41. */
#define BM_LCD_WF41_BPFLCD41 (0x20U)       /*!< Bit mask for LCD_WF41_BPFLCD41. */
#define BS_LCD_WF41_BPFLCD41 (1U)          /*!< Bit field size in bits for LCD_WF41_BPFLCD41. */

/*! @brief Read current value of the LCD_WF41_BPFLCD41 field. */
#define BR_LCD_WF41_BPFLCD41(x) (BME_UBFX8(HW_LCD_WF41_ADDR(x), BP_LCD_WF41_BPFLCD41, BS_LCD_WF41_BPFLCD41))

/*! @brief Format value for bitfield LCD_WF41_BPFLCD41. */
#define BF_LCD_WF41_BPFLCD41(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF41_BPFLCD41) & BM_LCD_WF41_BPFLCD41)

/*! @brief Set the BPFLCD41 field to a new value. */
#define BW_LCD_WF41_BPFLCD41(x, v) (BME_BFI8(HW_LCD_WF41_ADDR(x), ((uint8_t)(v) << BP_LCD_WF41_BPFLCD41), BP_LCD_WF41_BPFLCD41, 1))
/*@}*/

/*!
 * @name Register LCD_WF41, field BPGLCD41[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF41_BPGLCD41 (6U)          /*!< Bit position for LCD_WF41_BPGLCD41. */
#define BM_LCD_WF41_BPGLCD41 (0x40U)       /*!< Bit mask for LCD_WF41_BPGLCD41. */
#define BS_LCD_WF41_BPGLCD41 (1U)          /*!< Bit field size in bits for LCD_WF41_BPGLCD41. */

