flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Read current value of the LCD_WF45_BPELCD45 field. */
#define BR_LCD_WF45_BPELCD45(x) (BME_UBFX8(HW_LCD_WF45_ADDR(x), BP_LCD_WF45_BPELCD45, BS_LCD_WF45_BPELCD45))

/*! @brief Format value for bitfield LCD_WF45_BPELCD45. */
#define BF_LCD_WF45_BPELCD45(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF45_BPELCD45) & BM_LCD_WF45_BPELCD45)

/*! @brief Set the BPELCD45 field to a new value. */
#define BW_LCD_WF45_BPELCD45(x, v) (BME_BFI8(HW_LCD_WF45_ADDR(x), ((uint8_t)(v) << BP_LCD_WF45_BPELCD45), BP_LCD_WF45_BPELCD45, 1))
/*@}*/

/*!
 * @name Register LCD_WF45, field BPFLCD45[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF45_BPFLCD45 (5U)          /*!< Bit position for LCD_WF45_BPFLCD45. */
#define BM_LCD_WF45_BPFLCD45 (0x20U)       /*!< Bit mask for LCD_WF45_BPFLCD45. */
#define BS_LCD_WF45_BPFLCD45 (1U)          /*!< Bit field size in bits for LCD_WF45_BPFLCD45. */

/*! @brief Read current value of the LCD_WF45_BPFLCD45 field. */
#define BR_LCD_WF45_BPFLCD45(x) (BME_UBFX8(HW_LCD_WF45_ADDR(x), BP_LCD_WF45_BPFLCD45, BS_LCD_WF45_BPFLCD45))

/*! @brief Format value for bitfield LCD_WF45_BPFLCD45. */
#define BF_LCD_WF45_BPFLCD45(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF45_BPFLCD45) & BM_LCD_WF45_BPFLCD45)

/*! @brief Set the BPFLCD45 field to a new value. */
#define BW_LCD_WF45_BPFLCD45(x, v) (BME_BFI8(HW_LCD_WF45_ADDR(x), ((uint8_t)(v) << BP_LCD_WF45_BPFLCD45), BP_LCD_WF45_BPFLCD45, 1))
/*@}*/

/*!
 * @name Register LCD_WF45, field BPGLCD45[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF45_BPGLCD45 (6U)          /*!< Bit position for LCD_WF45_BPGLCD45. */
#define BM_LCD_WF45_BPGLCD45 (0x40U)       /*!< Bit mask for LCD_WF45_BPGLCD45. */
#define BS_LCD_WF45_BPGLCD45 (1U)          /*!< Bit field size in bits for LCD_WF45_BPGLCD45. */

/*! @brief Read current value of the LCD_WF45_BPGLCD45 field. */
#define BR_LCD_WF45_BPGLCD45(x) (BME_UBFX8(HW_LCD_WF45_ADDR(x), BP_LCD_WF45_BPGLCD45, BS_LCD_WF45_BPGLCD45))

/*! @brief Format value for bitfield LCD_WF45_BPGLCD45. */
#define BF_LCD_WF45_BPGLCD45(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF45_BPGLCD45) & BM_LCD_WF45_BPGLCD45)

/*! @brief Set the BPGLCD45 field to a new value. */
#define BW_LCD_WF45_BPGLCD45(x, v) (BME_BFI8(HW_LCD_WF45_ADDR(x), ((uint8_t)(v) << BP_LCD_WF45_BPGLCD45), BP_LCD_WF45_BPGLCD45, 1))
/*@}*/

/*!
 * @name Register LCD_WF45, field BPHLCD45[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF45_BPHLCD45 (7U)          /*!< Bit position for LCD_WF45_BPHLCD45. */
#define BM_LCD_WF45_BPHLCD45 (0x80U)       /*!< Bit mask for LCD_WF45_BPHLCD45. */
#define BS_LCD_WF45_BPHLCD45 (1U)          /*!< Bit field size in bits for LCD_WF45_BPHLCD45. */

/*! @brief Read current value of the LCD_WF45_BPHLCD45 field. */
#define BR_LCD_WF45_BPHLCD45(x) (BME_UBFX8(HW_LCD_WF45_ADDR(x), BP_LCD_WF45_BPHLCD45, BS_LCD_WF45_BPHLCD45))

/*! @brief Format value for bitfield LCD_WF45_BPHLCD45. */
#define BF_LCD_WF45_BPHLCD45(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF45_BPHLCD45) & BM_LCD_WF45_BPHLCD45)

/*! @brief Set the BPHLCD45 field to a new value. */
#define BW_LCD_WF45_BPHLCD45(x, v) (BME_BFI8(HW_LCD_WF45_ADDR(x), ((uint8_t)(v) << BP_LCD_WF45_BPHLCD45), BP_LCD_WF45_BPHLCD45, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF46 - LCD Waveform Register 46.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF46 - LCD Waveform Register 46. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf46
{
    uint8_t U;
    struct _hw_lcd_wf46_bitfields
    {
        uint8_t BPALCD46 : 1;          /*!< [0]  */
        uint8_t BPBLCD46 : 1;          /*!< [1]  */
        uint8_t BPCLCD46 : 1;          /*!< [2]  */
        uint8_t BPDLCD46 : 1;          /*!< [3]  */
        uint8_t BPELCD46 : 1;          /*!< [4]  */
        uint8_t BPFLCD46 : 1;          /*!< [5]  */
        uint8_t BPGLCD46 : 1;          /*!< [6]  */
        uint8_t BPHLCD46 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf46_t;

/*!
 * @name Constants and macros for entire LCD_WF46 register
 */
/*@{*/
#define HW_LCD_WF46_ADDR(x)      ((uint32_t)(x) + 0x4EU)

#define HW_LCD_WF46(x)           (*(__IO hw_lcd_wf46_t *) HW_LCD_WF46_ADDR(x))
#define HW_LCD_WF46_RD(x)        (HW_LCD_WF46(x).U)
#define HW_LCD_WF46_WR(x, v)     (HW_LCD_WF46(x).U = (v))
#define HW_LCD_WF46_SET(x, v)    (BME_OR8(HW_LCD_WF46_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF46_CLR(x, v)    (BME_AND8(HW_LCD_WF46_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF46_TOG(x, v)    (BME_XOR8(HW_LCD_WF46_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF46 bitfields
 */

/*!
 * @name Register LCD_WF46, field BPALCD46[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF46_BPALCD46 (0U)          /*!< Bit position for LCD_WF46_BPALCD46. */
#define BM_LCD_WF46_BPALCD46 (0x01U)       /*!< Bit mask for LCD_WF46_BPALCD46. */
#define BS_LCD_WF46_BPALCD46 (1U)          /*!< Bit field size in bits for LCD_WF46_BPALCD46. */

/*! @brief Read current value of the LCD_WF46_BPALCD46 field. */
#define BR_LCD_WF46_BPALCD46(x) (BME_UBFX8(HW_LCD_WF46_ADDR(x), BP_LCD_WF46_BPALCD46, BS_LCD_WF46_BPALCD46))

/*! @brief Format value for bitfield LCD_WF46_BPALCD46. */
#define BF_LCD_WF46_BPALCD46(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF46_BPALCD46) & BM_LCD_WF46_BPALCD46)

/*! @brief Set the BPALCD46 field to a new value. */
#define BW_LCD_WF46_BPALCD46(x, v) (BME_BFI8(HW_LCD_WF46_ADDR(x), ((uint8_t)(v) << BP_LCD_WF46_BPALCD46), BP_LCD_WF46_BPALCD46, 1))
/*@}*/

/*!
 * @name Register LCD_WF46, field BPBLCD46[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF46_BPBLCD46 (1U)          /*!< Bit position for LCD_WF46_BPBLCD46. */
#define BM_LCD_WF46_BPBLCD46 (0x02U)       /*!< Bit mask for LCD_WF46_BPBLCD46. */
#define BS_LCD_WF46_BPBLCD46 (1U)          /*!< Bit field size in bits for LCD_WF46_BPBLCD46. */

/*! @brief Read current value of the LCD_WF46_BPBLCD46 field. */
#define BR_LCD_WF46_BPBLCD46(x) (BME_UBFX8(HW_LCD_WF46_ADDR(x), BP_LCD_WF46_BPBLCD46, BS_LCD_WF46_BPBLCD46))

/*! @brief Format value for bitfield LCD_WF46_BPBLCD46. */
#define BF_LCD_WF46_BPBLCD46(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF46_BPBLCD46) & BM_LCD_WF46_BPBLCD46)

/*! @brief Set the BPBLCD46 field to a new value. */
#define BW_LCD_WF46_BPBLCD46(x, v) (BME_BFI8(HW_LCD_WF46_ADDR(x), ((uint8_t)(v) << BP_LCD_WF46_BPBLCD46), BP_LCD_WF46_BPBLCD46, 1))
/*@}*/

/*!
 * @name Register LCD_WF46, field BPCLCD46[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF46_BPCLCD46 (2U)          /*!< Bit position for LCD_WF46_BPCLCD46. */
#define BM_LCD_WF46_BPCLCD46 (0x04U)       /*!< Bit mask for LCD_WF46_BPCLCD46. */
#define BS_LCD_WF46_BPCLCD46 (1U)          /*!< Bit field size in bits for LCD_WF46_BPCLCD46. */

/*! @brief Read current value of the LCD_WF46_BPCLCD46 field. */
#define BR_LCD_WF46_BPCLCD46(x) (BME_UBFX8(HW_LCD_WF46_ADDR(x), BP_LCD_WF46_BPCLCD46, BS_LCD_WF46_BPCLCD46))

/*! @brief Format value for bitfield LCD_WF46_BPCLCD46. */
#define BF_LCD_WF46_BPCLCD46(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF46_BPCLCD46) & BM_LCD_WF46_BPCLCD46)

