flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Read current value of the LCD_WF49_BPCLCD49 field. */
#define BR_LCD_WF49_BPCLCD49(x) (BME_UBFX8(HW_LCD_WF49_ADDR(x), BP_LCD_WF49_BPCLCD49, BS_LCD_WF49_BPCLCD49))

/*! @brief Format value for bitfield LCD_WF49_BPCLCD49. */
#define BF_LCD_WF49_BPCLCD49(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF49_BPCLCD49) & BM_LCD_WF49_BPCLCD49)

/*! @brief Set the BPCLCD49 field to a new value. */
#define BW_LCD_WF49_BPCLCD49(x, v) (BME_BFI8(HW_LCD_WF49_ADDR(x), ((uint8_t)(v) << BP_LCD_WF49_BPCLCD49), BP_LCD_WF49_BPCLCD49, 1))
/*@}*/

/*!
 * @name Register LCD_WF49, field BPDLCD49[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF49_BPDLCD49 (3U)          /*!< Bit position for LCD_WF49_BPDLCD49. */
#define BM_LCD_WF49_BPDLCD49 (0x08U)       /*!< Bit mask for LCD_WF49_BPDLCD49. */
#define BS_LCD_WF49_BPDLCD49 (1U)          /*!< Bit field size in bits for LCD_WF49_BPDLCD49. */

/*! @brief Read current value of the LCD_WF49_BPDLCD49 field. */
#define BR_LCD_WF49_BPDLCD49(x) (BME_UBFX8(HW_LCD_WF49_ADDR(x), BP_LCD_WF49_BPDLCD49, BS_LCD_WF49_BPDLCD49))

/*! @brief Format value for bitfield LCD_WF49_BPDLCD49. */
#define BF_LCD_WF49_BPDLCD49(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF49_BPDLCD49) & BM_LCD_WF49_BPDLCD49)

/*! @brief Set the BPDLCD49 field to a new value. */
#define BW_LCD_WF49_BPDLCD49(x, v) (BME_BFI8(HW_LCD_WF49_ADDR(x), ((uint8_t)(v) << BP_LCD_WF49_BPDLCD49), BP_LCD_WF49_BPDLCD49, 1))
/*@}*/

/*!
 * @name Register LCD_WF49, field BPELCD49[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF49_BPELCD49 (4U)          /*!< Bit position for LCD_WF49_BPELCD49. */
#define BM_LCD_WF49_BPELCD49 (0x10U)       /*!< Bit mask for LCD_WF49_BPELCD49. */
#define BS_LCD_WF49_BPELCD49 (1U)          /*!< Bit field size in bits for LCD_WF49_BPELCD49. */

/*! @brief Read current value of the LCD_WF49_BPELCD49 field. */
#define BR_LCD_WF49_BPELCD49(x) (BME_UBFX8(HW_LCD_WF49_ADDR(x), BP_LCD_WF49_BPELCD49, BS_LCD_WF49_BPELCD49))

/*! @brief Format value for bitfield LCD_WF49_BPELCD49. */
#define BF_LCD_WF49_BPELCD49(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF49_BPELCD49) & BM_LCD_WF49_BPELCD49)

/*! @brief Set the BPELCD49 field to a new value. */
#define BW_LCD_WF49_BPELCD49(x, v) (BME_BFI8(HW_LCD_WF49_ADDR(x), ((uint8_t)(v) << BP_LCD_WF49_BPELCD49), BP_LCD_WF49_BPELCD49, 1))
/*@}*/

/*!
 * @name Register LCD_WF49, field BPFLCD49[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF49_BPFLCD49 (5U)          /*!< Bit position for LCD_WF49_BPFLCD49. */
#define BM_LCD_WF49_BPFLCD49 (0x20U)       /*!< Bit mask for LCD_WF49_BPFLCD49. */
#define BS_LCD_WF49_BPFLCD49 (1U)          /*!< Bit field size in bits for LCD_WF49_BPFLCD49. */

/*! @brief Read current value of the LCD_WF49_BPFLCD49 field. */
#define BR_LCD_WF49_BPFLCD49(x) (BME_UBFX8(HW_LCD_WF49_ADDR(x), BP_LCD_WF49_BPFLCD49, BS_LCD_WF49_BPFLCD49))

/*! @brief Format value for bitfield LCD_WF49_BPFLCD49. */
#define BF_LCD_WF49_BPFLCD49(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF49_BPFLCD49) & BM_LCD_WF49_BPFLCD49)

/*! @brief Set the BPFLCD49 field to a new value. */
#define BW_LCD_WF49_BPFLCD49(x, v) (BME_BFI8(HW_LCD_WF49_ADDR(x), ((uint8_t)(v) << BP_LCD_WF49_BPFLCD49), BP_LCD_WF49_BPFLCD49, 1))
/*@}*/

/*!
 * @name Register LCD_WF49, field BPGLCD49[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF49_BPGLCD49 (6U)          /*!< Bit position for LCD_WF49_BPGLCD49. */
#define BM_LCD_WF49_BPGLCD49 (0x40U)       /*!< Bit mask for LCD_WF49_BPGLCD49. */
#define BS_LCD_WF49_BPGLCD49 (1U)          /*!< Bit field size in bits for LCD_WF49_BPGLCD49. */

/*! @brief Read current value of the LCD_WF49_BPGLCD49 field. */
#define BR_LCD_WF49_BPGLCD49(x) (BME_UBFX8(HW_LCD_WF49_ADDR(x), BP_LCD_WF49_BPGLCD49, BS_LCD_WF49_BPGLCD49))

/*! @brief Format value for bitfield LCD_WF49_BPGLCD49. */
#define BF_LCD_WF49_BPGLCD49(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF49_BPGLCD49) & BM_LCD_WF49_BPGLCD49)

/*! @brief Set the BPGLCD49 field to a new value. */
#define BW_LCD_WF49_BPGLCD49(x, v) (BME_BFI8(HW_LCD_WF49_ADDR(x), ((uint8_t)(v) << BP_LCD_WF49_BPGLCD49), BP_LCD_WF49_BPGLCD49, 1))
/*@}*/

/*!
 * @name Register LCD_WF49, field BPHLCD49[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF49_BPHLCD49 (7U)          /*!< Bit position for LCD_WF49_BPHLCD49. */
#define BM_LCD_WF49_BPHLCD49 (0x80U)       /*!< Bit mask for LCD_WF49_BPHLCD49. */
#define BS_LCD_WF49_BPHLCD49 (1U)          /*!< Bit field size in bits for LCD_WF49_BPHLCD49. */

/*! @brief Read current value of the LCD_WF49_BPHLCD49 field. */
#define BR_LCD_WF49_BPHLCD49(x) (BME_UBFX8(HW_LCD_WF49_ADDR(x), BP_LCD_WF49_BPHLCD49, BS_LCD_WF49_BPHLCD49))

/*! @brief Format value for bitfield LCD_WF49_BPHLCD49. */
#define BF_LCD_WF49_BPHLCD49(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF49_BPHLCD49) & BM_LCD_WF49_BPHLCD49)

/*! @brief Set the BPHLCD49 field to a new value. */
#define BW_LCD_WF49_BPHLCD49(x, v) (BME_BFI8(HW_LCD_WF49_ADDR(x), ((uint8_t)(v) << BP_LCD_WF49_BPHLCD49), BP_LCD_WF49_BPHLCD49, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF50 - LCD Waveform Register 50.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF50 - LCD Waveform Register 50. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf50
{
    uint8_t U;
    struct _hw_lcd_wf50_bitfields
    {
        uint8_t BPALCD50 : 1;          /*!< [0]  */
        uint8_t BPBLCD50 : 1;          /*!< [1]  */
        uint8_t BPCLCD50 : 1;          /*!< [2]  */
        uint8_t BPDLCD50 : 1;          /*!< [3]  */
        uint8_t BPELCD50 : 1;          /*!< [4]  */
        uint8_t BPFLCD50 : 1;          /*!< [5]  */
        uint8_t BPGLCD50 : 1;          /*!< [6]  */
        uint8_t BPHLCD50 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf50_t;

/*!
 * @name Constants and macros for entire LCD_WF50 register
 */
/*@{*/
#define HW_LCD_WF50_ADDR(x)      ((uint32_t)(x) + 0x52U)

#define HW_LCD_WF50(x)           (*(__IO hw_lcd_wf50_t *) HW_LCD_WF50_ADDR(x))
#define HW_LCD_WF50_RD(x)        (HW_LCD_WF50(x).U)
#define HW_LCD_WF50_WR(x, v)     (HW_LCD_WF50(x).U = (v))
#define HW_LCD_WF50_SET(x, v)    (BME_OR8(HW_LCD_WF50_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF50_CLR(x, v)    (BME_AND8(HW_LCD_WF50_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF50_TOG(x, v)    (BME_XOR8(HW_LCD_WF50_ADDR(x), (uint8_t)(v)))
/*@}*/

