flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*
 * Constants & macros for individual LCD_WF50 bitfields
 */

/*!
 * @name Register LCD_WF50, field BPALCD50[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF50_BPALCD50 (0U)          /*!< Bit position for LCD_WF50_BPALCD50. */
#define BM_LCD_WF50_BPALCD50 (0x01U)       /*!< Bit mask for LCD_WF50_BPALCD50. */
#define BS_LCD_WF50_BPALCD50 (1U)          /*!< Bit field size in bits for LCD_WF50_BPALCD50. */

/*! @brief Read current value of the LCD_WF50_BPALCD50 field. */
#define BR_LCD_WF50_BPALCD50(x) (BME_UBFX8(HW_LCD_WF50_ADDR(x), BP_LCD_WF50_BPALCD50, BS_LCD_WF50_BPALCD50))

/*! @brief Format value for bitfield LCD_WF50_BPALCD50. */
#define BF_LCD_WF50_BPALCD50(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF50_BPALCD50) & BM_LCD_WF50_BPALCD50)

/*! @brief Set the BPALCD50 field to a new value. */
#define BW_LCD_WF50_BPALCD50(x, v) (BME_BFI8(HW_LCD_WF50_ADDR(x), ((uint8_t)(v) << BP_LCD_WF50_BPALCD50), BP_LCD_WF50_BPALCD50, 1))
/*@}*/

/*!
 * @name Register LCD_WF50, field BPBLCD50[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF50_BPBLCD50 (1U)          /*!< Bit position for LCD_WF50_BPBLCD50. */
#define BM_LCD_WF50_BPBLCD50 (0x02U)       /*!< Bit mask for LCD_WF50_BPBLCD50. */
#define BS_LCD_WF50_BPBLCD50 (1U)          /*!< Bit field size in bits for LCD_WF50_BPBLCD50. */

/*! @brief Read current value of the LCD_WF50_BPBLCD50 field. */
#define BR_LCD_WF50_BPBLCD50(x) (BME_UBFX8(HW_LCD_WF50_ADDR(x), BP_LCD_WF50_BPBLCD50, BS_LCD_WF50_BPBLCD50))

/*! @brief Format value for bitfield LCD_WF50_BPBLCD50. */
#define BF_LCD_WF50_BPBLCD50(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF50_BPBLCD50) & BM_LCD_WF50_BPBLCD50)

/*! @brief Set the BPBLCD50 field to a new value. */
#define BW_LCD_WF50_BPBLCD50(x, v) (BME_BFI8(HW_LCD_WF50_ADDR(x), ((uint8_t)(v) << BP_LCD_WF50_BPBLCD50), BP_LCD_WF50_BPBLCD50, 1))
/*@}*/

/*!
 * @name Register LCD_WF50, field BPCLCD50[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF50_BPCLCD50 (2U)          /*!< Bit position for LCD_WF50_BPCLCD50. */
#define BM_LCD_WF50_BPCLCD50 (0x04U)       /*!< Bit mask for LCD_WF50_BPCLCD50. */
#define BS_LCD_WF50_BPCLCD50 (1U)          /*!< Bit field size in bits for LCD_WF50_BPCLCD50. */

/*! @brief Read current value of the LCD_WF50_BPCLCD50 field. */
#define BR_LCD_WF50_BPCLCD50(x) (BME_UBFX8(HW_LCD_WF50_ADDR(x), BP_LCD_WF50_BPCLCD50, BS_LCD_WF50_BPCLCD50))

/*! @brief Format value for bitfield LCD_WF50_BPCLCD50. */
#define BF_LCD_WF50_BPCLCD50(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF50_BPCLCD50) & BM_LCD_WF50_BPCLCD50)

/*! @brief Set the BPCLCD50 field to a new value. */
#define BW_LCD_WF50_BPCLCD50(x, v) (BME_BFI8(HW_LCD_WF50_ADDR(x), ((uint8_t)(v) << BP_LCD_WF50_BPCLCD50), BP_LCD_WF50_BPCLCD50, 1))
/*@}*/

/*!
 * @name Register LCD_WF50, field BPDLCD50[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF50_BPDLCD50 (3U)          /*!< Bit position for LCD_WF50_BPDLCD50. */
#define BM_LCD_WF50_BPDLCD50 (0x08U)       /*!< Bit mask for LCD_WF50_BPDLCD50. */
#define BS_LCD_WF50_BPDLCD50 (1U)          /*!< Bit field size in bits for LCD_WF50_BPDLCD50. */

/*! @brief Read current value of the LCD_WF50_BPDLCD50 field. */
#define BR_LCD_WF50_BPDLCD50(x) (BME_UBFX8(HW_LCD_WF50_ADDR(x), BP_LCD_WF50_BPDLCD50, BS_LCD_WF50_BPDLCD50))

/*! @brief Format value for bitfield LCD_WF50_BPDLCD50. */
#define BF_LCD_WF50_BPDLCD50(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF50_BPDLCD50) & BM_LCD_WF50_BPDLCD50)

/*! @brief Set the BPDLCD50 field to a new value. */
#define BW_LCD_WF50_BPDLCD50(x, v) (BME_BFI8(HW_LCD_WF50_ADDR(x), ((uint8_t)(v) << BP_LCD_WF50_BPDLCD50), BP_LCD_WF50_BPDLCD50, 1))
/*@}*/

/*!
 * @name Register LCD_WF50, field BPELCD50[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF50_BPELCD50 (4U)          /*!< Bit position for LCD_WF50_BPELCD50. */
#define BM_LCD_WF50_BPELCD50 (0x10U)       /*!< Bit mask for LCD_WF50_BPELCD50. */
#define BS_LCD_WF50_BPELCD50 (1U)          /*!< Bit field size in bits for LCD_WF50_BPELCD50. */

/*! @brief Read current value of the LCD_WF50_BPELCD50 field. */
#define BR_LCD_WF50_BPELCD50(x) (BME_UBFX8(HW_LCD_WF50_ADDR(x), BP_LCD_WF50_BPELCD50, BS_LCD_WF50_BPELCD50))

/*! @brief Format value for bitfield LCD_WF50_BPELCD50. */
#define BF_LCD_WF50_BPELCD50(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF50_BPELCD50) & BM_LCD_WF50_BPELCD50)

/*! @brief Set the BPELCD50 field to a new value. */
#define BW_LCD_WF50_BPELCD50(x, v) (BME_BFI8(HW_LCD_WF50_ADDR(x), ((uint8_t)(v) << BP_LCD_WF50_BPELCD50), BP_LCD_WF50_BPELCD50, 1))
/*@}*/

/*!
 * @name Register LCD_WF50, field BPFLCD50[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF50_BPFLCD50 (5U)          /*!< Bit position for LCD_WF50_BPFLCD50. */
#define BM_LCD_WF50_BPFLCD50 (0x20U)       /*!< Bit mask for LCD_WF50_BPFLCD50. */
#define BS_LCD_WF50_BPFLCD50 (1U)          /*!< Bit field size in bits for LCD_WF50_BPFLCD50. */

/*! @brief Read current value of the LCD_WF50_BPFLCD50 field. */
#define BR_LCD_WF50_BPFLCD50(x) (BME_UBFX8(HW_LCD_WF50_ADDR(x), BP_LCD_WF50_BPFLCD50, BS_LCD_WF50_BPFLCD50))

/*! @brief Format value for bitfield LCD_WF50_BPFLCD50. */
#define BF_LCD_WF50_BPFLCD50(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF50_BPFLCD50) & BM_LCD_WF50_BPFLCD50)

/*! @brief Set the BPFLCD50 field to a new value. */
#define BW_LCD_WF50_BPFLCD50(x, v) (BME_BFI8(HW_LCD_WF50_ADDR(x), ((uint8_t)(v) << BP_LCD_WF50_BPFLCD50), BP_LCD_WF50_BPFLCD50, 1))
/*@}*/

/*!
 * @name Register LCD_WF50, field BPGLCD50[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF50_BPGLCD50 (6U)          /*!< Bit position for LCD_WF50_BPGLCD50. */
#define BM_LCD_WF50_BPGLCD50 (0x40U)       /*!< Bit mask for LCD_WF50_BPGLCD50. */
#define BS_LCD_WF50_BPGLCD50 (1U)          /*!< Bit field size in bits for LCD_WF50_BPGLCD50. */

/*! @brief Read current value of the LCD_WF50_BPGLCD50 field. */
#define BR_LCD_WF50_BPGLCD50(x) (BME_UBFX8(HW_LCD_WF50_ADDR(x), BP_LCD_WF50_BPGLCD50, BS_LCD_WF50_BPGLCD50))

/*! @brief Format value for bitfield LCD_WF50_BPGLCD50. */
#define BF_LCD_WF50_BPGLCD50(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF50_BPGLCD50) & BM_LCD_WF50_BPGLCD50)

