flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*
 * Constants & macros for individual LCD_WF58 bitfields
 */

/*!
 * @name Register LCD_WF58, field BPALCD58[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF58_BPALCD58 (0U)          /*!< Bit position for LCD_WF58_BPALCD58. */
#define BM_LCD_WF58_BPALCD58 (0x01U)       /*!< Bit mask for LCD_WF58_BPALCD58. */
#define BS_LCD_WF58_BPALCD58 (1U)          /*!< Bit field size in bits for LCD_WF58_BPALCD58. */

/*! @brief Read current value of the LCD_WF58_BPALCD58 field. */
#define BR_LCD_WF58_BPALCD58(x) (BME_UBFX8(HW_LCD_WF58_ADDR(x), BP_LCD_WF58_BPALCD58, BS_LCD_WF58_BPALCD58))

/*! @brief Format value for bitfield LCD_WF58_BPALCD58. */
#define BF_LCD_WF58_BPALCD58(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF58_BPALCD58) & BM_LCD_WF58_BPALCD58)

/*! @brief Set the BPALCD58 field to a new value. */
#define BW_LCD_WF58_BPALCD58(x, v) (BME_BFI8(HW_LCD_WF58_ADDR(x), ((uint8_t)(v) << BP_LCD_WF58_BPALCD58), BP_LCD_WF58_BPALCD58, 1))
/*@}*/

/*!
 * @name Register LCD_WF58, field BPBLCD58[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF58_BPBLCD58 (1U)          /*!< Bit position for LCD_WF58_BPBLCD58. */
#define BM_LCD_WF58_BPBLCD58 (0x02U)       /*!< Bit mask for LCD_WF58_BPBLCD58. */
#define BS_LCD_WF58_BPBLCD58 (1U)          /*!< Bit field size in bits for LCD_WF58_BPBLCD58. */

/*! @brief Read current value of the LCD_WF58_BPBLCD58 field. */
#define BR_LCD_WF58_BPBLCD58(x) (BME_UBFX8(HW_LCD_WF58_ADDR(x), BP_LCD_WF58_BPBLCD58, BS_LCD_WF58_BPBLCD58))

/*! @brief Format value for bitfield LCD_WF58_BPBLCD58. */
#define BF_LCD_WF58_BPBLCD58(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF58_BPBLCD58) & BM_LCD_WF58_BPBLCD58)

/*! @brief Set the BPBLCD58 field to a new value. */
#define BW_LCD_WF58_BPBLCD58(x, v) (BME_BFI8(HW_LCD_WF58_ADDR(x), ((uint8_t)(v) << BP_LCD_WF58_BPBLCD58), BP_LCD_WF58_BPBLCD58, 1))
/*@}*/

/*!
 * @name Register LCD_WF58, field BPCLCD58[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF58_BPCLCD58 (2U)          /*!< Bit position for LCD_WF58_BPCLCD58. */
#define BM_LCD_WF58_BPCLCD58 (0x04U)       /*!< Bit mask for LCD_WF58_BPCLCD58. */
#define BS_LCD_WF58_BPCLCD58 (1U)          /*!< Bit field size in bits for LCD_WF58_BPCLCD58. */

/*! @brief Read current value of the LCD_WF58_BPCLCD58 field. */
#define BR_LCD_WF58_BPCLCD58(x) (BME_UBFX8(HW_LCD_WF58_ADDR(x), BP_LCD_WF58_BPCLCD58, BS_LCD_WF58_BPCLCD58))

/*! @brief Format value for bitfield LCD_WF58_BPCLCD58. */
#define BF_LCD_WF58_BPCLCD58(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF58_BPCLCD58) & BM_LCD_WF58_BPCLCD58)

/*! @brief Set the BPCLCD58 field to a new value. */
#define BW_LCD_WF58_BPCLCD58(x, v) (BME_BFI8(HW_LCD_WF58_ADDR(x), ((uint8_t)(v) << BP_LCD_WF58_BPCLCD58), BP_LCD_WF58_BPCLCD58, 1))
/*@}*/

/*!
 * @name Register LCD_WF58, field BPDLCD58[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF58_BPDLCD58 (3U)          /*!< Bit position for LCD_WF58_BPDLCD58. */
#define BM_LCD_WF58_BPDLCD58 (0x08U)       /*!< Bit mask for LCD_WF58_BPDLCD58. */
#define BS_LCD_WF58_BPDLCD58 (1U)          /*!< Bit field size in bits for LCD_WF58_BPDLCD58. */

/*! @brief Read current value of the LCD_WF58_BPDLCD58 field. */
#define BR_LCD_WF58_BPDLCD58(x) (BME_UBFX8(HW_LCD_WF58_ADDR(x), BP_LCD_WF58_BPDLCD58, BS_LCD_WF58_BPDLCD58))

/*! @brief Format value for bitfield LCD_WF58_BPDLCD58. */
#define BF_LCD_WF58_BPDLCD58(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF58_BPDLCD58) & BM_LCD_WF58_BPDLCD58)

/*! @brief Set the BPDLCD58 field to a new value. */
#define BW_LCD_WF58_BPDLCD58(x, v) (BME_BFI8(HW_LCD_WF58_ADDR(x), ((uint8_t)(v) << BP_LCD_WF58_BPDLCD58), BP_LCD_WF58_BPDLCD58, 1))
/*@}*/

/*!
 * @name Register LCD_WF58, field BPELCD58[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF58_BPELCD58 (4U)          /*!< Bit position for LCD_WF58_BPELCD58. */
#define BM_LCD_WF58_BPELCD58 (0x10U)       /*!< Bit mask for LCD_WF58_BPELCD58. */
#define BS_LCD_WF58_BPELCD58 (1U)          /*!< Bit field size in bits for LCD_WF58_BPELCD58. */

/*! @brief Read current value of the LCD_WF58_BPELCD58 field. */
#define BR_LCD_WF58_BPELCD58(x) (BME_UBFX8(HW_LCD_WF58_ADDR(x), BP_LCD_WF58_BPELCD58, BS_LCD_WF58_BPELCD58))

/*! @brief Format value for bitfield LCD_WF58_BPELCD58. */
#define BF_LCD_WF58_BPELCD58(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF58_BPELCD58) & BM_LCD_WF58_BPELCD58)

/*! @brief Set the BPELCD58 field to a new value. */
#define BW_LCD_WF58_BPELCD58(x, v) (BME_BFI8(HW_LCD_WF58_ADDR(x), ((uint8_t)(v) << BP_LCD_WF58_BPELCD58), BP_LCD_WF58_BPELCD58, 1))
/*@}*/

/*!
 * @name Register LCD_WF58, field BPFLCD58[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF58_BPFLCD58 (5U)          /*!< Bit position for LCD_WF58_BPFLCD58. */
#define BM_LCD_WF58_BPFLCD58 (0x20U)       /*!< Bit mask for LCD_WF58_BPFLCD58. */
#define BS_LCD_WF58_BPFLCD58 (1U)          /*!< Bit field size in bits for LCD_WF58_BPFLCD58. */

/*! @brief Read current value of the LCD_WF58_BPFLCD58 field. */
#define BR_LCD_WF58_BPFLCD58(x) (BME_UBFX8(HW_LCD_WF58_ADDR(x), BP_LCD_WF58_BPFLCD58, BS_LCD_WF58_BPFLCD58))

/*! @brief Format value for bitfield LCD_WF58_BPFLCD58. */
#define BF_LCD_WF58_BPFLCD58(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF58_BPFLCD58) & BM_LCD_WF58_BPFLCD58)

/*! @brief Set the BPFLCD58 field to a new value. */
#define BW_LCD_WF58_BPFLCD58(x, v) (BME_BFI8(HW_LCD_WF58_ADDR(x), ((uint8_t)(v) << BP_LCD_WF58_BPFLCD58), BP_LCD_WF58_BPFLCD58, 1))
/*@}*/

/*!
 * @name Register LCD_WF58, field BPGLCD58[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF58_BPGLCD58 (6U)          /*!< Bit position for LCD_WF58_BPGLCD58. */
#define BM_LCD_WF58_BPGLCD58 (0x40U)       /*!< Bit mask for LCD_WF58_BPGLCD58. */
#define BS_LCD_WF58_BPGLCD58 (1U)          /*!< Bit field size in bits for LCD_WF58_BPGLCD58. */

