flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
/*! @brief Format value for bitfield LCD_WF62_BPBLCD62. */
#define BF_LCD_WF62_BPBLCD62(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF62_BPBLCD62) & BM_LCD_WF62_BPBLCD62)

/*! @brief Set the BPBLCD62 field to a new value. */
#define BW_LCD_WF62_BPBLCD62(x, v) (BME_BFI8(HW_LCD_WF62_ADDR(x), ((uint8_t)(v) << BP_LCD_WF62_BPBLCD62), BP_LCD_WF62_BPBLCD62, 1))
/*@}*/

/*!
 * @name Register LCD_WF62, field BPCLCD62[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF62_BPCLCD62 (2U)          /*!< Bit position for LCD_WF62_BPCLCD62. */
#define BM_LCD_WF62_BPCLCD62 (0x04U)       /*!< Bit mask for LCD_WF62_BPCLCD62. */
#define BS_LCD_WF62_BPCLCD62 (1U)          /*!< Bit field size in bits for LCD_WF62_BPCLCD62. */

/*! @brief Read current value of the LCD_WF62_BPCLCD62 field. */
#define BR_LCD_WF62_BPCLCD62(x) (BME_UBFX8(HW_LCD_WF62_ADDR(x), BP_LCD_WF62_BPCLCD62, BS_LCD_WF62_BPCLCD62))

/*! @brief Format value for bitfield LCD_WF62_BPCLCD62. */
#define BF_LCD_WF62_BPCLCD62(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF62_BPCLCD62) & BM_LCD_WF62_BPCLCD62)

/*! @brief Set the BPCLCD62 field to a new value. */
#define BW_LCD_WF62_BPCLCD62(x, v) (BME_BFI8(HW_LCD_WF62_ADDR(x), ((uint8_t)(v) << BP_LCD_WF62_BPCLCD62), BP_LCD_WF62_BPCLCD62, 1))
/*@}*/

/*!
 * @name Register LCD_WF62, field BPDLCD62[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF62_BPDLCD62 (3U)          /*!< Bit position for LCD_WF62_BPDLCD62. */
#define BM_LCD_WF62_BPDLCD62 (0x08U)       /*!< Bit mask for LCD_WF62_BPDLCD62. */
#define BS_LCD_WF62_BPDLCD62 (1U)          /*!< Bit field size in bits for LCD_WF62_BPDLCD62. */

/*! @brief Read current value of the LCD_WF62_BPDLCD62 field. */
#define BR_LCD_WF62_BPDLCD62(x) (BME_UBFX8(HW_LCD_WF62_ADDR(x), BP_LCD_WF62_BPDLCD62, BS_LCD_WF62_BPDLCD62))

/*! @brief Format value for bitfield LCD_WF62_BPDLCD62. */
#define BF_LCD_WF62_BPDLCD62(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF62_BPDLCD62) & BM_LCD_WF62_BPDLCD62)

/*! @brief Set the BPDLCD62 field to a new value. */
#define BW_LCD_WF62_BPDLCD62(x, v) (BME_BFI8(HW_LCD_WF62_ADDR(x), ((uint8_t)(v) << BP_LCD_WF62_BPDLCD62), BP_LCD_WF62_BPDLCD62, 1))
/*@}*/

/*!
 * @name Register LCD_WF62, field BPELCD62[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF62_BPELCD62 (4U)          /*!< Bit position for LCD_WF62_BPELCD62. */
#define BM_LCD_WF62_BPELCD62 (0x10U)       /*!< Bit mask for LCD_WF62_BPELCD62. */
#define BS_LCD_WF62_BPELCD62 (1U)          /*!< Bit field size in bits for LCD_WF62_BPELCD62. */

/*! @brief Read current value of the LCD_WF62_BPELCD62 field. */
#define BR_LCD_WF62_BPELCD62(x) (BME_UBFX8(HW_LCD_WF62_ADDR(x), BP_LCD_WF62_BPELCD62, BS_LCD_WF62_BPELCD62))

/*! @brief Format value for bitfield LCD_WF62_BPELCD62. */
#define BF_LCD_WF62_BPELCD62(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF62_BPELCD62) & BM_LCD_WF62_BPELCD62)

/*! @brief Set the BPELCD62 field to a new value. */
#define BW_LCD_WF62_BPELCD62(x, v) (BME_BFI8(HW_LCD_WF62_ADDR(x), ((uint8_t)(v) << BP_LCD_WF62_BPELCD62), BP_LCD_WF62_BPELCD62, 1))
/*@}*/

/*!
 * @name Register LCD_WF62, field BPFLCD62[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF62_BPFLCD62 (5U)          /*!< Bit position for LCD_WF62_BPFLCD62. */
#define BM_LCD_WF62_BPFLCD62 (0x20U)       /*!< Bit mask for LCD_WF62_BPFLCD62. */
#define BS_LCD_WF62_BPFLCD62 (1U)          /*!< Bit field size in bits for LCD_WF62_BPFLCD62. */

/*! @brief Read current value of the LCD_WF62_BPFLCD62 field. */
#define BR_LCD_WF62_BPFLCD62(x) (BME_UBFX8(HW_LCD_WF62_ADDR(x), BP_LCD_WF62_BPFLCD62, BS_LCD_WF62_BPFLCD62))

/*! @brief Format value for bitfield LCD_WF62_BPFLCD62. */
#define BF_LCD_WF62_BPFLCD62(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF62_BPFLCD62) & BM_LCD_WF62_BPFLCD62)

/*! @brief Set the BPFLCD62 field to a new value. */
#define BW_LCD_WF62_BPFLCD62(x, v) (BME_BFI8(HW_LCD_WF62_ADDR(x), ((uint8_t)(v) << BP_LCD_WF62_BPFLCD62), BP_LCD_WF62_BPFLCD62, 1))
/*@}*/

/*!
 * @name Register LCD_WF62, field BPGLCD62[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF62_BPGLCD62 (6U)          /*!< Bit position for LCD_WF62_BPGLCD62. */
#define BM_LCD_WF62_BPGLCD62 (0x40U)       /*!< Bit mask for LCD_WF62_BPGLCD62. */
#define BS_LCD_WF62_BPGLCD62 (1U)          /*!< Bit field size in bits for LCD_WF62_BPGLCD62. */

/*! @brief Read current value of the LCD_WF62_BPGLCD62 field. */
#define BR_LCD_WF62_BPGLCD62(x) (BME_UBFX8(HW_LCD_WF62_ADDR(x), BP_LCD_WF62_BPGLCD62, BS_LCD_WF62_BPGLCD62))

/*! @brief Format value for bitfield LCD_WF62_BPGLCD62. */
#define BF_LCD_WF62_BPGLCD62(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF62_BPGLCD62) & BM_LCD_WF62_BPGLCD62)

/*! @brief Set the BPGLCD62 field to a new value. */
#define BW_LCD_WF62_BPGLCD62(x, v) (BME_BFI8(HW_LCD_WF62_ADDR(x), ((uint8_t)(v) << BP_LCD_WF62_BPGLCD62), BP_LCD_WF62_BPGLCD62, 1))
/*@}*/

/*!
 * @name Register LCD_WF62, field BPHLCD62[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF62_BPHLCD62 (7U)          /*!< Bit position for LCD_WF62_BPHLCD62. */
#define BM_LCD_WF62_BPHLCD62 (0x80U)       /*!< Bit mask for LCD_WF62_BPHLCD62. */
#define BS_LCD_WF62_BPHLCD62 (1U)          /*!< Bit field size in bits for LCD_WF62_BPHLCD62. */

/*! @brief Read current value of the LCD_WF62_BPHLCD62 field. */
#define BR_LCD_WF62_BPHLCD62(x) (BME_UBFX8(HW_LCD_WF62_ADDR(x), BP_LCD_WF62_BPHLCD62, BS_LCD_WF62_BPHLCD62))

/*! @brief Format value for bitfield LCD_WF62_BPHLCD62. */
#define BF_LCD_WF62_BPHLCD62(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF62_BPHLCD62) & BM_LCD_WF62_BPHLCD62)

/*! @brief Set the BPHLCD62 field to a new value. */
#define BW_LCD_WF62_BPHLCD62(x, v) (BME_BFI8(HW_LCD_WF62_ADDR(x), ((uint8_t)(v) << BP_LCD_WF62_BPHLCD62), BP_LCD_WF62_BPHLCD62, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF63 - LCD Waveform Register 63.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF63 - LCD Waveform Register 63. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf63
{
    uint8_t U;
    struct _hw_lcd_wf63_bitfields
    {
        uint8_t BPALCD63 : 1;          /*!< [0]  */
        uint8_t BPBLCD63 : 1;          /*!< [1]  */
        uint8_t BPCLCD63 : 1;          /*!< [2]  */
        uint8_t BPDLCD63 : 1;          /*!< [3]  */
        uint8_t BPELCD63 : 1;          /*!< [4]  */
        uint8_t BPFLCD63 : 1;          /*!< [5]  */
        uint8_t BPGLCD63 : 1;          /*!< [6]  */
        uint8_t BPHLCD63 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf63_t;

/*!
 * @name Constants and macros for entire LCD_WF63 register
 */
/*@{*/
#define HW_LCD_WF63_ADDR(x)      ((uint32_t)(x) + 0x5FU)

#define HW_LCD_WF63(x)           (*(__IO hw_lcd_wf63_t *) HW_LCD_WF63_ADDR(x))
#define HW_LCD_WF63_RD(x)        (HW_LCD_WF63(x).U)
#define HW_LCD_WF63_WR(x, v)     (HW_LCD_WF63(x).U = (v))
#define HW_LCD_WF63_SET(x, v)    (BME_OR8(HW_LCD_WF63_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF63_CLR(x, v)    (BME_AND8(HW_LCD_WF63_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF63_TOG(x, v)    (BME_XOR8(HW_LCD_WF63_ADDR(x), (uint8_t)(v)))
/*@}*/

