flit/argon-rtos/src/include/device/MKL43Z4/MKL43Z4_registers.h
#define HW_RCM_RPFW(x)           (*(__IO hw_rcm_rpfw_t *) HW_RCM_RPFW_ADDR(x))
#define HW_RCM_RPFW_RD(x)        (HW_RCM_RPFW(x).U)
#define HW_RCM_RPFW_WR(x, v)     (HW_RCM_RPFW(x).U = (v))
#define HW_RCM_RPFW_SET(x, v)    (BME_OR8(HW_RCM_RPFW_ADDR(x), (uint8_t)(v)))
#define HW_RCM_RPFW_CLR(x, v)    (BME_AND8(HW_RCM_RPFW_ADDR(x), (uint8_t)(~(v))))
#define HW_RCM_RPFW_TOG(x, v)    (BME_XOR8(HW_RCM_RPFW_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual RCM_RPFW bitfields
 */

/*!
 * @name Register RCM_RPFW, field RSTFLTSEL[4:0] (RW)
 *
 * Selects the reset pin bus clock filter width.
 *
 * Values:
 * - 00000 - Bus clock filter count is 1
 * - 00001 - Bus clock filter count is 2
 * - 00010 - Bus clock filter count is 3
 * - 00011 - Bus clock filter count is 4
 * - 00100 - Bus clock filter count is 5
 * - 00101 - Bus clock filter count is 6
 * - 00110 - Bus clock filter count is 7
 * - 00111 - Bus clock filter count is 8
 * - 01000 - Bus clock filter count is 9
 * - 01001 - Bus clock filter count is 10
 * - 01010 - Bus clock filter count is 11
 * - 01011 - Bus clock filter count is 12
 * - 01100 - Bus clock filter count is 13
 * - 01101 - Bus clock filter count is 14
 * - 01110 - Bus clock filter count is 15
 * - 01111 - Bus clock filter count is 16
 * - 10000 - Bus clock filter count is 17
 * - 10001 - Bus clock filter count is 18
 * - 10010 - Bus clock filter count is 19
 * - 10011 - Bus clock filter count is 20
 * - 10100 - Bus clock filter count is 21
 * - 10101 - Bus clock filter count is 22
 * - 10110 - Bus clock filter count is 23
 * - 10111 - Bus clock filter count is 24
 * - 11000 - Bus clock filter count is 25
 * - 11001 - Bus clock filter count is 26
 * - 11010 - Bus clock filter count is 27
 * - 11011 - Bus clock filter count is 28
 * - 11100 - Bus clock filter count is 29
 * - 11101 - Bus clock filter count is 30
 * - 11110 - Bus clock filter count is 31
 * - 11111 - Bus clock filter count is 32
 */
/*@{*/
#define BP_RCM_RPFW_RSTFLTSEL (0U)         /*!< Bit position for RCM_RPFW_RSTFLTSEL. */
#define BM_RCM_RPFW_RSTFLTSEL (0x1FU)      /*!< Bit mask for RCM_RPFW_RSTFLTSEL. */
#define BS_RCM_RPFW_RSTFLTSEL (5U)         /*!< Bit field size in bits for RCM_RPFW_RSTFLTSEL. */

/*! @brief Read current value of the RCM_RPFW_RSTFLTSEL field. */
#define BR_RCM_RPFW_RSTFLTSEL(x) (BME_UBFX8(HW_RCM_RPFW_ADDR(x), BP_RCM_RPFW_RSTFLTSEL, BS_RCM_RPFW_RSTFLTSEL))

/*! @brief Format value for bitfield RCM_RPFW_RSTFLTSEL. */
#define BF_RCM_RPFW_RSTFLTSEL(v) ((uint8_t)((uint8_t)(v) << BP_RCM_RPFW_RSTFLTSEL) & BM_RCM_RPFW_RSTFLTSEL)

/*! @brief Set the RSTFLTSEL field to a new value. */
#define BW_RCM_RPFW_RSTFLTSEL(x, v) (BME_BFI8(HW_RCM_RPFW_ADDR(x), ((uint8_t)(v) << BP_RCM_RPFW_RSTFLTSEL), BP_RCM_RPFW_RSTFLTSEL, 5))
/*@}*/

/*******************************************************************************
 * HW_RCM_FM - Force Mode Register
 ******************************************************************************/

/*!
 * @brief HW_RCM_FM - Force Mode Register (RW)
 *
 * Reset value: 0x00U
 *
 * The reset values of the bits in the FORCEROM field are for Chip POR only.
 * They are unaffected by other reset types.
 */
typedef union _hw_rcm_fm
{
    uint8_t U;
    struct _hw_rcm_fm_bitfields
    {
        uint8_t RESERVED0 : 1;         /*!< [0]  */
        uint8_t FORCEROM : 2;          /*!< [2:1] Force ROM Boot */
        uint8_t RESERVED1 : 5;         /*!< [7:3]  */
    } B;
} hw_rcm_fm_t;

/*!
 * @name Constants and macros for entire RCM_FM register
 */
/*@{*/
#define HW_RCM_FM_ADDR(x)        ((uint32_t)(x) + 0x6U)

#define HW_RCM_FM(x)             (*(__IO hw_rcm_fm_t *) HW_RCM_FM_ADDR(x))
#define HW_RCM_FM_RD(x)          (HW_RCM_FM(x).U)
#define HW_RCM_FM_WR(x, v)       (HW_RCM_FM(x).U = (v))
#define HW_RCM_FM_SET(x, v)      (BME_OR8(HW_RCM_FM_ADDR(x), (uint8_t)(v)))
#define HW_RCM_FM_CLR(x, v)      (BME_AND8(HW_RCM_FM_ADDR(x), (uint8_t)(~(v))))
#define HW_RCM_FM_TOG(x, v)      (BME_XOR8(HW_RCM_FM_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual RCM_FM bitfields
 */

/*!
 * @name Register RCM_FM, field FORCEROM[2:1] (RW)
 *
 * When either bit is set, will force boot from ROM during all subsequent system
 * resets.
 *
 * Values:
 * - 00 - No effect
 * - 01 - Force boot from ROM with RCM_MR[1] set.
 * - 10 - Force boot from ROM with RCM_MR[2] set.
 * - 11 - Force boot from ROM with RCM_MR[2:1] set.
 */
/*@{*/
#define BP_RCM_FM_FORCEROM   (1U)          /*!< Bit position for RCM_FM_FORCEROM. */
#define BM_RCM_FM_FORCEROM   (0x06U)       /*!< Bit mask for RCM_FM_FORCEROM. */
#define BS_RCM_FM_FORCEROM   (2U)          /*!< Bit field size in bits for RCM_FM_FORCEROM. */

/*! @brief Read current value of the RCM_FM_FORCEROM field. */
#define BR_RCM_FM_FORCEROM(x) (BME_UBFX8(HW_RCM_FM_ADDR(x), BP_RCM_FM_FORCEROM, BS_RCM_FM_FORCEROM))

/*! @brief Format value for bitfield RCM_FM_FORCEROM. */
#define BF_RCM_FM_FORCEROM(v) ((uint8_t)((uint8_t)(v) << BP_RCM_FM_FORCEROM) & BM_RCM_FM_FORCEROM)

/*! @brief Set the FORCEROM field to a new value. */
#define BW_RCM_FM_FORCEROM(x, v) (BME_BFI8(HW_RCM_FM_ADDR(x), ((uint8_t)(v) << BP_RCM_FM_FORCEROM), BP_RCM_FM_FORCEROM, 2))
/*@}*/

/*******************************************************************************
 * HW_RCM_MR - Mode Register
 ******************************************************************************/

/*!
 * @brief HW_RCM_MR - Mode Register (RW)
 *
 * Reset value: 0x00U
 *
 * This register includes status flags to indicate the state of the mode pins
 * during the last Chip Reset.
 */
typedef union _hw_rcm_mr
{
    uint8_t U;
    struct _hw_rcm_mr_bitfields
    {
        uint8_t RESERVED0 : 1;         /*!< [0]  */
        uint8_t BOOTROM : 2;           /*!< [2:1] Boot ROM Configuration */
        uint8_t RESERVED1 : 5;         /*!< [7:3]  */
    } B;
} hw_rcm_mr_t;

/*!
 * @name Constants and macros for entire RCM_MR register
 */
/*@{*/
#define HW_RCM_MR_ADDR(x)        ((uint32_t)(x) + 0x7U)

#define HW_RCM_MR(x)             (*(__IO hw_rcm_mr_t *) HW_RCM_MR_ADDR(x))
#define HW_RCM_MR_RD(x)          (HW_RCM_MR(x).U)
#define HW_RCM_MR_WR(x, v)       (HW_RCM_MR(x).U = (v))
#define HW_RCM_MR_SET(x, v)      (BME_OR8(HW_RCM_MR_ADDR(x), (uint8_t)(v)))
#define HW_RCM_MR_CLR(x, v)      (BME_AND8(HW_RCM_MR_ADDR(x), (uint8_t)(~(v))))
#define HW_RCM_MR_TOG(x, v)      (BME_XOR8(HW_RCM_MR_ADDR(x), (uint8_t)(v)))
/*@}*/

